Перем Ф;
Перем Вкладка1;
Перем Вкладка2;
Перем Вкладка3;
Перем Вкладка4;
Перем Вкладка5;
Перем Вкладка6;
Перем Вкладка7;
Перем Вкладка8;
Перем Вкладка9;
Перем Вкладка10;
Перем Кнопка1;
Перем Надпись1;
Перем Надпись2;
Перем Надпись3;
Перем Надпись4;
Перем Надпись6;
Перем Надпись7;
Перем Надпись8;
Перем Надпись9;
Перем Надпись10;
Перем Надпись11;
Перем Надпись12;
Перем Надпись13;
Перем Надпись14;
Перем Надпись15;
Перем Надпись16;
Перем Надпись17;
Перем Надпись18;
Перем Надпись19;
Перем Надпись20;
Перем Надпись21;
Перем Надпись22;
Перем Надпись23;
Перем Надпись24;
Перем Надпись25;
Перем Надпись26;
Перем Надпись27;
Перем Надпись28;
Перем Надпись29;
Перем Надпись30;
Перем Надпись31;
Перем Надпись32;
Перем Надпись33;
Перем Надпись34;
Перем Надпись35;
Перем Надпись36;
Перем Надпись37;
Перем Надпись38;
Перем Надпись39;
Перем Надпись40;
Перем Надпись41;
Перем Надпись42;
Перем Надпись43;
Перем Надпись44;
Перем Надпись45;
Перем Надпись46;
Перем Надпись47;
Перем Надпись48;
Перем Надпись49;
Перем Надпись50;
Перем ПанельВкладок1;
Перем ПолеВвода1;
Перем ПолеВвода2;
Перем ПолеВвода3;
Перем ПолеВвода4;
Перем ПолеВвода5;
Перем ПолеВвода8;
Перем ПолеВвода9;
Перем ПолеВвода10;
Перем ПолеВвода11;
Перем ПолеВвода12;
Перем ПолеВвода13;
Перем ПолеВвода14;
Перем ПолеВвода15;
Перем ПолеВвода16;
Перем ПолеВвода17;
Перем ПолеВвода18;
Перем ПолеВвода19;
Перем ПолеВвода20;
Перем ПолеВвода21;
Перем ПолеВвода22;
Перем ПолеВвода23;
Перем ПолеВвода24;
Перем ПолеВвода25;
Перем ПолеВвода26;
Перем ПолеВвода27;
Перем ПолеВвода28;
Перем ПолеВыбора1;
Перем ПолеВыбора2;
Перем ПолеВыбора3;
Перем ПолеВыбора4;
Перем ПолеВыбора5;
Перем ПолеВыбора6;
Перем ПолеВыбора7;
Перем ПолеВыбора8;
Перем ПолеВыбора9;
Перем ПолеВыбора10;
Перем ПолеВыбора11;
Перем ПолеВыбора12;
Перем ПолеВыбора13;
Перем ПолеВыбора14;
Перем ПолеВыбора15;
Перем ПолеВыбора16;
Перем ПолеВыбора17;
Перем ПолеВыбора18;
Перем ПолеВыбора19;
Перем ПолеВыбора20;
Перем ПолеВыбора21;
Перем Форма_0;

Перем КлассИмяРус;
Перем КлассИмяEn;
Перем МетодИмяРус;
Перем МетодИмяEn;
Перем МетодОписание;
Перем ВозвращаемоеЗначениеТип;
Перем ВозвращаемоеЗначениеОписание;
Перем М_Параметров;
Перем ВыходнойКаталог;
Перем Наследники;
Перем ПолеВыбора22;
Перем ПолеСписка1;
Перем СписокЭлементов1;
Перем Надпись51;
Перем ПолеВыбора23;
Перем ТекстНаследования;
Перем Надпись52;
Перем ПолеВыбора24;
Перем Кнопка2;
Перем Надпись53;
Перем ПолеВыбора25;
Перем РамкаГруппы1;
Перем БезСообщения;
Перем Флажок1;

Перем ПутьКСтранице;
Перем ПутьКДокументации;
Перем ПутьКОглавлению;

Процедура Кн1_Нажатие() Экспорт
	М = РазобратьСтроку(ПолеВыбора22.Текст, " ");
	КлассИмяРус = М[0];
	КлассИмяEn = М[1];
	МетодИмяРус = СокрЛП(ПолеВвода4.Текст);
	МетодИмяEn = СокрЛП(ПолеВвода5.Текст);
	МетодОписание = СокрЛП(ПолеВвода3.Текст);
	ВозвращаемоеЗначениеТип = СокрЛП(ПолеВыбора2.Текст);
	ВозвращаемоеЗначениеОписание = СокрЛП(ПолеВвода8.Текст);
	
	ТекстНаследования = "";
	Если СокрЛП(ПолеВыбора23.Текст) <> "" Тогда
		М4 = РазобратьСтроку(ПолеВыбора23.Текст, " ");
		Если М4.Количество() = 2 Тогда
			ТекстНаследования = " (унаследовано от " + М4[0] + " (" + М4[1] + "))";
		КонецЕсли;
	КонецЕсли;
	
	М_Параметров.Очистить();
	
	Если Не (СокрЛП(ПолеВвода9.Текст) = "") Тогда
		Парам1Имя = СокрЛП(ПолеВвода9.Текст);
		Парам1Обязательный = СокрЛП(ПолеВыбора1.Текст);
		Парам1Тип = СокрЛП(ПолеВыбора3.Текст);
		Парам1Описание = СокрЛП(ПолеВвода10.Текст);
		М_Параметров.Добавить(Парам1Имя + ";;;" + Парам1Обязательный + ";;;" + Парам1Тип + ";;;" + Парам1Описание);
	КонецЕсли;
	Если Не (СокрЛП(ПолеВвода12.Текст) = "") Тогда
		Парам1Имя = СокрЛП(ПолеВвода12.Текст);
		Парам1Обязательный = СокрЛП(ПолеВыбора5.Текст);
		Парам1Тип = СокрЛП(ПолеВыбора4.Текст);
		Парам1Описание = СокрЛП(ПолеВвода11.Текст);
		М_Параметров.Добавить(Парам1Имя + ";;;" + Парам1Обязательный + ";;;" + Парам1Тип + ";;;" + Парам1Описание);
	КонецЕсли;
	Если Не (СокрЛП(ПолеВвода14.Текст) = "") Тогда
		Парам1Имя = СокрЛП(ПолеВвода14.Текст);
		Парам1Обязательный = СокрЛП(ПолеВыбора7.Текст);
		Парам1Тип = СокрЛП(ПолеВыбора6.Текст);
		Парам1Описание = СокрЛП(ПолеВвода13.Текст);
		М_Параметров.Добавить(Парам1Имя + ";;;" + Парам1Обязательный + ";;;" + Парам1Тип + ";;;" + Парам1Описание);
	КонецЕсли;
	Если Не (СокрЛП(ПолеВвода16.Текст) = "") Тогда
		Парам1Имя = СокрЛП(ПолеВвода16.Текст);
		Парам1Обязательный = СокрЛП(ПолеВыбора9.Текст);
		Парам1Тип = СокрЛП(ПолеВыбора8.Текст);
		Парам1Описание = СокрЛП(ПолеВвода15.Текст);
		М_Параметров.Добавить(Парам1Имя + ";;;" + Парам1Обязательный + ";;;" + Парам1Тип + ";;;" + Парам1Описание);
	КонецЕсли;
	Если Не (СокрЛП(ПолеВвода18.Текст) = "") Тогда
		Парам1Имя = СокрЛП(ПолеВвода18.Текст);
		Парам1Обязательный = СокрЛП(ПолеВыбора11.Текст);
		Парам1Тип = СокрЛП(ПолеВыбора10.Текст);
		Парам1Описание = СокрЛП(ПолеВвода17.Текст);
		М_Параметров.Добавить(Парам1Имя + ";;;" + Парам1Обязательный + ";;;" + Парам1Тип + ";;;" + Парам1Описание);
	КонецЕсли;
	Если Не (СокрЛП(ПолеВвода20.Текст) = "") Тогда
		Парам1Имя = СокрЛП(ПолеВвода20.Текст);
		Парам1Обязательный = СокрЛП(ПолеВыбора13.Текст);
		Парам1Тип = СокрЛП(ПолеВыбора12.Текст);
		Парам1Описание = СокрЛП(ПолеВвода19.Текст);
		М_Параметров.Добавить(Парам1Имя + ";;;" + Парам1Обязательный + ";;;" + Парам1Тип + ";;;" + Парам1Описание);
	КонецЕсли;
	Если Не (СокрЛП(ПолеВвода22.Текст) = "") Тогда
		Парам1Имя = СокрЛП(ПолеВвода22.Текст);
		Парам1Обязательный = СокрЛП(ПолеВыбора15.Текст);
		Парам1Тип = СокрЛП(ПолеВыбора14.Текст);
		Парам1Описание = СокрЛП(ПолеВвода21.Текст);
		М_Параметров.Добавить(Парам1Имя + ";;;" + Парам1Обязательный + ";;;" + Парам1Тип + ";;;" + Парам1Описание);
	КонецЕсли;
	Если Не (СокрЛП(ПолеВвода24.Текст) = "") Тогда
		Парам1Имя = СокрЛП(ПолеВвода24.Текст);
		Парам1Обязательный = СокрЛП(ПолеВыбора17.Текст);
		Парам1Тип = СокрЛП(ПолеВыбора16.Текст);
		Парам1Описание = СокрЛП(ПолеВвода23.Текст);
		М_Параметров.Добавить(Парам1Имя + ";;;" + Парам1Обязательный + ";;;" + Парам1Тип + ";;;" + Парам1Описание);
	КонецЕсли;
	Если Не (СокрЛП(ПолеВвода26.Текст) = "") Тогда
		Парам1Имя = СокрЛП(ПолеВвода26.Текст);
		Парам1Обязательный = СокрЛП(ПолеВыбора19.Текст);
		Парам1Тип = СокрЛП(ПолеВыбора18.Текст);
		Парам1Описание = СокрЛП(ПолеВвода25.Текст);
		М_Параметров.Добавить(Парам1Имя + ";;;" + Парам1Обязательный + ";;;" + Парам1Тип + ";;;" + Парам1Описание);
	КонецЕсли;
	Если Не (СокрЛП(ПолеВвода28.Текст) = "") Тогда
		Парам1Имя = СокрЛП(ПолеВвода28.Текст);
		Парам1Обязательный = СокрЛП(ПолеВыбора21.Текст);
		Парам1Тип = СокрЛП(ПолеВыбора20.Текст);
		Парам1Описание = СокрЛП(ПолеВвода27.Текст);
		М_Параметров.Добавить(Парам1Имя + ";;;" + Парам1Обязательный + ";;;" + Парам1Тип + ";;;" + Парам1Описание);
	КонецЕсли;
	
	Если Флажок1.Помечен Тогда
		Для А = 0 По ПолеВыбора25.Элементы.Количество - 1 Цикл
			Эл = ПолеВыбора25.Элементы(А);
			Сообщить("Эл.Текст = " + Эл.Текст);
			ПолеВыбора25.Текст = Эл.Текст;
			Приостановить(500);
			// Ф.Предупреждение("Завершено " + ПолеВыбора25.Текст, 1, "Завершено");
			СоздатьМетод();
		КонецЦикла;
		Ф.ОкноСообщений().Показать("Завершено", "Завершено");
	Иначе
		СоздатьМетод();
	КонецЕсли;
КонецПроцедуры//Кн1_Нажатие

Процедура СоздатьМетод()
	Стр = "<!DOCTYPE html>
	|<html lang=""ru"">
	|<head>
	|    <title>CCLLAASS.MMEETTOODD Method</title>
	|    <meta charset=""UTF-8"">
	|    <link rel=""stylesheet"" type=""text/css"" href=""mainstyle.css"">
	|    <script defer src=""mobilstyle.js""></script>
	|</head>
	|<body id=bodyID class=dtBODY onclick=""divrightClick(event)"">
	|    <div id=nsbanner>
	|        <div id=bannerrow1>
	|            <table class=bannerparthead cellSpacing=0>
	|                <tbody>
	|                    <tr id=hdr>
	|                        <td class=runninghead></td>
	|                        <td class=product></td>
	|                    </tr>
	|                </tbody>
	|            </table>
	|        </div>
	|        <div id=TitleRow>
	|            <h1 class=dtH1>ККЛЛААСС.ММЕЕТТООДД (CCLLAASS.MMEETTOODD)&nbsp;Метод</h1>
	|        </div>
	|    </div>
	|    <div id=nstext>
	|        <h4 class=dtH4>Синтаксис</h4>
	|        <p>" + МетодИмяРус + "(";
	Для А = 0 По М_Параметров.ВГраница() Цикл
		Для А = 0 По М_Параметров.ВГраница() Цикл
			М = РазобратьСтроку(М_Параметров.Получить(А), ";;;");
			Стр = Стр + "&lt;" + М[0] + "&gt;";
			Если Не (А = М_Параметров.ВГраница()) Тогда
				Стр = Стр + ", ";
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	Стр = Стр + ")</p>";

	Если М_Параметров.Количество() > 0 Тогда
		Стр = Стр + "
		|        <h4 class=dtH4>Параметры</h4>
		|        <dl>";
		Для А = 0 По М_Параметров.ВГраница() Цикл
			М = РазобратьСтроку(М_Параметров.Получить(А), ";;;");
			Стр = Стр + "
			|            <dt><i>" + М[0] + "</i> (" + М[1] + ")</dt>
			|            <dd>" + М[2] + "</dd>
			|            <dd>
			|                " + М[3] + "
			|            </dd>";
		КонецЦикла;
		Стр = Стр + "
		|        </dl>";
	КонецЕсли;
	Стр = Стр + "
	|        <h4 class=dtH4>Возвращаемое значение</h4>
	|        <p>" + ВозвращаемоеЗначениеТип + "</p>
	|        <p>" + ВозвращаемоеЗначениеОписание + "</p>
	|        <h4 class=dtH4>Описание</h4>
	|        <p>МетодОписание_йййййййййй</p>
	|        <h4 class=dtH4>Примечание</h4>
	|        <p></p>";
	СлучайноеИмя = СтрЗаменить(Прав(ПолучитьИмяВременногоФайла(), 9), ".tmp", "");
	БлокПримеров = "
	|        <h4 class=dtH4>Пример</h4>
	|            <pre class=code>
	|
	|</pre>
	|            <details>
	|                <summary>Полный пример кода</summary>
	|                <pre class=code id=""sample-code-reflection"">
	|<button type=""button"" class=""copy-btn"" data-target-id=""" + СлучайноеИмя + """ style=""font-size:100%;"">Копировать</button>
	|<hr style=""border-color: lightgray;""><div id=""" + СлучайноеИмя + """>
	|
	|</div>
	|</pre>
	|            </details>
	|        <p></p>";
	
	ЭтоБазовыйКласс = Ложь;
	ИмяФайлаКласса = ПутьКСтранице + КлассИмяEn + ".html";
	ТекстДокКласс = Новый ТекстовыйДокумент;
	ТекстДокКласс.Прочитать(ИмяФайлаКласса);
	СтрКласс = ТекстДокКласс.ПолучитьТекст();
	М6 = СтрНайтиМежду(СтрКласс, "<h4 class=dtH4>Описание</h4>", "<h4 class=dtH4>Иерархия</h4>", , );
	Если М6.Количество() > 0 Тогда
		// Сообщить("Описание = " + М6[0]);
		Описание = М6[0];
		М7 = СтрНайтиМежду(Описание, "<p>", "</p>", , );
		Если М7.Количество() > 0 Тогда
			// Сообщить("Лев(М7[0], 13) = " + Лев(М7[0], 13));
			Если Лев(М7[0], 13) = "Базовый класс" Тогда
				ЭтоБазовыйКласс = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если ЭтоБазовыйКласс Тогда
	Иначе
		Стр = Стр + БлокПримеров;
	КонецЕсли;
	Стр = Стр + "
	|        <h4 class=dtH4>Смотрите также</h4>
	|        <A href=""OSIntegrator." + КлассИмяEn + ".html"">" + КлассИмяРус + "&nbsp;(" + КлассИмяEn + ")&nbsp;Класс</A> | <A href=""OSIntegrator.html"">Библиотека&nbsp;OneScriptIntegrator</A>
	|    </div>
	|</body>
	|</html>
	|";
	ПодстрокаПоиска = "ККЛЛААСС";
	ПодстрокаЗамены = КлассИмяРус;
	Стр = СтрЗаменить(Стр, ПодстрокаПоиска, ПодстрокаЗамены);

	ПодстрокаПоиска = "CCLLAASS";
	ПодстрокаЗамены = КлассИмяEn;
	Стр = СтрЗаменить(Стр, ПодстрокаПоиска, ПодстрокаЗамены);

	ПодстрокаПоиска = "ММЕЕТТООДД";
	ПодстрокаЗамены = МетодИмяРус;
	Стр = СтрЗаменить(Стр, ПодстрокаПоиска, ПодстрокаЗамены);

	ПодстрокаПоиска = "MMEETTOODD";
	ПодстрокаЗамены = МетодИмяEn;
	Стр = СтрЗаменить(Стр, ПодстрокаПоиска, ПодстрокаЗамены);

	ПодстрокаПоиска = "МетодОписание_йййййййййй";
	ПодстрокаЗамены = МетодОписание;
	Стр = СтрЗаменить(Стр, ПодстрокаПоиска, ПодстрокаЗамены);

	ТекстДок = Новый ТекстовыйДокумент;
	ИмяФайла = ВыходнойКаталог + "\OSIntegrator." + КлассИмяEn + "." + МетодИмяEn + ".html";
	ТекстДок.УстановитьТекст(Стр);
	ТекстДок.Записать(ИмяФайла);

	// !!! ====================================================================================
	// Изменим C:\444\OneScriptIntegrator\docs\doc.html
	Список = Новый СписокЗначений();
	ТекстДок = Новый ТекстовыйДокумент;
	ТекстДок.Прочитать(ПутьКОглавлению);
	Стр = ТекстДок.ПолучитьТекст();
	М = СтрНайтиМежду(Стр, 
		"<summary class=""menu3""><a href=""OSIntegrator/OSIntegrator." + КлассИмяEn + "Methods.html"" target=""right"">Методы</a></summary>", 
		"</details>", 
		Ложь, );
	Если М.Количество() > 0 Тогда
		// Сообщить("" + М[0]);
		ПодстрокаПоиска = М[0];
		М2 = СтрНайтиМежду(М[0], "                        <p", "</p>", Ложь, );
		Для А2 = 0 По М2.ВГраница() Цикл
			// Сообщить("" + М2[А2]);
			М3 = СтрНайтиМежду(М2[А2], "right"">", "</a>", , );
			Если М3.Количество() > 0 Тогда
				// Сообщить("М3[0] = " + М3[0]);
				Список.Добавить(М2[А2], М3[0]);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Фрагмент1 = "                        <p class=""method""><a href=""OSIntegrator/OSIntegrator." + КлассИмяEn + "." + МетодИмяEn + ".html"" target=""right"">" + МетодИмяРус + " (" + МетодИмяEn + ")</a></p>";
	Список.Добавить(Фрагмент1, "" + МетодИмяРус + " (" + МетодИмяEn + ") Метод");
	Список.СортироватьПоПредставлению();
	ПодстрокаЗамены = "";
	Для А = 0 По Список.Количество() - 1 Цикл
		// Сообщить("==" + Список.Получить(А).Значение);
		ПодстрокаЗамены = ПодстрокаЗамены + Список.Получить(А).Значение + "
		|";
	КонецЦикла;
	ПодстрокаЗамены = "<summary class=""menu3""><a href=""OSIntegrator/OSIntegrator." + КлассИмяEn + "Methods.html"" target=""right"">Методы</a></summary>
	|" + ПодстрокаЗамены + "                    </details>";
	// Сообщить("=======================================");
	// Сообщить("" + ПодстрокаПоиска);
	// Сообщить("=======================================");
	// Сообщить("" + ПодстрокаЗамены);
	
	Стр = СтрЗаменить(Стр, ПодстрокаПоиска, ПодстрокаЗамены);
	ИмяФайла = ВыходнойКаталог + "\doc.html";
	ТекстДок.УстановитьТекст(Стр);
	ТекстДок.Записать(ИмяФайла);
	
	// !!! ====================================================================================
	// Изменим C:\444\OneScriptIntegrator\docs\OSIntegrator\OSIntegrator.КЛАССMethods.html
	ТекстДок = Новый ТекстовыйДокумент;
	ТекстДок.Прочитать(ПутьКСтранице + КлассИмяEn + "Methods.html");
	Стр = ТекстДок.ПолучитьТекст();
	М = СтрНайтиМежду(Стр, 
		"<h4 class=dtH4>Методы</h4>
		|        <div class=tablediv>
		|            <table class=dtTABLE cellSpacing=0>
		|                <tbody>", 
		"<tr vAlign=top>", 
		Ложь, );
	// Сообщить("М[0] = " + М[0]);
	ПодстрокаПоиска = М[0];
	ПодстрокаЗамены = М[0] + "
	|                        <td width=""50%""><img src=""pubmethod.gif""></img><a href=""OSIntegrator." + КлассИмяEn + "." + МетодИмяEn + ".html"">" + МетодИмяРус + "&nbsp;(" + МетодИмяEn + ")</a>" + ТекстНаследования + "</td>
	|                        <td width=""50%"">" + МетодОписание + "</td>
	|                    </tr>
	|                    <tr vAlign=top>";
	Стр = СтрЗаменить(Стр, ПодстрокаПоиска, ПодстрокаЗамены);

	ИмяФайла = ВыходнойКаталог + "\OSIntegrator." + КлассИмяEn + "Methods.html";
	ТекстДок.УстановитьТекст(Стр);
	ТекстДок.Записать(ИмяФайла);
	
	Приостановить(2000);
	Сортировать_Methods();

	ОткудаПереносим1 = ИмяФайла;
	КудаПереносим1 = ПутьКСтранице + КлассИмяEn + МетодИмяEn + "Method.html";
	ОткудаПереносим2 = ИмяФайла;
	КудаПереносим2 = ПутьКСтранице + КлассИмяEn + "Methods.html";
	ОкноСообщений1 = Ф.ОкноСообщений();
	Если Флажок1.Помечен Тогда
		КопироватьФайл(ОткудаПереносим1, КудаПереносим1);
		Приостановить(500);
		КопироватьФайл(ОткудаПереносим2, КудаПереносим2);
		Приостановить(500);
		УдалитьФайлы(ВыходнойКаталог, "*.html");  
		// Ф.Предупреждение("Завершено " + КлассИмяРус + "." + МетодИмяРус, 1, "Завершено");
	Иначе
		// Ф.ОкноСообщений().Показать("Завершено", "Завершено");
	КонецЕсли;
	
	// !!! ====================================================================================
	// Изменим C:\444\OneScriptIntegrator\docs\OSIntegrator\OSIntegrator.КЛАССMembers.html
	ТекстДок = Новый ТекстовыйДокумент;
	ТекстДок.Прочитать(ПутьКСтранице + КлассИмяEn + "Members.html");
	Стр = ТекстДок.ПолучитьТекст();
	М = СтрНайтиМежду(Стр, 
		"<h4 class=dtH4>Методы</h4>
		|        <div class=tablediv>
		|            <table class=dtTABLE cellSpacing=0>
		|                <tbody>", 
		"<tr vAlign=top>", 
		Ложь, );
	// Сообщить("М[0] = " + М[0]);
	ПодстрокаПоиска = М[0];
	ПодстрокаЗамены = М[0] + "
	|                        <td width=""50%""><img src=""pubmethod.gif""></img><a href=""OSIntegrator." + КлассИмяEn + "." + МетодИмяEn + ".html"">" + МетодИмяРус + "&nbsp;(" + МетодИмяEn + ")</a>" + ТекстНаследования + "</td>
	|                        <td width=""50%"">" + МетодОписание + "</td>
	|                    </tr>
	|                    <tr vAlign=top>";
	Стр = СтрЗаменить(Стр, ПодстрокаПоиска, ПодстрокаЗамены);

	ИмяФайла = ВыходнойКаталог + "\OSIntegrator." + КлассИмяEn + "Members.html";
	ТекстДок.УстановитьТекст(Стр);
	ТекстДок.Записать(ИмяФайла);
	ОткудаПереносим2 = ИмяФайла;
	КудаПереносим2 = ПутьКСтранице + КлассИмяEn + "Members.html";
	
	Приостановить(2000);
	Сортировать_Members();

	ОкноСообщений1 = Ф.ОкноСообщений();
	Если Флажок1.Помечен Тогда
		КопироватьФайл(ОткудаПереносим1, КудаПереносим1);
		Приостановить(500);
		КопироватьФайл(ОткудаПереносим2, КудаПереносим2);
		Приостановить(500);
		УдалитьФайлы(ВыходнойКаталог, "*.html");  
		Ф.Предупреждение("Завершено " + КлассИмяРус + "." + МетодИмяРус, 1, "Завершено");
	Иначе
		Ф.ОкноСообщений().Показать("Завершено", "Завершено");
	КонецЕсли;
КонецПроцедуры//СоздатьМетод

Процедура Сортировать_Methods()
	// Сортируем C:\444\OneScriptIntegrator\docs\OSIntegrator\OSIntegrator.КЛАССMethods.html
	Список = Новый СписокЗначений();
	ТекстДок = Новый ТекстовыйДокумент;
	ТекстДок.Прочитать(ВыходнойКаталог + "\OSIntegrator." + КлассИмяEn + "Methods.html");
	Стр = ТекстДок.ПолучитьТекст();
	М = СтрНайтиМежду(Стр, 
		"<tbody>", 
		"</tbody>", Ложь, );
	Если М.Количество() > 0 Тогда
		// Сообщить("" + М[1]);
		ПодстрокаПоиска = М[1];
		М2 = СтрНайтиМежду(М[1], "                    <tr vAlign=top>", "</tr>", Ложь, );
		Для А2 = 0 По М2.ВГраница() Цикл
			// Сообщить("" + М2[А2]);
			М3 = СтрНайтиМежду(М2[А2], "html"">", "</a>", , );
			Если М3.Количество() > 0 Тогда
				// Сообщить("М3[0] = " + М3[0]);
				Список.Добавить(М2[А2], СтрЗаменить(М3[0], "&nbsp;", " "));
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Список.СортироватьПоПредставлению();
	ПодстрокаЗамены = "";
	Для А = 0 По Список.Количество() - 1 Цикл
		// Сообщить("==" + Список.Получить(А).Значение);
		ПодстрокаЗамены = ПодстрокаЗамены + Список.Получить(А).Значение + "
		|";
	КонецЦикла;
	ПодстрокаЗамены = "<tbody>					
	|" + ПодстрокаЗамены + "                </tbody>";
	// Сообщить("=======================================");
	// Сообщить("" + ПодстрокаПоиска);
	// Сообщить("=======================================");
	// Сообщить("" + ПодстрокаЗамены);
	
	Стр = СтрЗаменить(Стр, ПодстрокаПоиска, ПодстрокаЗамены);
	ИмяФайла = ВыходнойКаталог + "\OSIntegrator." + КлассИмяEn + "Methods.html";
	ТекстДок.УстановитьТекст(Стр);
	ТекстДок.Записать(ИмяФайла);
КонецПроцедуры//Сортировать_Methods

Процедура Сортировать_Members()
	// Сортируем C:\444\OneScriptIntegrator\docs\OSIntegrator\OSIntegrator.КЛАССMembers.html
	Список = Новый СписокЗначений();
	ТекстДок = Новый ТекстовыйДокумент;
	// Сообщить("путь = " + ВыходнойКаталог + "\OSIntegrator." + КлассИмяEn + "Members.html");
	ТекстДок.Прочитать(ВыходнойКаталог + "\OSIntegrator." + КлассИмяEn + "Members.html");
	Стр = ТекстДок.ПолучитьТекст();
	М = СтрНайтиМежду(Стр, 
		"<h4 class=dtH4>Методы</h4>
		|        <div class=tablediv>
		|            <table class=dtTABLE cellSpacing=0>
		|                <tbody>", 
		"</tbody>", Ложь, );
	// Сообщить("М.Количество() = " + М.Количество());
	Если М.Количество() > 0 Тогда
		// Сообщить("" + М[0]);
		ПодстрокаПоиска = М[0];
		М2 = СтрНайтиМежду(М[0], "                    <tr vAlign=top>", "</tr>", Ложь, );
		Для А2 = 0 По М2.ВГраница() Цикл
			// Сообщить("" + М2[А2]);
			М3 = СтрНайтиМежду(М2[А2], "html"">", "</a>", , );
			Если М3.Количество() > 0 Тогда
				// Сообщить("М3[0] = " + М3[0]);
				Список.Добавить(М2[А2], СтрЗаменить(М3[0], "&nbsp;", " "));
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Список.СортироватьПоПредставлению();
	ПодстрокаЗамены = "";
	Для А = 0 По Список.Количество() - 1 Цикл
		// Сообщить("==" + Список.Получить(А).Значение);
		ПодстрокаЗамены = ПодстрокаЗамены + Список.Получить(А).Значение + "
		|";
	КонецЦикла;
	ПодстрокаЗамены = 
	"<h4 class=dtH4>Методы</h4>
	|        <div class=tablediv>
	|            <table class=dtTABLE cellSpacing=0>
	|                <tbody>					
	|" + ПодстрокаЗамены + "                </tbody>";
	// Сообщить("=======================================");
	// Сообщить("" + ПодстрокаПоиска);
	// Сообщить("=======================================");
	// Сообщить("" + ПодстрокаЗамены);
	
	Стр = СтрЗаменить(Стр, ПодстрокаПоиска, ПодстрокаЗамены);
	ИмяФайла = ВыходнойКаталог + "\OSIntegrator." + КлассИмяEn + "Members.html";
	ТекстДок.УстановитьТекст(Стр);
	ТекстДок.Записать(ИмяФайла);
КонецПроцедуры//Сортировать_Members

Процедура КопироватьМетод() Экспорт
	БезСообщения = Истина;
	ОчиститьПараметры();
	
	МетодРус = СтрРазделить(ПолеВыбора24.Текст, " ")[0];
	МетодАнгл = СтрРазделить(ПолеВыбора24.Текст, " ")[1];
	КлассМетодаРус = СтрРазделить(ПолеВыбора24.Текст, " ")[2];
	КлассМетодаАнгл = СтрРазделить(ПолеВыбора24.Текст, " ")[3];
    // Сообщить("МетодРус = " + МетодРус);
    // Сообщить("МетодАнгл = " + МетодАнгл);
    // Сообщить("КлассМетодаРус = " + КлассМетодаРус);
    // Сообщить("КлассМетодаАнгл = " + КлассМетодаАнгл);
	
	ТекстДок = Новый ТекстовыйДокумент;
	// C:\444\OneScriptIntegrator\docs\OSIntegrator\OSIntegrator.OneScriptIntegrator.Action.html
	ФайлМетода = ПутьКСтранице + КлассМетодаАнгл + "." + МетодАнгл + ".html";
	КаталогНаДиске = Новый Файл(ФайлМетода);
    Если Не (КаталогНаДиске.Существует()) Тогда
		Возврат;
	КонецЕсли;
	ТекстДок.Прочитать(ФайлМетода);
	СтрТекстДок = ТекстДок.ПолучитьТекст();
	// Сообщить("СтрТекстДок = " + СтрТекстДок);
	// МетодОписание
	М = СтрНайтиМежду(СтрТекстДок, "<h4 class=dtH4>Описание</h4>", "<h4 class=dtH4>Примечание</h4>", , );
	МетодОписание = СтрНайтиМежду(М[0], "<p>", "</p>", , )[0];
	ПолеВвода3.Текст = СокрЛП(МетодОписание);
	// Сообщить("МетодОписание = " + МетодОписание);
	
	МетодИмяРус = СокрЛП(МетодРус);
	ПолеВвода4.Текст = СокрЛП(МетодИмяРус);
	// Сообщить("МетодИмяРус = " + МетодИмяРус);
	
	МетодИмяEn = МетодАнгл;
	ПолеВвода5.Текст = МетодИмяEn;
	// Сообщить("МетодИмяEn = " + МетодИмяEn);
	
	М1 = СтрНайтиМежду(СтрТекстДок, "<h4 class=dtH4>Возвращаемое значение</h4>", "<h4 class=dtH4>Описание</h4>", Ложь, );
	Если М1.Количество() > 0 Тогда
		// Сообщить("М1[0] = " + М1[0]);
		М2 = СтрНайтиМежду(М1[0], "<p>", "</p>", , );
		// ВозвращаемоеЗначениеТип
		Если М2.Количество() > 0 Тогда
			// Сообщить("М2[0] = " + М2[0]);
			ВозвращаемоеЗначениеТип = М2[0];
			ПолеВыбора2.Текст = СокрЛП(ВозвращаемоеЗначениеТип);
		КонецЕсли;
		// Сообщить("М3[0] = " + М3[0]);
		// ВозвращаемоеЗначениеОписание = СокрЛП(ПолеВвода8.Текст);
		ВозвращаемоеЗначениеОписание = "";
		Для А2 = 1 По М2.ВГраница() Цикл
			// Сообщить("М2[А2] = " + М2[А2]);
			ВозвращаемоеЗначениеОписание = ВозвращаемоеЗначениеОписание + М2[А2] + Ф.Окружение().НоваяСтрока;
		КонецЦикла;
		ПолеВвода8.Текст = СокрЛП(ВозвращаемоеЗначениеОписание);
	КонецЕсли;
	
	// <h4 class=dtH4>Параметры</h4>
	// <h4 class=dtH4>Возвращаемое значение</h4>
	М_Параметров.Очистить();
	М4 = СтрНайтиМежду(СтрТекстДок, "<h4 class=dtH4>Параметры</h4>", "<h4 class=dtH4>Возвращаемое значение</h4>", , );
	Если М4.Количество() > 0 Тогда
		// Сообщить("М4[0] = " + М4[0]);
		Стр5 = М4[0];
		Стр5 = СтрЗаменить(Стр5, "<dl>", "");
		Стр5 = СтрЗаменить(Стр5, "</dl>", "");
		Стр5 = СокрЛП(Стр5);
		Стр5 = СтрЗаменить(Стр5, "<dt>", "ййййй") + "ййййй";
		// Сообщить("Стр5 = " + Стр5);
		М5 = СтрНайтиМежду(Стр5, "ййййй", "ййййй", , );
		Если М5.Количество() > 0 Тогда
			// <i>Игрек</i> (обязательный)</dt>
            // <dd>Тип: Число.</dd>
            // <dd>Координата по оси игрек.</dd>
			Для А5 = 0 По М5.ВГраница() Цикл
				Стр6 = СокрЛП(М5[А5]);
				// Сообщить("Стр6 = " + Стр6);
				// Сообщить("================");
				Парам1Имя = СтрНайтиМежду(Стр6, "<i>", "</i>", , )[0];
				Парам1Обязательный = СтрНайтиМежду(Стр6, "</i> (", ")</dt>", , )[0];
				Парам1Тип = СтрНайтиМежду(Стр6, "<dd>", "</dd>", , )[0];
				Парам1Описание = СтрНайтиМежду(Стр6, "<dd>", "</dd>", , )[1];
				М_Параметров.Добавить(Парам1Имя + ";;;" + Парам1Обязательный + ";;;" + Парам1Тип + ";;;" + Парам1Описание);
				// Сообщить("Парам1Имя = " + Парам1Имя);
				// Сообщить("Парам1Обязательный = " + Парам1Обязательный);
				// Сообщить("Парам1Тип = " + Парам1Тип);
				// Сообщить("Парам1Описание = " + Парам1Описание);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Для А8 = 0 По М_Параметров.ВГраница() Цикл
		// Сообщить("Парам = " + М_Параметров[А8]);
		М9 = РазобратьСтроку(М_Параметров[А8], ";;;");
		// Парам = Игрек;;;обязательный;;;Тип: Число.;;;Координата по оси игрек.
		Парам1Имя = СокрЛП(М9[0]);
		Парам1Обязательный = СокрЛП(М9[1]);
		Парам1Тип = СокрЛП(М9[2]);
		Парам1Описание = СокрЛП(М9[3]);
		// Сообщить("=====================");
		// Сообщить("Парам1Имя = " + Парам1Имя);
		// Сообщить("Парам1Обязательный = " + Парам1Обязательный);
		// Сообщить("Парам1Тип = " + Парам1Тип);
		// Сообщить("Парам1Описание = " + Парам1Описание);
		
		Если А8 = 0 Тогда
			ПолеВвода9.Текст = Парам1Имя;
			ПолеВыбора1.Текст = Парам1Обязательный;
			ПолеВыбора3.Текст = Парам1Тип;
			ПолеВвода10.Текст = Парам1Описание;
		КонецЕсли;
		Если А8 = 1 Тогда
			ПолеВвода12.Текст = Парам1Имя;
			ПолеВыбора5.Текст = Парам1Обязательный;
			ПолеВыбора4.Текст = Парам1Тип;
			ПолеВвода11.Текст = Парам1Описание;
		КонецЕсли;
		Если А8 = 2 Тогда
			ПолеВвода14.Текст = Парам1Имя;
			ПолеВыбора7.Текст = Парам1Обязательный;
			ПолеВыбора6.Текст = Парам1Тип;
			ПолеВвода13.Текст = Парам1Описание;
		КонецЕсли;
		Если А8 = 3 Тогда
			ПолеВвода16.Текст = Парам1Имя;
			ПолеВыбора9.Текст = Парам1Обязательный;
			ПолеВыбора8.Текст = Парам1Тип;
			ПолеВвода15.Текст = Парам1Описание;
		КонецЕсли;
		Если А8 = 4 Тогда
			ПолеВвода18.Текст = Парам1Имя;
			ПолеВыбора11.Текст = Парам1Обязательный;
			ПолеВыбора10.Текст = Парам1Тип;
			ПолеВвода17.Текст = Парам1Описание;
		КонецЕсли;
		Если А8 = 5 Тогда
			ПолеВвода20.Текст = Парам1Имя;
			ПолеВыбора13.Текст = Парам1Обязательный;
			ПолеВыбора12.Текст = Парам1Тип;
			ПолеВвода19.Текст = Парам1Описание;
		КонецЕсли;
		Если А8 = 6 Тогда
			ПолеВвода22.Текст = Парам1Имя;
			ПолеВыбора15.Текст = Парам1Обязательный;
			ПолеВыбора14.Текст = Парам1Тип;
			ПолеВвода21.Текст = Парам1Описание;
		КонецЕсли;
		Если А8 = 7 Тогда
			ПолеВвода24.Текст = Парам1Имя;
			ПолеВыбора17.Текст = Парам1Обязательный;
			ПолеВыбора16.Текст = Парам1Тип;
			ПолеВвода23.Текст = Парам1Описание;
		КонецЕсли;
		Если А8 = 8 Тогда
			ПолеВвода26.Текст = Парам1Имя;
			ПолеВыбора19.Текст = Парам1Обязательный;
			ПолеВыбора18.Текст = Парам1Тип;
			ПолеВвода25.Текст = Парам1Описание;
		КонецЕсли;
		Если А8 = 9 Тогда
			ПолеВвода28.Текст = Парам1Имя;
			ПолеВыбора21.Текст = Парам1Обязательный;
			ПолеВыбора20.Текст = Парам1Тип;
			ПолеВвода27.Текст = Парам1Описание;
		КонецЕсли;

	КонецЦикла;
КонецПроцедуры

Процедура ОчиститьПараметры() Экспорт
	ОкноСообщений1 = Ф.ОкноСообщений();
	Если Не БезСообщения Тогда
		Рез = ОкноСообщений1.Показать("Точно очистить???", "Заголовок");
		Если Не Рез = Ф.РезультатДиалога.ОК Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Для А = 0 По ПанельВкладок1.Вкладки.Количество - 1 Цикл
		Вкладка = ПанельВкладок1.Вкладки(А);
		Для А1 = 0 По Вкладка.ЭлементыУправления.Количество - 1 Цикл
			Элемент = Вкладка.ЭлементУправления(А1);
			Если ТипЗнч(Элемент) = Тип("КлПолеВвода") или ТипЗнч(Элемент) = Тип("КлПолеВыбора") Тогда
				Элемент.Текст = "";
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	БезСообщения = Ложь;
КонецПроцедуры

Процедура НаследоватьМетод() Экспорт
	БезСообщения = Истина;
	ОчиститьПараметры();
	
	МетодРус = СтрРазделить(ПолеВыбора25.Текст, " ")[0];
	МетодАнгл = СтрРазделить(ПолеВыбора25.Текст, " ")[1];
	КлассМетодаРус = СтрРазделить(ПолеВыбора25.Текст, " ")[2];
	КлассМетодаАнгл = СтрРазделить(ПолеВыбора25.Текст, " ")[3];
    // Сообщить("МетодРус = " + МетодРус);
    // Сообщить("МетодАнгл = " + МетодАнгл);
    // Сообщить("КлассМетодаРус = " + КлассМетодаРус);
    // Сообщить("КлассМетодаАнгл = " + КлассМетодаАнгл);
	
	ТекстДок = Новый ТекстовыйДокумент;
	// C:\444\OneScriptIntegrator\docs\OSIntegrator\OSIntegrator.OneScriptIntegrator.Action.html
	ФайлМетода = ПутьКСтранице + КлассМетодаАнгл + "." + МетодАнгл + ".html";
	КаталогНаДиске = Новый Файл(ФайлМетода);
    Если Не (КаталогНаДиске.Существует()) Тогда
		Возврат;
	КонецЕсли;
	ТекстДок.Прочитать(ФайлМетода);
	СтрТекстДок = ТекстДок.ПолучитьТекст();
	// Сообщить("СтрТекстДок = " + СтрТекстДок);
	// МетодОписание
	М = СтрНайтиМежду(СтрТекстДок, "<h4 class=dtH4>Описание</h4>", "<h4 class=dtH4>Примечание</h4>", , );
	МетодОписание = СтрНайтиМежду(М[0], "<p>", "</p>", , )[0];
	ПолеВвода3.Текст = СокрЛП(МетодОписание);
	// Сообщить("МетодОписание = " + МетодОписание);
	
	МетодИмяРус = СокрЛП(МетодРус);
	ПолеВвода4.Текст = СокрЛП(МетодИмяРус);
	// Сообщить("МетодИмяРус = " + МетодИмяРус);
	
	МетодИмяEn = МетодАнгл;
	ПолеВвода5.Текст = МетодИмяEn;
	// Сообщить("МетодИмяEn = " + МетодИмяEn);
	
	М1 = СтрНайтиМежду(СтрТекстДок, "<h4 class=dtH4>Возвращаемое значение</h4>", "<h4 class=dtH4>Описание</h4>", Ложь, );
	Если М1.Количество() > 0 Тогда
		// Сообщить("М1[0] = " + М1[0]);
		М2 = СтрНайтиМежду(М1[0], "<p>", "</p>", , );
		// ВозвращаемоеЗначениеТип
		Если М2.Количество() > 0 Тогда
			// Сообщить("М2[0] = " + М2[0]);
			ВозвращаемоеЗначениеТип = М2[0];
			ПолеВыбора2.Текст = СокрЛП(ВозвращаемоеЗначениеТип);
		КонецЕсли;
		// Сообщить("М3[0] = " + М3[0]);
		// ВозвращаемоеЗначениеОписание = СокрЛП(ПолеВвода8.Текст);
		ВозвращаемоеЗначениеОписание = "";
		Для А2 = 1 По М2.ВГраница() Цикл
			// Сообщить("М2[А2] = " + М2[А2]);
			ВозвращаемоеЗначениеОписание = ВозвращаемоеЗначениеОписание + М2[А2] + Ф.Окружение().НоваяСтрока;
		КонецЦикла;
		ПолеВвода8.Текст = СокрЛП(ВозвращаемоеЗначениеОписание);
	КонецЕсли;
	
	// <h4 class=dtH4>Параметры</h4>
	// <h4 class=dtH4>Возвращаемое значение</h4>
	М_Параметров.Очистить();
	М4 = СтрНайтиМежду(СтрТекстДок, "<h4 class=dtH4>Параметры</h4>", "<h4 class=dtH4>Возвращаемое значение</h4>", , );
	Если М4.Количество() > 0 Тогда
		// Сообщить("М4[0] = " + М4[0]);
		Стр5 = М4[0];
		Стр5 = СтрЗаменить(Стр5, "<dl>", "");
		Стр5 = СтрЗаменить(Стр5, "</dl>", "");
		Стр5 = СокрЛП(Стр5);
		Стр5 = СтрЗаменить(Стр5, "<dt>", "ййййй") + "ййййй";
		// Сообщить("Стр5 = " + Стр5);
		М5 = СтрНайтиМежду(Стр5, "ййййй", "ййййй", , );
		Если М5.Количество() > 0 Тогда
			// <i>Игрек</i> (обязательный)</dt>
            // <dd>Тип: Число.</dd>
            // <dd>Координата по оси игрек.</dd>
			Для А5 = 0 По М5.ВГраница() Цикл
				Стр6 = СокрЛП(М5[А5]);
				// Сообщить("Стр6 = " + Стр6);
				// Сообщить("================");
				Парам1Имя = СтрНайтиМежду(Стр6, "<i>", "</i>", , )[0];
				Парам1Обязательный = СтрНайтиМежду(Стр6, "</i> (", ")</dt>", , )[0];
				Парам1Тип = СтрНайтиМежду(Стр6, "<dd>", "</dd>", , )[0];
				Парам1Описание = СокрЛП(СтрНайтиМежду(Стр6, "<dd>", "</dd>", , )[1]);
				М_Параметров.Добавить(Парам1Имя + ";;;" + Парам1Обязательный + ";;;" + Парам1Тип + ";;;" + Парам1Описание);
				// Сообщить("Парам1Имя = " + Парам1Имя);
				// Сообщить("Парам1Обязательный = " + Парам1Обязательный);
				// Сообщить("Парам1Тип = " + Парам1Тип);
				// Сообщить("Парам1Описание = " + Парам1Описание);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Для А8 = 0 По М_Параметров.ВГраница() Цикл
		// Сообщить("Парам = " + М_Параметров[А8]);
		М9 = РазобратьСтроку(М_Параметров[А8], ";;;");
		// Парам = Игрек;;;обязательный;;;Тип: Число.;;;Координата по оси игрек.
		Парам1Имя = СокрЛП(М9[0]);
		Парам1Обязательный = СокрЛП(М9[1]);
		Парам1Тип = СокрЛП(М9[2]);
		Парам1Описание = СокрЛП(М9[3]);
		// Сообщить("=====================");
		// Сообщить("Парам1Имя = " + Парам1Имя);
		// Сообщить("Парам1Обязательный = " + Парам1Обязательный);
		// Сообщить("Парам1Тип = " + Парам1Тип);
		// Сообщить("Парам1Описание = " + Парам1Описание);
		
		Если А8 = 0 Тогда
			ПолеВвода9.Текст = Парам1Имя;
			ПолеВыбора1.Текст = Парам1Обязательный;
			ПолеВыбора3.Текст = Парам1Тип;
			ПолеВвода10.Текст = Парам1Описание;
		КонецЕсли;
		Если А8 = 1 Тогда
			ПолеВвода12.Текст = Парам1Имя;
			ПолеВыбора5.Текст = Парам1Обязательный;
			ПолеВыбора4.Текст = Парам1Тип;
			ПолеВвода11.Текст = Парам1Описание;
		КонецЕсли;
		Если А8 = 2 Тогда
			ПолеВвода14.Текст = Парам1Имя;
			ПолеВыбора7.Текст = Парам1Обязательный;
			ПолеВыбора6.Текст = Парам1Тип;
			ПолеВвода13.Текст = Парам1Описание;
		КонецЕсли;
		Если А8 = 3 Тогда
			ПолеВвода16.Текст = Парам1Имя;
			ПолеВыбора9.Текст = Парам1Обязательный;
			ПолеВыбора8.Текст = Парам1Тип;
			ПолеВвода15.Текст = Парам1Описание;
		КонецЕсли;
		Если А8 = 4 Тогда
			ПолеВвода18.Текст = Парам1Имя;
			ПолеВыбора11.Текст = Парам1Обязательный;
			ПолеВыбора10.Текст = Парам1Тип;
			ПолеВвода17.Текст = Парам1Описание;
		КонецЕсли;
		Если А8 = 5 Тогда
			ПолеВвода20.Текст = Парам1Имя;
			ПолеВыбора13.Текст = Парам1Обязательный;
			ПолеВыбора12.Текст = Парам1Тип;
			ПолеВвода19.Текст = Парам1Описание;
		КонецЕсли;
		Если А8 = 6 Тогда
			ПолеВвода22.Текст = Парам1Имя;
			ПолеВыбора15.Текст = Парам1Обязательный;
			ПолеВыбора14.Текст = Парам1Тип;
			ПолеВвода21.Текст = Парам1Описание;
		КонецЕсли;
		Если А8 = 7 Тогда
			ПолеВвода24.Текст = Парам1Имя;
			ПолеВыбора17.Текст = Парам1Обязательный;
			ПолеВыбора16.Текст = Парам1Тип;
			ПолеВвода23.Текст = Парам1Описание;
		КонецЕсли;
		Если А8 = 8 Тогда
			ПолеВвода26.Текст = Парам1Имя;
			ПолеВыбора19.Текст = Парам1Обязательный;
			ПолеВыбора18.Текст = Парам1Тип;
			ПолеВвода25.Текст = Парам1Описание;
		КонецЕсли;
		Если А8 = 9 Тогда
			ПолеВвода28.Текст = Парам1Имя;
			ПолеВыбора21.Текст = Парам1Обязательный;
			ПолеВыбора20.Текст = Парам1Тип;
			ПолеВвода27.Текст = Парам1Описание;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ЗаполнитьНаследуемыеМетоды() Экспорт
	ПолеВыбора25.Элементы.Очистить();
	ПолеВыбора25.Текст = "";
	
	КлассМетодаРус = СтрРазделить(ПолеВыбора23.Текст, " ")[0];
	КлассМетодаАнгл = СтрРазделить(ПолеВыбора23.Текст, " ")[1];
	// Сообщить("КлассМетодаРус = " + КлассМетодаРус);
	// Сообщить("КлассМетодаАнгл = " + КлассМетодаАнгл);
	
	ТекстДок = Новый ТекстовыйДокумент;
	// C:\444\OneScriptIntegrator\docs\OSIntegrator\OSIntegrator.OneScriptIntegratorMethods.html
	ФайлМетода = ПутьКСтранице + КлассМетодаАнгл + "Methods.html";
	КаталогНаДиске = Новый Файл(ФайлМетода);
    Если Не (КаталогНаДиске.Существует()) Тогда
		Возврат;
	КонецЕсли;
	ТекстДок.Прочитать(ФайлМетода);
	СтрТекстДок = ТекстДок.ПолучитьТекст();
	// Сообщить("СтрТекстДок = " + СтрТекстДок);

	Список = Новый СписокЗначений();
	М2 = СтрНайтиМежду(СтрТекстДок, "<tbody>", "</tbody>", , );
	Если М2.Количество() > 0 Тогда
		// Сообщить("" + М2[1]);
		М3 = СтрНайтиМежду(М2[1], "<tr vAlign=top>", "</tr>", Ложь, );
		Для А3 = 0 По М3.ВГраница() Цикл
			// Сообщить("" + М3[А3]);
			М4 = СтрНайтиМежду(М3[А3], "html"">", "</a>", , );
			Если М4.Количество() > 0 Тогда
				Для А4 = 0 По М4.ВГраница() Цикл
					// Сообщить("М4[0] = " + М4[0]);
					ИмяМетода = М4[0];
					ИмяМетода = СтрЗаменить(ИмяМетода, "&nbsp;", " ");
					ИмяМетода = СтрЗаменить(ИмяМетода, "(", "");
					ИмяМетода = СтрЗаменить(ИмяМетода, ")", "");
					
					Если Список.НайтиПоЗначению(ИмяМетода) = Неопределено Тогда
						Если Не СтрНайти(М3[А3], "(унаследовано") > 0 Тогда
							Список.Добавить(ИмяМетода, КлассМетодаРус + " " + КлассМетодаАнгл);
							// Сообщить("" + ИмяМетода + " " + КлассРусАнгл);
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Для А = 0 По Список.Количество() - 1 Цикл
		ПолеВыбора25.Элементы.Добавить(Список.Получить(А).Значение + " " + Список.Получить(А).Представление);
	КонецЦикла;
КонецПроцедуры

Процедура ПодготовкаКомпонентов()
    // ВАЖНО: Необходимая процедура для поддержки конструктора — не изменяйте содержимое этой процедуры с помощью редактора кода.
    // osdText = "WzzQmtC+0L3RgdGC0YDRg9C60YLQvtGA0YtdDQrQpNC+0YDQvNCwXzAgPSDQpC7QpNC+0YDQvNCwKCk7DQrQndCw0LTQv9C40YHRjDEgPSDQpC7QndCw0LTQv9C40YHRjCgpOw0K0J3QsNC00L/QuNGB0YwzID0g0KQu0J3QsNC00L/QuNGB0YwoKTsNCtCf0L7Qu9C10JLQstC+0LTQsDMgPSDQpC7Qn9C+0LvQtdCS0LLQvtC00LAoKTsNCtCa0L3QvtC/0LrQsDEgPSDQpC7QmtC90L7Qv9C60LAoKTsNCtCd0LDQtNC/0LjRgdGMNCA9INCkLtCd0LDQtNC/0LjRgdGMKCk7DQrQndCw0LTQv9C40YHRjDYgPSDQpC7QndCw0LTQv9C40YHRjCgpOw0K0J/QvtC70LXQktCy0L7QtNCwNCA9INCkLtCf0L7Qu9C10JLQstC+0LTQsCgpOw0K0J3QsNC00L/QuNGB0Yw3ID0g0KQu0J3QsNC00L/QuNGB0YwoKTsNCtCf0L7Qu9C10JLQstC+0LTQsDUgPSDQpC7Qn9C+0LvQtdCS0LLQvtC00LAoKTsNCtCd0LDQtNC/0LjRgdGMOCA9INCkLtCd0LDQtNC/0LjRgdGMKCk7DQrQndCw0LTQv9C40YHRjDkgPSDQpC7QndCw0LTQv9C40YHRjCgpOw0K0J/QvtC70LXQktCy0L7QtNCwOCA9INCkLtCf0L7Qu9C10JLQstC+0LTQsCgpOw0K0J/QsNC90LXQu9GM0JLQutC70LDQtNC+0LoxID0g0KQu0J/QsNC90LXQu9GM0JLQutC70LDQtNC+0LooKTsNCtCS0LrQu9Cw0LTQutCwMSA9INCkLtCS0LrQu9Cw0LTQutCwKCk7DQrQktC60LvQsNC00LrQsDIgPSDQpC7QktC60LvQsNC00LrQsCgpOw0K0J3QsNC00L/QuNGB0YwxMCA9INCkLtCd0LDQtNC/0LjRgdGMKCk7DQrQktC60LvQsNC00LrQsDMgPSDQpC7QktC60LvQsNC00LrQsCgpOw0K0JLQutC70LDQtNC60LA0ID0g0KQu0JLQutC70LDQtNC60LAoKTsNCtCS0LrQu9Cw0LTQutCwNSA9INCkLtCS0LrQu9Cw0LTQutCwKCk7DQrQktC60LvQsNC00LrQsDYgPSDQpC7QktC60LvQsNC00LrQsCgpOw0K0JLQutC70LDQtNC60LA3ID0g0KQu0JLQutC70LDQtNC60LAoKTsNCtCS0LrQu9Cw0LTQutCwOCA9INCkLtCS0LrQu9Cw0LTQutCwKCk7DQrQktC60LvQsNC00LrQsDkgPSDQpC7QktC60LvQsNC00LrQsCgpOw0K0JLQutC70LDQtNC60LAxMCA9INCkLtCS0LrQu9Cw0LTQutCwKCk7DQrQndCw0LTQv9C40YHRjDExID0g0KQu0J3QsNC00L/QuNGB0YwoKTsNCtCf0L7Qu9C10JLQstC+0LTQsDkgPSDQpC7Qn9C+0LvQtdCS0LLQvtC00LAoKTsNCtCd0LDQtNC/0LjRgdGMMTIgPSDQpC7QndCw0LTQv9C40YHRjCgpOw0K0J3QsNC00L/QuNGB0YwxMyA9INCkLtCd0LDQtNC/0LjRgdGMKCk7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDEgPSDQpC7Qn9C+0LvQtdCS0YvQsdC+0YDQsCgpOw0K0J/QvtC70LXQktGL0LHQvtGA0LAyID0g0KQu0J/QvtC70LXQktGL0LHQvtGA0LAoKTsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMyA9INCkLtCf0L7Qu9C10JLRi9Cx0L7RgNCwKCk7DQrQndCw0LTQv9C40YHRjDE0ID0g0KQu0J3QsNC00L/QuNGB0YwoKTsNCtCf0L7Qu9C10JLQstC+0LTQsDEwID0g0KQu0J/QvtC70LXQktCy0L7QtNCwKCk7DQrQn9C+0LvQtdCS0LLQvtC00LAxMSA9INCkLtCf0L7Qu9C10JLQstC+0LTQsCgpOw0K0J3QsNC00L/QuNGB0YwxNSA9INCkLtCd0LDQtNC/0LjRgdGMKCk7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDQgPSDQpC7Qn9C+0LvQtdCS0YvQsdC+0YDQsCgpOw0K0J/QvtC70LXQktGL0LHQvtGA0LA1ID0g0KQu0J/QvtC70LXQktGL0LHQvtGA0LAoKTsNCtCd0LDQtNC/0LjRgdGMMTYgPSDQpC7QndCw0LTQv9C40YHRjCgpOw0K0J3QsNC00L/QuNGB0YwxNyA9INCkLtCd0LDQtNC/0LjRgdGMKCk7DQrQn9C+0LvQtdCS0LLQvtC00LAxMiA9INCkLtCf0L7Qu9C10JLQstC+0LTQsCgpOw0K0J3QsNC00L/QuNGB0YwxOCA9INCkLtCd0LDQtNC/0LjRgdGMKCk7DQrQn9C+0LvQtdCS0LLQvtC00LAxMyA9INCkLtCf0L7Qu9C10JLQstC+0LTQsCgpOw0K0J3QsNC00L/QuNGB0YwxOSA9INCkLtCd0LDQtNC/0LjRgdGMKCk7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDYgPSDQpC7Qn9C+0LvQtdCS0YvQsdC+0YDQsCgpOw0K0J/QvtC70LXQktGL0LHQvtGA0LA3ID0g0KQu0J/QvtC70LXQktGL0LHQvtGA0LAoKTsNCtCd0LDQtNC/0LjRgdGMMjAgPSDQpC7QndCw0LTQv9C40YHRjCgpOw0K0J3QsNC00L/QuNGB0YwyMSA9INCkLtCd0LDQtNC/0LjRgdGMKCk7DQrQn9C+0LvQtdCS0LLQvtC00LAxNCA9INCkLtCf0L7Qu9C10JLQstC+0LTQsCgpOw0K0J3QsNC00L/QuNGB0YwyMiA9INCkLtCd0LDQtNC/0LjRgdGMKCk7DQrQn9C+0LvQtdCS0LLQvtC00LAxNSA9INCkLtCf0L7Qu9C10JLQstC+0LTQsCgpOw0K0J3QsNC00L/QuNGB0YwyMyA9INCkLtCd0LDQtNC/0LjRgdGMKCk7DQrQndCw0LTQv9C40YHRjDI0ID0g0KQu0J3QsNC00L/QuNGB0YwoKTsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwOCA9INCkLtCf0L7Qu9C10JLRi9Cx0L7RgNCwKCk7DQrQn9C+0LvQtdCS0LLQvtC00LAxNiA9INCkLtCf0L7Qu9C10JLQstC+0LTQsCgpOw0K0J/QvtC70LXQktGL0LHQvtGA0LA5ID0g0KQu0J/QvtC70LXQktGL0LHQvtGA0LAoKTsNCtCd0LDQtNC/0LjRgdGMMjUgPSDQpC7QndCw0LTQv9C40YHRjCgpOw0K0J3QsNC00L/QuNGB0YwyNiA9INCkLtCd0LDQtNC/0LjRgdGMKCk7DQrQn9C+0LvQtdCS0LLQvtC00LAxNyA9INCkLtCf0L7Qu9C10JLQstC+0LTQsCgpOw0K0J3QsNC00L/QuNGB0YwyNyA9INCkLtCd0LDQtNC/0LjRgdGMKCk7DQrQndCw0LTQv9C40YHRjDI4ID0g0KQu0J3QsNC00L/QuNGB0YwoKTsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMTAgPSDQpC7Qn9C+0LvQtdCS0YvQsdC+0YDQsCgpOw0K0J/QvtC70LXQktCy0L7QtNCwMTggPSDQpC7Qn9C+0LvQtdCS0LLQvtC00LAoKTsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMTEgPSDQpC7Qn9C+0LvQtdCS0YvQsdC+0YDQsCgpOw0K0J3QsNC00L/QuNGB0YwyOSA9INCkLtCd0LDQtNC/0LjRgdGMKCk7DQrQndCw0LTQv9C40YHRjDMwID0g0KQu0J3QsNC00L/QuNGB0YwoKTsNCtCf0L7Qu9C10JLQstC+0LTQsDE5ID0g0KQu0J/QvtC70LXQktCy0L7QtNCwKCk7DQrQndCw0LTQv9C40YHRjDMxID0g0KQu0J3QsNC00L/QuNGB0YwoKTsNCtCd0LDQtNC/0LjRgdGMMzIgPSDQpC7QndCw0LTQv9C40YHRjCgpOw0K0J/QvtC70LXQktGL0LHQvtGA0LAxMiA9INCkLtCf0L7Qu9C10JLRi9Cx0L7RgNCwKCk7DQrQn9C+0LvQtdCS0LLQvtC00LAyMCA9INCkLtCf0L7Qu9C10JLQstC+0LTQsCgpOw0K0J/QvtC70LXQktGL0LHQvtGA0LAxMyA9INCkLtCf0L7Qu9C10JLRi9Cx0L7RgNCwKCk7DQrQndCw0LTQv9C40YHRjDMzID0g0KQu0J3QsNC00L/QuNGB0YwoKTsNCtCd0LDQtNC/0LjRgdGMMzQgPSDQpC7QndCw0LTQv9C40YHRjCgpOw0K0J/QvtC70LXQktCy0L7QtNCwMjEgPSDQpC7Qn9C+0LvQtdCS0LLQvtC00LAoKTsNCtCd0LDQtNC/0LjRgdGMMzUgPSDQpC7QndCw0LTQv9C40YHRjCgpOw0K0J3QsNC00L/QuNGB0YwzNiA9INCkLtCd0LDQtNC/0LjRgdGMKCk7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDE0ID0g0KQu0J/QvtC70LXQktGL0LHQvtGA0LAoKTsNCtCf0L7Qu9C10JLQstC+0LTQsDIyID0g0KQu0J/QvtC70LXQktCy0L7QtNCwKCk7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDE1ID0g0KQu0J/QvtC70LXQktGL0LHQvtGA0LAoKTsNCtCd0LDQtNC/0LjRgdGMMzcgPSDQpC7QndCw0LTQv9C40YHRjCgpOw0K0J3QsNC00L/QuNGB0YwzOCA9INCkLtCd0LDQtNC/0LjRgdGMKCk7DQrQn9C+0LvQtdCS0LLQvtC00LAyMyA9INCkLtCf0L7Qu9C10JLQstC+0LTQsCgpOw0K0J3QsNC00L/QuNGB0YwzOSA9INCkLtCd0LDQtNC/0LjRgdGMKCk7DQrQndCw0LTQv9C40YHRjDQwID0g0KQu0J3QsNC00L/QuNGB0YwoKTsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMTYgPSDQpC7Qn9C+0LvQtdCS0YvQsdC+0YDQsCgpOw0K0J/QvtC70LXQktCy0L7QtNCwMjQgPSDQpC7Qn9C+0LvQtdCS0LLQvtC00LAoKTsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMTcgPSDQpC7Qn9C+0LvQtdCS0YvQsdC+0YDQsCgpOw0K0J3QsNC00L/QuNGB0Yw0MSA9INCkLtCd0LDQtNC/0LjRgdGMKCk7DQrQndCw0LTQv9C40YHRjDQyID0g0KQu0J3QsNC00L/QuNGB0YwoKTsNCtCf0L7Qu9C10JLQstC+0LTQsDI1ID0g0KQu0J/QvtC70LXQktCy0L7QtNCwKCk7DQrQndCw0LTQv9C40YHRjDQzID0g0KQu0J3QsNC00L/QuNGB0YwoKTsNCtCd0LDQtNC/0LjRgdGMNDQgPSDQpC7QndCw0LTQv9C40YHRjCgpOw0K0J/QvtC70LXQktGL0LHQvtGA0LAxOCA9INCkLtCf0L7Qu9C10JLRi9Cx0L7RgNCwKCk7DQrQn9C+0LvQtdCS0LLQvtC00LAyNiA9INCkLtCf0L7Qu9C10JLQstC+0LTQsCgpOw0K0J/QvtC70LXQktGL0LHQvtGA0LAxOSA9INCkLtCf0L7Qu9C10JLRi9Cx0L7RgNCwKCk7DQrQndCw0LTQv9C40YHRjDQ1ID0g0KQu0J3QsNC00L/QuNGB0YwoKTsNCtCd0LDQtNC/0LjRgdGMNDYgPSDQpC7QndCw0LTQv9C40YHRjCgpOw0K0J/QvtC70LXQktCy0L7QtNCwMjcgPSDQpC7Qn9C+0LvQtdCS0LLQvtC00LAoKTsNCtCd0LDQtNC/0LjRgdGMNDcgPSDQpC7QndCw0LTQv9C40YHRjCgpOw0K0J3QsNC00L/QuNGB0Yw0OCA9INCkLtCd0LDQtNC/0LjRgdGMKCk7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDIwID0g0KQu0J/QvtC70LXQktGL0LHQvtGA0LAoKTsNCtCf0L7Qu9C10JLQstC+0LTQsDI4ID0g0KQu0J/QvtC70LXQktCy0L7QtNCwKCk7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDIxID0g0KQu0J/QvtC70LXQktGL0LHQvtGA0LAoKTsNCtCd0LDQtNC/0LjRgdGMNDkgPSDQpC7QndCw0LTQv9C40YHRjCgpOw0K0J3QsNC00L/QuNGB0Yw1MCA9INCkLtCd0LDQtNC/0LjRgdGMKCk7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDIyID0g0KQu0J/QvtC70LXQktGL0LHQvtGA0LAoKTsNCtCd0LDQtNC/0LjRgdGMNTEgPSDQpC7QndCw0LTQv9C40YHRjCgpOw0K0J/QvtC70LXQktGL0LHQvtGA0LAyMyA9INCkLtCf0L7Qu9C10JLRi9Cx0L7RgNCwKCk7DQrQndCw0LTQv9C40YHRjDUyID0g0KQu0J3QsNC00L/QuNGB0YwoKTsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMjQgPSDQpC7Qn9C+0LvQtdCS0YvQsdC+0YDQsCgpOw0K0JrQvdC+0L/QutCwMiA9INCkLtCa0L3QvtC/0LrQsCgpOw0K0KDQsNC80LrQsNCT0YDRg9C/0L/RizEgPSDQpC7QoNCw0LzQutCw0JPRgNGD0L/Qv9GLKCk7DQrQndCw0LTQv9C40YHRjDUzID0g0KQu0J3QsNC00L/QuNGB0YwoKTsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMjUgPSDQpC7Qn9C+0LvQtdCS0YvQsdC+0YDQsCgpOw0K0KTQu9Cw0LbQvtC6MSA9INCkLtCk0LvQsNC20L7QuigpOw0KW9Ca0L7QvdGB0YLRgNGD0LrRgtC+0YDRiz5dDQpbPNCh0LLQvtC50YHRgtCy0LBdDQpbPNCk0L7RgNC80LBfMF0NCtCk0L7RgNC80LBfMC7QoNCw0LfQvNC10YAgPSDQpC7QoNCw0LfQvNC10YAoNzIzLCA3MDgpOw0K0KTQvtGA0LzQsF8wLtCf0YPRgtGMID0gIkM6XDQ0NFxPbmVTY3JpcHRJbnRlZ3JhdG9yXNCk0LDQsdGA0LjQutCwSHRtbFzQodC+0LfQtNCw0L3QuNC10JzQtdGC0L7QtNCwLm9zIjsNCtCk0L7RgNC80LBfMC7QodGC0LjQu9GM0KHQutGA0LjQv9GC0LAgPSAi0KHRgtC40LvRjNCh0LrRgNC40L/RgtCwIjsNCtCk0L7RgNC80LBfMC7QotC10LrRgdGCID0gItCh0L7Qt9C00LDQvdC40LUg0LzQtdGC0L7QtNCwINCY0L3RgtC10LPRgNCw0YLQvtGAIjsNCtCk0L7RgNC80LBfMC7QqNGA0LjRhNGCID0g0KQu0KjRgNC40YTRgigiTWljcm9zb2Z0IFNhbnMgU2VyaWYiLCA5Ljc1LCApOw0K0KTQvtGA0LzQsF8wLtCY0LzRj9Ce0LHRitC10LrRgtCw0KTQvtGA0LzRi9CU0LvRj9Ce0LTQvdC+0KHQutGA0LjQv9GC0LAgPSAi0KQiOw0KW9Ck0L7RgNC80LBfMD5dDQpbPNCd0LDQtNC/0LjRgdGMMV0NCtCd0LDQtNC/0LjRgdGMMS7QoNC+0LTQuNGC0LXQu9GMID0g0KTQvtGA0LzQsF8wOw0K0J3QsNC00L/QuNGB0YwxLtCg0LDQt9C80LXRgCA9INCkLtCg0LDQt9C80LXRgCgxMDAsIDE4KTsNCtCd0LDQtNC/0LjRgdGMMS7Qn9C+0YDRj9C00L7QutCe0LHRhdC+0LTQsCA9IDA7DQrQndCw0LTQv9C40YHRjDEu0J/QvtC70L7QttC10L3QuNC1ID0g0KQu0KLQvtGH0LrQsCgyNiwgOSk7DQrQndCw0LTQv9C40YHRjDEu0KLQtdC60YHRgiA9ICLQmtC70LDRgdGBIjsNCtCd0LDQtNC/0LjRgdGMMS7QqNGA0LjRhNGCID0g0KQu0KjRgNC40YTRgigiTWljcm9zb2Z0IFNhbnMgU2VyaWYiLCA5Ljc1LCApOw0KW9Cd0LDQtNC/0LjRgdGMMT5dDQpbPNCd0LDQtNC/0LjRgdGMM10NCtCd0LDQtNC/0LjRgdGMMy7QoNC+0LTQuNGC0LXQu9GMID0g0KTQvtGA0LzQsF8wOw0K0J3QsNC00L/QuNGB0YwzLtCg0LDQt9C80LXRgCA9INCkLtCg0LDQt9C80LXRgCgxMjMsIDE5KTsNCtCd0LDQtNC/0LjRgdGMMy7Qn9C+0YDRj9C00L7QutCe0LHRhdC+0LTQsCA9IDM7DQrQndCw0LTQv9C40YHRjDMu0J/QvtC70L7QttC10L3QuNC1ID0g0KQu0KLQvtGH0LrQsCgyNiwgOTgpOw0K0J3QsNC00L/QuNGB0YwzLtCi0LXQutGB0YIgPSAi0JzQtdGC0L7QtNCe0L/QuNGB0LDQvdC40LUiOw0K0J3QsNC00L/QuNGB0YwzLtCo0YDQuNGE0YIgPSDQpC7QqNGA0LjRhNGCKCJNaWNyb3NvZnQgU2FucyBTZXJpZiIsIDkuNzUsICk7DQpb0J3QsNC00L/QuNGB0YwzPl0NCls80J/QvtC70LXQktCy0L7QtNCwM10NCtCf0L7Qu9C10JLQstC+0LTQsDMu0KDQvtC00LjRgtC10LvRjCA9INCk0L7RgNC80LBfMDsNCtCf0L7Qu9C10JLQstC+0LTQsDMu0JzQvdC+0LPQvtGB0YLRgNC+0YfQvdGL0LnQoNC10LbQuNC8ID0g0JjRgdGC0LjQvdCwOw0K0J/QvtC70LXQktCy0L7QtNCwMy7QoNCw0LfQvNC10YAgPSDQpC7QoNCw0LfQvNC10YAoNjU2LCA1MSk7DQrQn9C+0LvQtdCS0LLQvtC00LAzLtCf0L7RgNGP0LTQvtC60J7QsdGF0L7QtNCwID0gMjsNCtCf0L7Qu9C10JLQstC+0LTQsDMu0J/QvtC70L7QttC10L3QuNC1ID0g0KQu0KLQvtGH0LrQsCgyNiwgMTIwKTsNCtCf0L7Qu9C10JLQstC+0LTQsDMu0KjRgNC40YTRgiA9INCkLtCo0YDQuNGE0YIoIk1pY3Jvc29mdCBTYW5zIFNlcmlmIiwgOS43NSwgKTsNClvQn9C+0LvQtdCS0LLQvtC00LAzPl0NCls80JrQvdC+0L/QutCwMV0NCtCa0L3QvtC/0LrQsDEu0KDQvtC00LjRgtC10LvRjCA9INCk0L7RgNC80LBfMDsNCtCa0L3QvtC/0LrQsDEu0KDQsNC30LzQtdGAID0g0KQu0KDQsNC30LzQtdGAKDczLCAzOSk7DQrQmtC90L7Qv9C60LAxLtCf0L7RgNGP0LTQvtC60J7QsdGF0L7QtNCwID0gNDsNCtCa0L3QvtC/0LrQsDEu0J3QsNC20LDRgtC40LUgPSAi0JrQvTFf0J3QsNC20LDRgtC40LUiOw0K0JrQvdC+0L/QutCwMS7Qn9C+0LvQvtC20LXQvdC40LUgPSDQpC7QotC+0YfQutCwKDYwOSwgNjE4KTsNCtCa0L3QvtC/0LrQsDEu0KLQtdC60YHRgiA9ICLQodC+0LfQtNCw0YLRjCDQvNC10YLQvtC0IjsNCtCa0L3QvtC/0LrQsDEu0KjRgNC40YTRgiA9INCkLtCo0YDQuNGE0YIoIk1pY3Jvc29mdCBTYW5zIFNlcmlmIiwgOS43NSwgKTsNClvQmtC90L7Qv9C60LAxPl0NCls80J3QsNC00L/QuNGB0Yw0XQ0K0J3QsNC00L/QuNGB0Yw0LtCg0L7QtNC40YLQtdC70YwgPSDQpNC+0YDQvNCwXzA7DQrQndCw0LTQv9C40YHRjDQu0KDQsNC30LzQtdGAID0g0KQu0KDQsNC30LzQtdGAKDM0NCwgMTcpOw0K0J3QsNC00L/QuNGB0Yw0LtCf0L7RgNGP0LTQvtC60J7QsdGF0L7QtNCwID0gNTsNCtCd0LDQtNC/0LjRgdGMNC7Qn9C+0LvQvtC20LXQvdC40LUgPSDQpC7QotC+0YfQutCwKDM1MSwgMjkpOw0K0J3QsNC00L/QuNGB0Yw0LtCi0LXQutGB0YIgPSAi0JLRi9GF0L7QtNC90YvQtSDQtNCw0L3QvdGL0LUg0LHRg9C00YPRgiDQsiDQutCw0YLQsNC70L7Qs9C1IC4uLlzQndC+0LLRi9C1SHRtbCI7DQrQndCw0LTQv9C40YHRjDQu0KjRgNC40YTRgiA9INCkLtCo0YDQuNGE0YIoIk1pY3Jvc29mdCBTYW5zIFNlcmlmIiwgOS43NSwgKTsNClvQndCw0LTQv9C40YHRjDQ+XQ0KWzzQndCw0LTQv9C40YHRjDZdDQrQndCw0LTQv9C40YHRjDYu0KDQvtC00LjRgtC10LvRjCA9INCk0L7RgNC80LBfMDsNCtCd0LDQtNC/0LjRgdGMNi7QoNCw0LfQvNC10YAgPSDQpC7QoNCw0LfQvNC10YAoMTAwLCAxOSk7DQrQndCw0LTQv9C40YHRjDYu0J/QvtGA0Y/QtNC+0LrQntCx0YXQvtC00LAgPSA3Ow0K0J3QsNC00L/QuNGB0Yw2LtCf0L7Qu9C+0LbQtdC90LjQtSA9INCkLtCi0L7Rh9C60LAoMjYsIDUzKTsNCtCd0LDQtNC/0LjRgdGMNi7QotC10LrRgdGCID0gItCc0LXRgtC+0LTQmNC80Y/QoNGD0YEiOw0K0J3QsNC00L/QuNGB0Yw2LtCo0YDQuNGE0YIgPSDQpC7QqNGA0LjRhNGCKCJNaWNyb3NvZnQgU2FucyBTZXJpZiIsIDkuNzUsICk7DQpb0J3QsNC00L/QuNGB0Yw2Pl0NCls80J/QvtC70LXQktCy0L7QtNCwNF0NCtCf0L7Qu9C10JLQstC+0LTQsDQu0KDQvtC00LjRgtC10LvRjCA9INCk0L7RgNC80LBfMDsNCtCf0L7Qu9C10JLQstC+0LTQsDQu0KDQsNC30LzQtdGAID0g0KQu0KDQsNC30LzQtdGAKDMyNSwgMjIpOw0K0J/QvtC70LXQktCy0L7QtNCwNC7Qn9C+0YDRj9C00L7QutCe0LHRhdC+0LTQsCA9IDg7DQrQn9C+0LvQtdCS0LLQvtC00LA0LtCf0L7Qu9C+0LbQtdC90LjQtSA9INCkLtCi0L7Rh9C60LAoMjIsIDc1KTsNCtCf0L7Qu9C10JLQstC+0LTQsDQu0KjRgNC40YTRgiA9INCkLtCo0YDQuNGE0YIoIk1pY3Jvc29mdCBTYW5zIFNlcmlmIiwgOS43NSwgKTsNClvQn9C+0LvQtdCS0LLQvtC00LA0Pl0NCls80J3QsNC00L/QuNGB0Yw3XQ0K0J3QsNC00L/QuNGB0Yw3LtCg0L7QtNC40YLQtdC70YwgPSDQpNC+0YDQvNCwXzA7DQrQndCw0LTQv9C40YHRjDcu0KDQsNC30LzQtdGAID0g0KQu0KDQsNC30LzQtdGAKDEwMCwgMTgpOw0K0J3QsNC00L/QuNGB0Yw3LtCf0L7RgNGP0LTQvtC60J7QsdGF0L7QtNCwID0gOTsNCtCd0LDQtNC/0LjRgdGMNy7Qn9C+0LvQvtC20LXQvdC40LUgPSDQpC7QotC+0YfQutCwKDM1NywgNTQpOw0K0J3QsNC00L/QuNGB0Yw3LtCi0LXQutGB0YIgPSAi0JzQtdGC0L7QtNCY0LzRj0VuIjsNCtCd0LDQtNC/0LjRgdGMNy7QqNGA0LjRhNGCID0g0KQu0KjRgNC40YTRgigiTWljcm9zb2Z0IFNhbnMgU2VyaWYiLCA5Ljc1LCApOw0KW9Cd0LDQtNC/0LjRgdGMNz5dDQpbPNCf0L7Qu9C10JLQstC+0LTQsDVdDQrQn9C+0LvQtdCS0LLQvtC00LA1LtCg0L7QtNC40YLQtdC70YwgPSDQpNC+0YDQvNCwXzA7DQrQn9C+0LvQtdCS0LLQvtC00LA1LtCg0LDQt9C80LXRgCA9INCkLtCg0LDQt9C80LXRgCgzMjUsIDIyKTsNCtCf0L7Qu9C10JLQstC+0LTQsDUu0J/QvtGA0Y/QtNC+0LrQntCx0YXQvtC00LAgPSAxMDsNCtCf0L7Qu9C10JLQstC+0LTQsDUu0J/QvtC70L7QttC10L3QuNC1ID0g0KQu0KLQvtGH0LrQsCgzNTMsIDc1KTsNCtCf0L7Qu9C10JLQstC+0LTQsDUu0KjRgNC40YTRgiA9INCkLtCo0YDQuNGE0YIoIk1pY3Jvc29mdCBTYW5zIFNlcmlmIiwgOS43NSwgKTsNClvQn9C+0LvQtdCS0LLQvtC00LA1Pl0NCls80J3QsNC00L/QuNGB0Yw4XQ0K0J3QsNC00L/QuNGB0Yw4LtCg0L7QtNC40YLQtdC70YwgPSDQpNC+0YDQvNCwXzA7DQrQndCw0LTQv9C40YHRjDgu0KDQsNC30LzQtdGAID0g0KQu0KDQsNC30LzQtdGAKDIyMiwgMTgpOw0K0J3QsNC00L/QuNGB0Yw4LtCf0L7RgNGP0LTQvtC60J7QsdGF0L7QtNCwID0gMTE7DQrQndCw0LTQv9C40YHRjDgu0J/QvtC70L7QttC10L3QuNC1ID0g0KQu0KLQvtGH0LrQsCgyNiwgMTc0KTsNCtCd0LDQtNC/0LjRgdGMOC7QotC10LrRgdGCID0gItCS0L7Qt9Cy0YDQsNGJ0LDQtdC80L7QtdCX0L3QsNGH0LXQvdC40LXQotC40L8iOw0K0J3QsNC00L/QuNGB0Yw4LtCo0YDQuNGE0YIgPSDQpC7QqNGA0LjRhNGCKCJNaWNyb3NvZnQgU2FucyBTZXJpZiIsIDkuNzUsICk7DQpb0J3QsNC00L/QuNGB0Yw4Pl0NCls80J3QsNC00L/QuNGB0Yw5XQ0K0J3QsNC00L/QuNGB0Yw5LtCg0L7QtNC40YLQtdC70YwgPSDQpNC+0YDQvNCwXzA7DQrQndCw0LTQv9C40YHRjDku0KDQsNC30LzQtdGAID0g0KQu0KDQsNC30LzQtdGAKDI1NywgMTcpOw0K0J3QsNC00L/QuNGB0Yw5LtCf0L7RgNGP0LTQvtC60J7QsdGF0L7QtNCwID0gMTI7DQrQndCw0LTQv9C40YHRjDku0J/QvtC70L7QttC10L3QuNC1ID0g0KQu0KLQvtGH0LrQsCgyNiwgMjE4KTsNCtCd0LDQtNC/0LjRgdGMOS7QotC10LrRgdGCID0gItCS0L7Qt9Cy0YDQsNGJ0LDQtdC80L7QtdCX0L3QsNGH0LXQvdC40LXQntC/0LjRgdCw0L3QuNC1IjsNCtCd0LDQtNC/0LjRgdGMOS7QqNGA0LjRhNGCID0g0KQu0KjRgNC40YTRgigiTWljcm9zb2Z0IFNhbnMgU2VyaWYiLCA5Ljc1LCApOw0KW9Cd0LDQtNC/0LjRgdGMOT5dDQpbPNCf0L7Qu9C10JLQstC+0LTQsDhdDQrQn9C+0LvQtdCS0LLQvtC00LA4LtCg0L7QtNC40YLQtdC70YwgPSDQpNC+0YDQvNCwXzA7DQrQn9C+0LvQtdCS0LLQvtC00LA4LtCc0L3QvtCz0L7RgdGC0YDQvtGH0L3Ri9C50KDQtdC20LjQvCA9INCY0YHRgtC40L3QsDsNCtCf0L7Qu9C10JLQstC+0LTQsDgu0KDQsNC30LzQtdGAID0g0KQu0KDQsNC30LzQtdGAKDY1NiwgNTQpOw0K0J/QvtC70LXQktCy0L7QtNCwOC7Qn9C+0YDRj9C00L7QutCe0LHRhdC+0LTQsCA9IDE1Ow0K0J/QvtC70LXQktCy0L7QtNCwOC7Qn9C+0LvQvtC20LXQvdC40LUgPSDQpC7QotC+0YfQutCwKDI2LCAyMzgpOw0K0J/QvtC70LXQktCy0L7QtNCwOC7QqNGA0LjRhNGCID0g0KQu0KjRgNC40YTRgigiTWljcm9zb2Z0IFNhbnMgU2VyaWYiLCA5Ljc1LCApOw0KW9Cf0L7Qu9C10JLQstC+0LTQsDg+XQ0KWzzQn9Cw0L3QtdC70YzQktC60LvQsNC00L7QujFdDQrQn9Cw0L3QtdC70YzQktC60LvQsNC00L7QujEu0KDQvtC00LjRgtC10LvRjCA9INCk0L7RgNC80LBfMDsNCtCf0LDQvdC10LvRjNCS0LrQu9Cw0LTQvtC6MS7QoNCw0LfQvNC10YAgPSDQpC7QoNCw0LfQvNC10YAoNjU2LCAyMTIpOw0K0J/QsNC90LXQu9GM0JLQutC70LDQtNC+0LoxLtCf0L7RgNGP0LTQvtC60J7QsdGF0L7QtNCwID0gMTY7DQrQn9Cw0L3QtdC70YzQktC60LvQsNC00L7QujEu0J/QvtC70L7QttC10L3QuNC1ID0g0KQu0KLQvtGH0LrQsCgyNiwgMzIzKTsNCtCf0LDQvdC10LvRjNCS0LrQu9Cw0LTQvtC6MS7QoNCw0LfQvNC10YDQrdC70LXQvNC10L3RgtCwID0g0KQu0KDQsNC30LzQtdGAKDQyLCAxOCk7DQrQn9Cw0L3QtdC70YzQktC60LvQsNC00L7QujEu0KjRgNC40YTRgiA9INCkLtCo0YDQuNGE0YIoIk1pY3Jvc29mdCBTYW5zIFNlcmlmIiwgOS43NSwgKTsNClvQn9Cw0L3QtdC70YzQktC60LvQsNC00L7QujE+XQ0KWzzQktC60LvQsNC00LrQsDFdDQrQktC60LvQsNC00LrQsDEu0KDQvtC00LjRgtC10LvRjCA9INCf0LDQvdC10LvRjNCS0LrQu9Cw0LTQvtC6MTsNCtCS0LrQu9Cw0LTQutCwMS7QotC10LrRgdGCID0gIjAiOw0KW9CS0LrQu9Cw0LTQutCwMT5dDQpbPNCd0LDQtNC/0LjRgdGMMTFdDQrQndCw0LTQv9C40YHRjDExLtCg0L7QtNC40YLQtdC70YwgPSDQktC60LvQsNC00LrQsDE7DQrQndCw0LTQv9C40YHRjDExLtCg0LDQt9C80LXRgCA9INCkLtCg0LDQt9C80LXRgCgxMDAsIDE0KTsNCtCd0LDQtNC/0LjRgdGMMTEu0J/QvtGA0Y/QtNC+0LrQntCx0YXQvtC00LAgPSAwOw0K0J3QsNC00L/QuNGB0YwxMS7Qn9C+0LvQvtC20LXQvdC40LUgPSDQpC7QotC+0YfQutCwKDYsIDMpOw0K0J3QsNC00L/QuNGB0YwxMS7QotC10LrRgdGCID0gItCY0LzRjyI7DQrQndCw0LTQv9C40YHRjDExLtCo0YDQuNGE0YIgPSDQpC7QqNGA0LjRhNGCKCJNaWNyb3NvZnQgU2FucyBTZXJpZiIsIDkuNzUsICk7DQpb0J3QsNC00L/QuNGB0YwxMT5dDQpbPNCf0L7Qu9C10JLQstC+0LTQsDldDQrQn9C+0LvQtdCS0LLQvtC00LA5LtCg0L7QtNC40YLQtdC70YwgPSDQktC60LvQsNC00LrQsDE7DQrQn9C+0LvQtdCS0LLQvtC00LA5LtCg0LDQt9C80LXRgCA9INCkLtCg0LDQt9C80LXRgCgyOTYsIDIyKTsNCtCf0L7Qu9C10JLQstC+0LTQsDku0J/QvtGA0Y/QtNC+0LrQntCx0YXQvtC00LAgPSAxOw0K0J/QvtC70LXQktCy0L7QtNCwOS7Qn9C+0LvQvtC20LXQvdC40LUgPSDQpC7QotC+0YfQutCwKDYsIDIwKTsNCtCf0L7Qu9C10JLQstC+0LTQsDku0KjRgNC40YTRgiA9INCkLtCo0YDQuNGE0YIoIk1pY3Jvc29mdCBTYW5zIFNlcmlmIiwgOS43NSwgKTsNClvQn9C+0LvQtdCS0LLQvtC00LA5Pl0NCls80J3QsNC00L/QuNGB0YwxMl0NCtCd0LDQtNC/0LjRgdGMMTIu0KDQvtC00LjRgtC10LvRjCA9INCS0LrQu9Cw0LTQutCwMTsNCtCd0LDQtNC/0LjRgdGMMTIu0KDQsNC30LzQtdGAID0g0KQu0KDQsNC30LzQtdGAKDEwMCwgMTQpOw0K0J3QsNC00L/QuNGB0YwxMi7Qn9C+0YDRj9C00L7QutCe0LHRhdC+0LTQsCA9IDI7DQrQndCw0LTQv9C40YHRjDEyLtCf0L7Qu9C+0LbQtdC90LjQtSA9INCkLtCi0L7Rh9C60LAoMzI1LCAzKTsNCtCd0LDQtNC/0LjRgdGMMTIu0KLQtdC60YHRgiA9ICLQntCx0Y/Qt9Cw0YLQtdC70YzQvdGL0LkiOw0K0J3QsNC00L/QuNGB0YwxMi7QqNGA0LjRhNGCID0g0KQu0KjRgNC40YTRgigiTWljcm9zb2Z0IFNhbnMgU2VyaWYiLCA5Ljc1LCApOw0KW9Cd0LDQtNC/0LjRgdGMMTI+XQ0KWzzQndCw0LTQv9C40YHRjDEzXQ0K0J3QsNC00L/QuNGB0YwxMy7QoNC+0LTQuNGC0LXQu9GMID0g0JLQutC70LDQtNC60LAxOw0K0J3QsNC00L/QuNGB0YwxMy7QoNCw0LfQvNC10YAgPSDQpC7QoNCw0LfQvNC10YAoMTAwLCAxNik7DQrQndCw0LTQv9C40YHRjDEzLtCf0L7RgNGP0LTQvtC60J7QsdGF0L7QtNCwID0gMzsNCtCd0LDQtNC/0LjRgdGMMTMu0J/QvtC70L7QttC10L3QuNC1ID0g0KQu0KLQvtGH0LrQsCg2LCA0Myk7DQrQndCw0LTQv9C40YHRjDEzLtCi0LXQutGB0YIgPSAi0KLQuNC/IjsNCtCd0LDQtNC/0LjRgdGMMTMu0KjRgNC40YTRgiA9INCkLtCo0YDQuNGE0YIoIk1pY3Jvc29mdCBTYW5zIFNlcmlmIiwgOS43NSwgKTsNClvQndCw0LTQv9C40YHRjDEzPl0NCls80J/QvtC70LXQktGL0LHQvtGA0LAxXQ0K0J/QvtC70LXQktGL0LHQvtGA0LAxLtCg0L7QtNC40YLQtdC70YwgPSDQktC60LvQsNC00LrQsDE7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDEu0KDQsNC30LzQtdGAID0g0KQu0KDQsNC30LzQtdGAKDI5NiwgMjQpOw0K0J/QvtC70LXQktGL0LHQvtGA0LAxLtCf0L7RgNGP0LTQvtC60J7QsdGF0L7QtNCwID0gNTsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMS7QktGL0YHQvtGC0LDQrdC70LXQvNC10L3RgtCwID0gMTY7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDEu0J/QvtC70L7QttC10L3QuNC1ID0g0KQu0KLQvtGH0LrQsCgzMjUsIDIwKTsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMS7QotC10LrRgdGCID0gItC+0LHRj9C30LDRgtC10LvRjNC90YvQuSI7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDEu0KjQuNGA0LjQvdCw0JLRi9C/0LDQtNCw0Y7RidC10LPQvtCh0L/QuNGB0LrQsCA9IDI5NjsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMS7QqNGA0LjRhNGCID0g0KQu0KjRgNC40YTRgigiTWljcm9zb2Z0IFNhbnMgU2VyaWYiLCA5Ljc1LCApOw0K0J/QvtC70LXQktGL0LHQvtGA0LAxLtCt0LvQtdC80LXQvdGC0Ysu0JTQvtCx0LDQstC40YLRjCjQpC7QrdC70LXQvNC10L3RgtCh0L/QuNGB0LrQsCgi0L7QsdGP0LfQsNGC0LXQu9GM0L3Ri9C5IiwgItC+0LHRj9C30LDRgtC10LvRjNC90YvQuSIpKTsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMS7QrdC70LXQvNC10L3RgtGLLtCU0L7QsdCw0LLQuNGC0Ywo0KQu0K3Qu9C10LzQtdC90YLQodC/0LjRgdC60LAoItC90LXQvtCx0Y/Qt9Cw0YLQtdC70YzQvdGL0LkiLCAi0L3QtdC+0LHRj9C30LDRgtC10LvRjNC90YvQuSIpKTsNClvQn9C+0LvQtdCS0YvQsdC+0YDQsDE+XQ0KWzzQn9C+0LvQtdCS0YvQsdC+0YDQsDNdDQrQn9C+0LvQtdCS0YvQsdC+0YDQsDMu0KDQvtC00LjRgtC10LvRjCA9INCS0LrQu9Cw0LTQutCwMTsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMy7QoNCw0LfQvNC10YAgPSDQpC7QoNCw0LfQvNC10YAoNjE1LCAyNCk7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDMu0J/QvtGA0Y/QtNC+0LrQntCx0YXQvtC00LAgPSA2Ow0K0J/QvtC70LXQktGL0LHQvtGA0LAzLtCS0YvRgdC+0YLQsNCt0LvQtdC80LXQvdGC0LAgPSAxNjsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMy7Qn9C+0LvQvtC20LXQvdC40LUgPSDQpC7QotC+0YfQutCwKDYsIDYyKTsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMy7QotC10LrRgdGCID0gItCi0LjQvzog0JHRg9C70LXQstC+LiI7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDMu0KjQuNGA0LjQvdCw0JLRi9C/0LDQtNCw0Y7RidC10LPQvtCh0L/QuNGB0LrQsCA9IDYxNTsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMy7QqNGA0LjRhNGCID0g0KQu0KjRgNC40YTRgigiTWljcm9zb2Z0IFNhbnMgU2VyaWYiLCA5Ljc1LCApOw0K0J/QvtC70LXQktGL0LHQvtGA0LAzLtCt0LvQtdC80LXQvdGC0Ysu0JTQvtCx0LDQstC40YLRjCjQpC7QrdC70LXQvNC10L3RgtCh0L/QuNGB0LrQsCgi0KLQuNC/OiDQkdGD0LvQtdCy0L4uIiwgItCi0LjQvzog0JHRg9C70LXQstC+LiIpKTsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMy7QrdC70LXQvNC10L3RgtGLLtCU0L7QsdCw0LLQuNGC0Ywo0KQu0K3Qu9C10LzQtdC90YLQodC/0LjRgdC60LAoItCi0LjQvzog0KHRgtGA0L7QutCwLiIsICLQotC40L86INCh0YLRgNC+0LrQsC4iKSk7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDMu0K3Qu9C10LzQtdC90YLRiy7QlNC+0LHQsNCy0LjRgtGMKNCkLtCt0LvQtdC80LXQvdGC0KHQv9C40YHQutCwKCLQotC40L86INCn0LjRgdC70L4uIiwgItCi0LjQvzog0KfQuNGB0LvQvi4iKSk7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDMu0K3Qu9C10LzQtdC90YLRiy7QlNC+0LHQsNCy0LjRgtGMKNCkLtCt0LvQtdC80LXQvdGC0KHQv9C40YHQutCwKCLQotC40L86INCf0YDQvtC40LfQstC+0LvRjNC90YvQuS4iLCAi0KLQuNC/OiDQn9GA0L7QuNC30LLQvtC70YzQvdGL0LkuIikpOw0K0J/QvtC70LXQktGL0LHQvtGA0LAzLtCt0LvQtdC80LXQvdGC0Ysu0JTQvtCx0LDQstC40YLRjCjQpC7QrdC70LXQvNC10L3RgtCh0L/QuNGB0LrQsCgi0LnQudC50LnQudC50LnQudC50LkgICDQudC50LnQudC50LnQudC50LnQuSIsICLQudC50LnQudC50LnQudC50LnQuSAgINC50LnQudC50LnQudC50LnQudC5IikpOw0KW9Cf0L7Qu9C10JLRi9Cx0L7RgNCwMz5dDQpbPNCd0LDQtNC/0LjRgdGMMTRdDQrQndCw0LTQv9C40YHRjDE0LtCg0L7QtNC40YLQtdC70YwgPSDQktC60LvQsNC00LrQsDE7DQrQndCw0LTQv9C40YHRjDE0LtCg0LDQt9C80LXRgCA9INCkLtCg0LDQt9C80LXRgCgxMDAsIDE1KTsNCtCd0LDQtNC/0LjRgdGMMTQu0J/QvtGA0Y/QtNC+0LrQntCx0YXQvtC00LAgPSA3Ow0K0J3QsNC00L/QuNGB0YwxNC7Qn9C+0LvQvtC20LXQvdC40LUgPSDQpC7QotC+0YfQutCwKDYsIDg2KTsNCtCd0LDQtNC/0LjRgdGMMTQu0KLQtdC60YHRgiA9ICLQntC/0LjRgdCw0L3QuNC1IjsNCtCd0LDQtNC/0LjRgdGMMTQu0KjRgNC40YTRgiA9INCkLtCo0YDQuNGE0YIoIk1pY3Jvc29mdCBTYW5zIFNlcmlmIiwgOS43NSwgKTsNClvQndCw0LTQv9C40YHRjDE0Pl0NCls80J/QvtC70LXQktCy0L7QtNCwMTBdDQrQn9C+0LvQtdCS0LLQvtC00LAxMC7QoNC+0LTQuNGC0LXQu9GMID0g0JLQutC70LDQtNC60LAxOw0K0J/QvtC70LXQktCy0L7QtNCwMTAu0JzQvdC+0LPQvtGB0YLRgNC+0YfQvdGL0LnQoNC10LbQuNC8ID0g0JjRgdGC0LjQvdCwOw0K0J/QvtC70LXQktCy0L7QtNCwMTAu0KDQsNC30LzQtdGAID0g0KQu0KDQsNC30LzQtdGAKDYxNSwgNzMpOw0K0J/QvtC70LXQktCy0L7QtNCwMTAu0J/QvtGA0Y/QtNC+0LrQntCx0YXQvtC00LAgPSA4Ow0K0J/QvtC70LXQktCy0L7QtNCwMTAu0J/QvtC70L7QttC10L3QuNC1ID0g0KQu0KLQvtGH0LrQsCg2LCAxMDQpOw0K0J/QvtC70LXQktCy0L7QtNCwMTAu0KjRgNC40YTRgiA9INCkLtCo0YDQuNGE0YIoIk1pY3Jvc29mdCBTYW5zIFNlcmlmIiwgOS43NSwgKTsNClvQn9C+0LvQtdCS0LLQvtC00LAxMD5dDQpbPNCS0LrQu9Cw0LTQutCwMl0NCtCS0LrQu9Cw0LTQutCwMi7QoNC+0LTQuNGC0LXQu9GMID0g0J/QsNC90LXQu9GM0JLQutC70LDQtNC+0LoxOw0K0JLQutC70LDQtNC60LAyLtCi0LXQutGB0YIgPSAiMSI7DQpb0JLQutC70LDQtNC60LAyPl0NCls80J/QvtC70LXQktCy0L7QtNCwMTFdDQrQn9C+0LvQtdCS0LLQvtC00LAxMS7QoNC+0LTQuNGC0LXQu9GMID0g0JLQutC70LDQtNC60LAyOw0K0J/QvtC70LXQktCy0L7QtNCwMTEu0JzQvdC+0LPQvtGB0YLRgNC+0YfQvdGL0LnQoNC10LbQuNC8ID0g0JjRgdGC0LjQvdCwOw0K0J/QvtC70LXQktCy0L7QtNCwMTEu0KDQsNC30LzQtdGAID0g0KQu0KDQsNC30LzQtdGAKDYxNSwgNzMpOw0K0J/QvtC70LXQktCy0L7QtNCwMTEu0J/QvtGA0Y/QtNC+0LrQntCx0YXQvtC00LAgPSAyNjsNCtCf0L7Qu9C10JLQstC+0LTQsDExLtCf0L7Qu9C+0LbQtdC90LjQtSA9INCkLtCi0L7Rh9C60LAoNiwgMTA3KTsNCtCf0L7Qu9C10JLQstC+0LTQsDExLtCo0YDQuNGE0YIgPSDQpC7QqNGA0LjRhNGCKCJNaWNyb3NvZnQgU2FucyBTZXJpZiIsIDkuNzUsICk7DQpb0J/QvtC70LXQktCy0L7QtNCwMTE+XQ0KWzzQndCw0LTQv9C40YHRjDE1XQ0K0J3QsNC00L/QuNGB0YwxNS7QoNC+0LTQuNGC0LXQu9GMID0g0JLQutC70LDQtNC60LAyOw0K0J3QsNC00L/QuNGB0YwxNS7QoNCw0LfQvNC10YAgPSDQpC7QoNCw0LfQvNC10YAoMTAwLCAxNSk7DQrQndCw0LTQv9C40YHRjDE1LtCf0L7RgNGP0LTQvtC60J7QsdGF0L7QtNCwID0gMjU7DQrQndCw0LTQv9C40YHRjDE1LtCf0L7Qu9C+0LbQtdC90LjQtSA9INCkLtCi0L7Rh9C60LAoNiwgODkpOw0K0J3QsNC00L/QuNGB0YwxNS7QotC10LrRgdGCID0gItCe0L/QuNGB0LDQvdC40LUiOw0K0J3QsNC00L/QuNGB0YwxNS7QqNGA0LjRhNGCID0g0KQu0KjRgNC40YTRgigiTWljcm9zb2Z0IFNhbnMgU2VyaWYiLCA5Ljc1LCApOw0KW9Cd0LDQtNC/0LjRgdGMMTU+XQ0KWzzQn9C+0LvQtdCS0YvQsdC+0YDQsDRdDQrQn9C+0LvQtdCS0YvQsdC+0YDQsDQu0KDQvtC00LjRgtC10LvRjCA9INCS0LrQu9Cw0LTQutCwMjsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwNC7QoNCw0LfQvNC10YAgPSDQpC7QoNCw0LfQvNC10YAoNjE1LCAyNCk7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDQu0J/QvtGA0Y/QtNC+0LrQntCx0YXQvtC00LAgPSAyNDsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwNC7QktGL0YHQvtGC0LDQrdC70LXQvNC10L3RgtCwID0gMTY7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDQu0J/QvtC70L7QttC10L3QuNC1ID0g0KQu0KLQvtGH0LrQsCg2LCA2NSk7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDQu0KLQtdC60YHRgiA9ICLQudC50LnQudC50LnQudC50LnQuSAgINC50LnQudC50LnQudC50LnQudC5IjsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwNC7QqNC40YDQuNC90LDQktGL0L/QsNC00LDRjtGJ0LXQs9C+0KHQv9C40YHQutCwID0gNjE1Ow0K0J/QvtC70LXQktGL0LHQvtGA0LA0LtCo0YDQuNGE0YIgPSDQpC7QqNGA0LjRhNGCKCJNaWNyb3NvZnQgU2FucyBTZXJpZiIsIDkuNzUsICk7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDQu0K3Qu9C10LzQtdC90YLRiy7QlNC+0LHQsNCy0LjRgtGMKNCkLtCt0LvQtdC80LXQvdGC0KHQv9C40YHQutCwKCLQotC40L86INCR0YPQu9C10LLQvi4iLCAi0KLQuNC/OiDQkdGD0LvQtdCy0L4uIikpOw0K0J/QvtC70LXQktGL0LHQvtGA0LA0LtCt0LvQtdC80LXQvdGC0Ysu0JTQvtCx0LDQstC40YLRjCjQpC7QrdC70LXQvNC10L3RgtCh0L/QuNGB0LrQsCgi0KLQuNC/OiDQodGC0YDQvtC60LAuIiwgItCi0LjQvzog0KHRgtGA0L7QutCwLiIpKTsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwNC7QrdC70LXQvNC10L3RgtGLLtCU0L7QsdCw0LLQuNGC0Ywo0KQu0K3Qu9C10LzQtdC90YLQodC/0LjRgdC60LAoItCi0LjQvzog0KfQuNGB0LvQvi4iLCAi0KLQuNC/OiDQp9C40YHQu9C+LiIpKTsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwNC7QrdC70LXQvNC10L3RgtGLLtCU0L7QsdCw0LLQuNGC0Ywo0KQu0K3Qu9C10LzQtdC90YLQodC/0LjRgdC60LAoItCi0LjQvzog0J/RgNC+0LjQt9Cy0L7Qu9GM0L3Ri9C5LiIsICLQotC40L86INCf0YDQvtC40LfQstC+0LvRjNC90YvQuS4iKSk7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDQu0K3Qu9C10LzQtdC90YLRiy7QlNC+0LHQsNCy0LjRgtGMKNCkLtCt0LvQtdC80LXQvdGC0KHQv9C40YHQutCwKCLQudC50LnQudC50LnQudC50LnQuSAgINC50LnQudC50LnQudC50LnQudC5IiwgItC50LnQudC50LnQudC50LnQudC5ICAg0LnQudC50LnQudC50LnQudC50LkiKSk7DQpb0J/QvtC70LXQktGL0LHQvtGA0LA0Pl0NCls80J/QvtC70LXQktGL0LHQvtGA0LA1XQ0K0J/QvtC70LXQktGL0LHQvtGA0LA1LtCg0L7QtNC40YLQtdC70YwgPSDQktC60LvQsNC00LrQsDI7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDUu0KDQsNC30LzQtdGAID0g0KQu0KDQsNC30LzQtdGAKDI5NiwgMjQpOw0K0J/QvtC70LXQktGL0LHQvtGA0LA1LtCf0L7RgNGP0LTQvtC60J7QsdGF0L7QtNCwID0gMjM7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDUu0JLRi9GB0L7RgtCw0K3Qu9C10LzQtdC90YLQsCA9IDE2Ow0K0J/QvtC70LXQktGL0LHQvtGA0LA1LtCf0L7Qu9C+0LbQtdC90LjQtSA9INCkLtCi0L7Rh9C60LAoMzI1LCAyMyk7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDUu0KLQtdC60YHRgiA9ICLQvtCx0Y/Qt9Cw0YLQtdC70YzQvdGL0LkiOw0K0J/QvtC70LXQktGL0LHQvtGA0LA1LtCo0LjRgNC40L3QsNCS0YvQv9Cw0LTQsNGO0YnQtdCz0L7QodC/0LjRgdC60LAgPSAyOTY7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDUu0KjRgNC40YTRgiA9INCkLtCo0YDQuNGE0YIoIk1pY3Jvc29mdCBTYW5zIFNlcmlmIiwgOS43NSwgKTsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwNS7QrdC70LXQvNC10L3RgtGLLtCU0L7QsdCw0LLQuNGC0Ywo0KQu0K3Qu9C10LzQtdC90YLQodC/0LjRgdC60LAoItC+0LHRj9C30LDRgtC10LvRjNC90YvQuSIsICLQvtCx0Y/Qt9Cw0YLQtdC70YzQvdGL0LkiKSk7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDUu0K3Qu9C10LzQtdC90YLRiy7QlNC+0LHQsNCy0LjRgtGMKNCkLtCt0LvQtdC80LXQvdGC0KHQv9C40YHQutCwKCLQvdC10L7QsdGP0LfQsNGC0LXQu9GM0L3Ri9C5IiwgItC90LXQvtCx0Y/Qt9Cw0YLQtdC70YzQvdGL0LkiKSk7DQpb0J/QvtC70LXQktGL0LHQvtGA0LA1Pl0NCls80J3QsNC00L/QuNGB0YwxNl0NCtCd0LDQtNC/0LjRgdGMMTYu0KDQvtC00LjRgtC10LvRjCA9INCS0LrQu9Cw0LTQutCwMjsNCtCd0LDQtNC/0LjRgdGMMTYu0KDQsNC30LzQtdGAID0g0KQu0KDQsNC30LzQtdGAKDEwMCwgMTYpOw0K0J3QsNC00L/QuNGB0YwxNi7Qn9C+0YDRj9C00L7QutCe0LHRhdC+0LTQsCA9IDIyOw0K0J3QsNC00L/QuNGB0YwxNi7Qn9C+0LvQvtC20LXQvdC40LUgPSDQpC7QotC+0YfQutCwKDYsIDQ2KTsNCtCd0LDQtNC/0LjRgdGMMTYu0KLQtdC60YHRgiA9ICLQotC40L8iOw0K0J3QsNC00L/QuNGB0YwxNi7QqNGA0LjRhNGCID0g0KQu0KjRgNC40YTRgigiTWljcm9zb2Z0IFNhbnMgU2VyaWYiLCA5Ljc1LCApOw0KW9Cd0LDQtNC/0LjRgdGMMTY+XQ0KWzzQndCw0LTQv9C40YHRjDE3XQ0K0J3QsNC00L/QuNGB0YwxNy7QoNC+0LTQuNGC0LXQu9GMID0g0JLQutC70LDQtNC60LAyOw0K0J3QsNC00L/QuNGB0YwxNy7QoNCw0LfQvNC10YAgPSDQpC7QoNCw0LfQvNC10YAoMTAwLCAxNCk7DQrQndCw0LTQv9C40YHRjDE3LtCf0L7RgNGP0LTQvtC60J7QsdGF0L7QtNCwID0gMjE7DQrQndCw0LTQv9C40YHRjDE3LtCf0L7Qu9C+0LbQtdC90LjQtSA9INCkLtCi0L7Rh9C60LAoMzI1LCA2KTsNCtCd0LDQtNC/0LjRgdGMMTcu0KLQtdC60YHRgiA9ICLQntCx0Y/Qt9Cw0YLQtdC70YzQvdGL0LkiOw0K0J3QsNC00L/QuNGB0YwxNy7QqNGA0LjRhNGCID0g0KQu0KjRgNC40YTRgigiTWljcm9zb2Z0IFNhbnMgU2VyaWYiLCA5Ljc1LCApOw0KW9Cd0LDQtNC/0LjRgdGMMTc+XQ0KWzzQn9C+0LvQtdCS0LLQvtC00LAxMl0NCtCf0L7Qu9C10JLQstC+0LTQsDEyLtCg0L7QtNC40YLQtdC70YwgPSDQktC60LvQsNC00LrQsDI7DQrQn9C+0LvQtdCS0LLQvtC00LAxMi7QoNCw0LfQvNC10YAgPSDQpC7QoNCw0LfQvNC10YAoMjk2LCAyMik7DQrQn9C+0LvQtdCS0LLQvtC00LAxMi7Qn9C+0YDRj9C00L7QutCe0LHRhdC+0LTQsCA9IDIwOw0K0J/QvtC70LXQktCy0L7QtNCwMTIu0J/QvtC70L7QttC10L3QuNC1ID0g0KQu0KLQvtGH0LrQsCg2LCAyMyk7DQrQn9C+0LvQtdCS0LLQvtC00LAxMi7QqNGA0LjRhNGCID0g0KQu0KjRgNC40YTRgigiTWljcm9zb2Z0IFNhbnMgU2VyaWYiLCA5Ljc1LCApOw0KW9Cf0L7Qu9C10JLQstC+0LTQsDEyPl0NCls80J3QsNC00L/QuNGB0YwxOF0NCtCd0LDQtNC/0LjRgdGMMTgu0KDQvtC00LjRgtC10LvRjCA9INCS0LrQu9Cw0LTQutCwMjsNCtCd0LDQtNC/0LjRgdGMMTgu0KDQsNC30LzQtdGAID0g0KQu0KDQsNC30LzQtdGAKDEwMCwgMTQpOw0K0J3QsNC00L/QuNGB0YwxOC7Qn9C+0YDRj9C00L7QutCe0LHRhdC+0LTQsCA9IDE5Ow0K0J3QsNC00L/QuNGB0YwxOC7Qn9C+0LvQvtC20LXQvdC40LUgPSDQpC7QotC+0YfQutCwKDYsIDYpOw0K0J3QsNC00L/QuNGB0YwxOC7QotC10LrRgdGCID0gItCY0LzRjyI7DQrQndCw0LTQv9C40YHRjDE4LtCo0YDQuNGE0YIgPSDQpC7QqNGA0LjRhNGCKCJNaWNyb3NvZnQgU2FucyBTZXJpZiIsIDkuNzUsICk7DQpb0J3QsNC00L/QuNGB0YwxOD5dDQpbPNCS0LrQu9Cw0LTQutCwM10NCtCS0LrQu9Cw0LTQutCwMy7QoNC+0LTQuNGC0LXQu9GMID0g0J/QsNC90LXQu9GM0JLQutC70LDQtNC+0LoxOw0K0JLQutC70LDQtNC60LAzLtCi0LXQutGB0YIgPSAiMiI7DQpb0JLQutC70LDQtNC60LAzPl0NCls80J/QvtC70LXQktCy0L7QtNCwMTNdDQrQn9C+0LvQtdCS0LLQvtC00LAxMy7QoNC+0LTQuNGC0LXQu9GMID0g0JLQutC70LDQtNC60LAzOw0K0J/QvtC70LXQktCy0L7QtNCwMTMu0JzQvdC+0LPQvtGB0YLRgNC+0YfQvdGL0LnQoNC10LbQuNC8ID0g0JjRgdGC0LjQvdCwOw0K0J/QvtC70LXQktCy0L7QtNCwMTMu0KDQsNC30LzQtdGAID0g0KQu0KDQsNC30LzQtdGAKDYxNSwgNzMpOw0K0J/QvtC70LXQktCy0L7QtNCwMTMu0J/QvtGA0Y/QtNC+0LrQntCx0YXQvtC00LAgPSAzNDsNCtCf0L7Qu9C10JLQstC+0LTQsDEzLtCf0L7Qu9C+0LbQtdC90LjQtSA9INCkLtCi0L7Rh9C60LAoMTUsIDExMCk7DQrQn9C+0LvQtdCS0LLQvtC00LAxMy7QqNGA0LjRhNGCID0g0KQu0KjRgNC40YTRgigiTWljcm9zb2Z0IFNhbnMgU2VyaWYiLCA5Ljc1LCApOw0KW9Cf0L7Qu9C10JLQstC+0LTQsDEzPl0NCls80J3QsNC00L/QuNGB0YwxOV0NCtCd0LDQtNC/0LjRgdGMMTku0KDQvtC00LjRgtC10LvRjCA9INCS0LrQu9Cw0LTQutCwMzsNCtCd0LDQtNC/0LjRgdGMMTku0KDQsNC30LzQtdGAID0g0KQu0KDQsNC30LzQtdGAKDEwMCwgMTUpOw0K0J3QsNC00L/QuNGB0YwxOS7Qn9C+0YDRj9C00L7QutCe0LHRhdC+0LTQsCA9IDMzOw0K0J3QsNC00L/QuNGB0YwxOS7Qn9C+0LvQvtC20LXQvdC40LUgPSDQpC7QotC+0YfQutCwKDE1LCA5Mik7DQrQndCw0LTQv9C40YHRjDE5LtCi0LXQutGB0YIgPSAi0J7Qv9C40YHQsNC90LjQtSI7DQrQndCw0LTQv9C40YHRjDE5LtCo0YDQuNGE0YIgPSDQpC7QqNGA0LjRhNGCKCJNaWNyb3NvZnQgU2FucyBTZXJpZiIsIDkuNzUsICk7DQpb0J3QsNC00L/QuNGB0YwxOT5dDQpbPNCf0L7Qu9C10JLRi9Cx0L7RgNCwNl0NCtCf0L7Qu9C10JLRi9Cx0L7RgNCwNi7QoNC+0LTQuNGC0LXQu9GMID0g0JLQutC70LDQtNC60LAzOw0K0J/QvtC70LXQktGL0LHQvtGA0LA2LtCg0LDQt9C80LXRgCA9INCkLtCg0LDQt9C80LXRgCg2MTUsIDI0KTsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwNi7Qn9C+0YDRj9C00L7QutCe0LHRhdC+0LTQsCA9IDMyOw0K0J/QvtC70LXQktGL0LHQvtGA0LA2LtCS0YvRgdC+0YLQsNCt0LvQtdC80LXQvdGC0LAgPSAxNjsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwNi7Qn9C+0LvQvtC20LXQvdC40LUgPSDQpC7QotC+0YfQutCwKDE1LCA2OCk7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDYu0KLQtdC60YHRgiA9ICLQudC50LnQudC50LnQudC50LnQuSAgINC50LnQudC50LnQudC50LnQudC5IjsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwNi7QqNC40YDQuNC90LDQktGL0L/QsNC00LDRjtGJ0LXQs9C+0KHQv9C40YHQutCwID0gNjE1Ow0K0J/QvtC70LXQktGL0LHQvtGA0LA2LtCo0YDQuNGE0YIgPSDQpC7QqNGA0LjRhNGCKCJNaWNyb3NvZnQgU2FucyBTZXJpZiIsIDkuNzUsICk7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDYu0K3Qu9C10LzQtdC90YLRiy7QlNC+0LHQsNCy0LjRgtGMKNCkLtCt0LvQtdC80LXQvdGC0KHQv9C40YHQutCwKCLQotC40L86INCR0YPQu9C10LLQvi4iLCAi0KLQuNC/OiDQkdGD0LvQtdCy0L4uIikpOw0K0J/QvtC70LXQktGL0LHQvtGA0LA2LtCt0LvQtdC80LXQvdGC0Ysu0JTQvtCx0LDQstC40YLRjCjQpC7QrdC70LXQvNC10L3RgtCh0L/QuNGB0LrQsCgi0KLQuNC/OiDQodGC0YDQvtC60LAuIiwgItCi0LjQvzog0KHRgtGA0L7QutCwLiIpKTsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwNi7QrdC70LXQvNC10L3RgtGLLtCU0L7QsdCw0LLQuNGC0Ywo0KQu0K3Qu9C10LzQtdC90YLQodC/0LjRgdC60LAoItCi0LjQvzog0KfQuNGB0LvQvi4iLCAi0KLQuNC/OiDQp9C40YHQu9C+LiIpKTsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwNi7QrdC70LXQvNC10L3RgtGLLtCU0L7QsdCw0LLQuNGC0Ywo0KQu0K3Qu9C10LzQtdC90YLQodC/0LjRgdC60LAoItCi0LjQvzog0J/RgNC+0LjQt9Cy0L7Qu9GM0L3Ri9C5LiIsICLQotC40L86INCf0YDQvtC40LfQstC+0LvRjNC90YvQuS4iKSk7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDYu0K3Qu9C10LzQtdC90YLRiy7QlNC+0LHQsNCy0LjRgtGMKNCkLtCt0LvQtdC80LXQvdGC0KHQv9C40YHQutCwKCLQudC50LnQudC50LnQudC50LnQuSAgINC50LnQudC50LnQudC50LnQudC5IiwgItC50LnQudC50LnQudC50LnQudC5ICAg0LnQudC50LnQudC50LnQudC50LkiKSk7DQpb0J/QvtC70LXQktGL0LHQvtGA0LA2Pl0NCls80J/QvtC70LXQktGL0LHQvtGA0LA3XQ0K0J/QvtC70LXQktGL0LHQvtGA0LA3LtCg0L7QtNC40YLQtdC70YwgPSDQktC60LvQsNC00LrQsDM7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDcu0KDQsNC30LzQtdGAID0g0KQu0KDQsNC30LzQtdGAKDI5NiwgMjQpOw0K0J/QvtC70LXQktGL0LHQvtGA0LA3LtCf0L7RgNGP0LTQvtC60J7QsdGF0L7QtNCwID0gMzE7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDcu0JLRi9GB0L7RgtCw0K3Qu9C10LzQtdC90YLQsCA9IDE2Ow0K0J/QvtC70LXQktGL0LHQvtGA0LA3LtCf0L7Qu9C+0LbQtdC90LjQtSA9INCkLtCi0L7Rh9C60LAoMzM0LCAyNik7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDcu0KLQtdC60YHRgiA9ICLQvtCx0Y/Qt9Cw0YLQtdC70YzQvdGL0LkiOw0K0J/QvtC70LXQktGL0LHQvtGA0LA3LtCo0LjRgNC40L3QsNCS0YvQv9Cw0LTQsNGO0YnQtdCz0L7QodC/0LjRgdC60LAgPSAyOTY7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDcu0KjRgNC40YTRgiA9INCkLtCo0YDQuNGE0YIoIk1pY3Jvc29mdCBTYW5zIFNlcmlmIiwgOS43NSwgKTsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwNy7QrdC70LXQvNC10L3RgtGLLtCU0L7QsdCw0LLQuNGC0Ywo0KQu0K3Qu9C10LzQtdC90YLQodC/0LjRgdC60LAoItC+0LHRj9C30LDRgtC10LvRjNC90YvQuSIsICLQvtCx0Y/Qt9Cw0YLQtdC70YzQvdGL0LkiKSk7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDcu0K3Qu9C10LzQtdC90YLRiy7QlNC+0LHQsNCy0LjRgtGMKNCkLtCt0LvQtdC80LXQvdGC0KHQv9C40YHQutCwKCLQvdC10L7QsdGP0LfQsNGC0LXQu9GM0L3Ri9C5IiwgItC90LXQvtCx0Y/Qt9Cw0YLQtdC70YzQvdGL0LkiKSk7DQpb0J/QvtC70LXQktGL0LHQvtGA0LA3Pl0NCls80J3QsNC00L/QuNGB0YwyMF0NCtCd0LDQtNC/0LjRgdGMMjAu0KDQvtC00LjRgtC10LvRjCA9INCS0LrQu9Cw0LTQutCwMzsNCtCd0LDQtNC/0LjRgdGMMjAu0KDQsNC30LzQtdGAID0g0KQu0KDQsNC30LzQtdGAKDEwMCwgMTYpOw0K0J3QsNC00L/QuNGB0YwyMC7Qn9C+0YDRj9C00L7QutCe0LHRhdC+0LTQsCA9IDMwOw0K0J3QsNC00L/QuNGB0YwyMC7Qn9C+0LvQvtC20LXQvdC40LUgPSDQpC7QotC+0YfQutCwKDE1LCA0OSk7DQrQndCw0LTQv9C40YHRjDIwLtCi0LXQutGB0YIgPSAi0KLQuNC/IjsNCtCd0LDQtNC/0LjRgdGMMjAu0KjRgNC40YTRgiA9INCkLtCo0YDQuNGE0YIoIk1pY3Jvc29mdCBTYW5zIFNlcmlmIiwgOS43NSwgKTsNClvQndCw0LTQv9C40YHRjDIwPl0NCls80J3QsNC00L/QuNGB0YwyMV0NCtCd0LDQtNC/0LjRgdGMMjEu0KDQvtC00LjRgtC10LvRjCA9INCS0LrQu9Cw0LTQutCwMzsNCtCd0LDQtNC/0LjRgdGMMjEu0KDQsNC30LzQtdGAID0g0KQu0KDQsNC30LzQtdGAKDEwMCwgMTQpOw0K0J3QsNC00L/QuNGB0YwyMS7Qn9C+0YDRj9C00L7QutCe0LHRhdC+0LTQsCA9IDI5Ow0K0J3QsNC00L/QuNGB0YwyMS7Qn9C+0LvQvtC20LXQvdC40LUgPSDQpC7QotC+0YfQutCwKDMzNCwgOSk7DQrQndCw0LTQv9C40YHRjDIxLtCi0LXQutGB0YIgPSAi0J7QsdGP0LfQsNGC0LXQu9GM0L3Ri9C5IjsNCtCd0LDQtNC/0LjRgdGMMjEu0KjRgNC40YTRgiA9INCkLtCo0YDQuNGE0YIoIk1pY3Jvc29mdCBTYW5zIFNlcmlmIiwgOS43NSwgKTsNClvQndCw0LTQv9C40YHRjDIxPl0NCls80J/QvtC70LXQktCy0L7QtNCwMTRdDQrQn9C+0LvQtdCS0LLQvtC00LAxNC7QoNC+0LTQuNGC0LXQu9GMID0g0JLQutC70LDQtNC60LAzOw0K0J/QvtC70LXQktCy0L7QtNCwMTQu0KDQsNC30LzQtdGAID0g0KQu0KDQsNC30LzQtdGAKDI5NiwgMjIpOw0K0J/QvtC70LXQktCy0L7QtNCwMTQu0J/QvtGA0Y/QtNC+0LrQntCx0YXQvtC00LAgPSAyODsNCtCf0L7Qu9C10JLQstC+0LTQsDE0LtCf0L7Qu9C+0LbQtdC90LjQtSA9INCkLtCi0L7Rh9C60LAoMTUsIDI2KTsNCtCf0L7Qu9C10JLQstC+0LTQsDE0LtCo0YDQuNGE0YIgPSDQpC7QqNGA0LjRhNGCKCJNaWNyb3NvZnQgU2FucyBTZXJpZiIsIDkuNzUsICk7DQpb0J/QvtC70LXQktCy0L7QtNCwMTQ+XQ0KWzzQndCw0LTQv9C40YHRjDIyXQ0K0J3QsNC00L/QuNGB0YwyMi7QoNC+0LTQuNGC0LXQu9GMID0g0JLQutC70LDQtNC60LAzOw0K0J3QsNC00L/QuNGB0YwyMi7QoNCw0LfQvNC10YAgPSDQpC7QoNCw0LfQvNC10YAoMTAwLCAxNCk7DQrQndCw0LTQv9C40YHRjDIyLtCf0L7RgNGP0LTQvtC60J7QsdGF0L7QtNCwID0gMjc7DQrQndCw0LTQv9C40YHRjDIyLtCf0L7Qu9C+0LbQtdC90LjQtSA9INCkLtCi0L7Rh9C60LAoMTUsIDkpOw0K0J3QsNC00L/QuNGB0YwyMi7QotC10LrRgdGCID0gItCY0LzRjyI7DQrQndCw0LTQv9C40YHRjDIyLtCo0YDQuNGE0YIgPSDQpC7QqNGA0LjRhNGCKCJNaWNyb3NvZnQgU2FucyBTZXJpZiIsIDkuNzUsICk7DQpb0J3QsNC00L/QuNGB0YwyMj5dDQpbPNCS0LrQu9Cw0LTQutCwNF0NCtCS0LrQu9Cw0LTQutCwNC7QoNC+0LTQuNGC0LXQu9GMID0g0J/QsNC90LXQu9GM0JLQutC70LDQtNC+0LoxOw0K0JLQutC70LDQtNC60LA0LtCi0LXQutGB0YIgPSAiMyI7DQpb0JLQutC70LDQtNC60LA0Pl0NCls80J/QvtC70LXQktCy0L7QtNCwMTVdDQrQn9C+0LvQtdCS0LLQvtC00LAxNS7QoNC+0LTQuNGC0LXQu9GMID0g0JLQutC70LDQtNC60LA0Ow0K0J/QvtC70LXQktCy0L7QtNCwMTUu0JzQvdC+0LPQvtGB0YLRgNC+0YfQvdGL0LnQoNC10LbQuNC8ID0g0JjRgdGC0LjQvdCwOw0K0J/QvtC70LXQktCy0L7QtNCwMTUu0KDQsNC30LzQtdGAID0g0KQu0KDQsNC30LzQtdGAKDYxNSwgNzMpOw0K0J/QvtC70LXQktCy0L7QtNCwMTUu0J/QvtGA0Y/QtNC+0LrQntCx0YXQvtC00LAgPSA0MjsNCtCf0L7Qu9C10JLQstC+0LTQsDE1LtCf0L7Qu9C+0LbQtdC90LjQtSA9INCkLtCi0L7Rh9C60LAoMTgsIDExMCk7DQrQn9C+0LvQtdCS0LLQvtC00LAxNS7QqNGA0LjRhNGCID0g0KQu0KjRgNC40YTRgigiTWljcm9zb2Z0IFNhbnMgU2VyaWYiLCA5Ljc1LCApOw0KW9Cf0L7Qu9C10JLQstC+0LTQsDE1Pl0NCls80J3QsNC00L/QuNGB0YwyM10NCtCd0LDQtNC/0LjRgdGMMjMu0KDQvtC00LjRgtC10LvRjCA9INCS0LrQu9Cw0LTQutCwNDsNCtCd0LDQtNC/0LjRgdGMMjMu0KDQsNC30LzQtdGAID0g0KQu0KDQsNC30LzQtdGAKDEwMCwgMTUpOw0K0J3QsNC00L/QuNGB0YwyMy7Qn9C+0YDRj9C00L7QutCe0LHRhdC+0LTQsCA9IDQxOw0K0J3QsNC00L/QuNGB0YwyMy7Qn9C+0LvQvtC20LXQvdC40LUgPSDQpC7QotC+0YfQutCwKDE4LCA5Mik7DQrQndCw0LTQv9C40YHRjDIzLtCi0LXQutGB0YIgPSAi0J7Qv9C40YHQsNC90LjQtSI7DQrQndCw0LTQv9C40YHRjDIzLtCo0YDQuNGE0YIgPSDQpC7QqNGA0LjRhNGCKCJNaWNyb3NvZnQgU2FucyBTZXJpZiIsIDkuNzUsICk7DQpb0J3QsNC00L/QuNGB0YwyMz5dDQpbPNCd0LDQtNC/0LjRgdGMMjRdDQrQndCw0LTQv9C40YHRjDI0LtCg0L7QtNC40YLQtdC70YwgPSDQktC60LvQsNC00LrQsDQ7DQrQndCw0LTQv9C40YHRjDI0LtCg0LDQt9C80LXRgCA9INCkLtCg0LDQt9C80LXRgCgxMDAsIDE0KTsNCtCd0LDQtNC/0LjRgdGMMjQu0J/QvtGA0Y/QtNC+0LrQntCx0YXQvtC00LAgPSAzNTsNCtCd0LDQtNC/0LjRgdGMMjQu0J/QvtC70L7QttC10L3QuNC1ID0g0KQu0KLQvtGH0LrQsCgxOCwgOSk7DQrQndCw0LTQv9C40YHRjDI0LtCi0LXQutGB0YIgPSAi0JjQvNGPIjsNCtCd0LDQtNC/0LjRgdGMMjQu0KjRgNC40YTRgiA9INCkLtCo0YDQuNGE0YIoIk1pY3Jvc29mdCBTYW5zIFNlcmlmIiwgOS43NSwgKTsNClvQndCw0LTQv9C40YHRjDI0Pl0NCls80J/QvtC70LXQktGL0LHQvtGA0LA4XQ0K0J/QvtC70LXQktGL0LHQvtGA0LA4LtCg0L7QtNC40YLQtdC70YwgPSDQktC60LvQsNC00LrQsDQ7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDgu0KDQsNC30LzQtdGAID0g0KQu0KDQsNC30LzQtdGAKDYxNSwgMjQpOw0K0J/QvtC70LXQktGL0LHQvtGA0LA4LtCf0L7RgNGP0LTQvtC60J7QsdGF0L7QtNCwID0gNDA7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDgu0JLRi9GB0L7RgtCw0K3Qu9C10LzQtdC90YLQsCA9IDE2Ow0K0J/QvtC70LXQktGL0LHQvtGA0LA4LtCf0L7Qu9C+0LbQtdC90LjQtSA9INCkLtCi0L7Rh9C60LAoMTgsIDY4KTsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwOC7QotC10LrRgdGCID0gItC50LnQudC50LnQudC50LnQudC5ICAg0LnQudC50LnQudC50LnQudC50LkiOw0K0J/QvtC70LXQktGL0LHQvtGA0LA4LtCo0LjRgNC40L3QsNCS0YvQv9Cw0LTQsNGO0YnQtdCz0L7QodC/0LjRgdC60LAgPSA2MTU7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDgu0KjRgNC40YTRgiA9INCkLtCo0YDQuNGE0YIoIk1pY3Jvc29mdCBTYW5zIFNlcmlmIiwgOS43NSwgKTsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwOC7QrdC70LXQvNC10L3RgtGLLtCU0L7QsdCw0LLQuNGC0Ywo0KQu0K3Qu9C10LzQtdC90YLQodC/0LjRgdC60LAoItCi0LjQvzog0JHRg9C70LXQstC+LiIsICLQotC40L86INCR0YPQu9C10LLQvi4iKSk7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDgu0K3Qu9C10LzQtdC90YLRiy7QlNC+0LHQsNCy0LjRgtGMKNCkLtCt0LvQtdC80LXQvdGC0KHQv9C40YHQutCwKCLQotC40L86INCh0YLRgNC+0LrQsC4iLCAi0KLQuNC/OiDQodGC0YDQvtC60LAuIikpOw0K0J/QvtC70LXQktGL0LHQvtGA0LA4LtCt0LvQtdC80LXQvdGC0Ysu0JTQvtCx0LDQstC40YLRjCjQpC7QrdC70LXQvNC10L3RgtCh0L/QuNGB0LrQsCgi0KLQuNC/OiDQp9C40YHQu9C+LiIsICLQotC40L86INCn0LjRgdC70L4uIikpOw0K0J/QvtC70LXQktGL0LHQvtGA0LA4LtCt0LvQtdC80LXQvdGC0Ysu0JTQvtCx0LDQstC40YLRjCjQpC7QrdC70LXQvNC10L3RgtCh0L/QuNGB0LrQsCgi0KLQuNC/OiDQn9GA0L7QuNC30LLQvtC70YzQvdGL0LkuIiwgItCi0LjQvzog0J/RgNC+0LjQt9Cy0L7Qu9GM0L3Ri9C5LiIpKTsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwOC7QrdC70LXQvNC10L3RgtGLLtCU0L7QsdCw0LLQuNGC0Ywo0KQu0K3Qu9C10LzQtdC90YLQodC/0LjRgdC60LAoItC50LnQudC50LnQudC50LnQudC5ICAg0LnQudC50LnQudC50LnQudC50LkiLCAi0LnQudC50LnQudC50LnQudC50LkgICDQudC50LnQudC50LnQudC50LnQuSIpKTsNClvQn9C+0LvQtdCS0YvQsdC+0YDQsDg+XQ0KWzzQn9C+0LvQtdCS0LLQvtC00LAxNl0NCtCf0L7Qu9C10JLQstC+0LTQsDE2LtCg0L7QtNC40YLQtdC70YwgPSDQktC60LvQsNC00LrQsDQ7DQrQn9C+0LvQtdCS0LLQvtC00LAxNi7QoNCw0LfQvNC10YAgPSDQpC7QoNCw0LfQvNC10YAoMjk2LCAyMik7DQrQn9C+0LvQtdCS0LLQvtC00LAxNi7Qn9C+0YDRj9C00L7QutCe0LHRhdC+0LTQsCA9IDM2Ow0K0J/QvtC70LXQktCy0L7QtNCwMTYu0J/QvtC70L7QttC10L3QuNC1ID0g0KQu0KLQvtGH0LrQsCgxOCwgMjYpOw0K0J/QvtC70LXQktCy0L7QtNCwMTYu0KjRgNC40YTRgiA9INCkLtCo0YDQuNGE0YIoIk1pY3Jvc29mdCBTYW5zIFNlcmlmIiwgOS43NSwgKTsNClvQn9C+0LvQtdCS0LLQvtC00LAxNj5dDQpbPNCf0L7Qu9C10JLRi9Cx0L7RgNCwOV0NCtCf0L7Qu9C10JLRi9Cx0L7RgNCwOS7QoNC+0LTQuNGC0LXQu9GMID0g0JLQutC70LDQtNC60LA0Ow0K0J/QvtC70LXQktGL0LHQvtGA0LA5LtCg0LDQt9C80LXRgCA9INCkLtCg0LDQt9C80LXRgCgyOTYsIDI0KTsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwOS7Qn9C+0YDRj9C00L7QutCe0LHRhdC+0LTQsCA9IDM5Ow0K0J/QvtC70LXQktGL0LHQvtGA0LA5LtCS0YvRgdC+0YLQsNCt0LvQtdC80LXQvdGC0LAgPSAxNjsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwOS7Qn9C+0LvQvtC20LXQvdC40LUgPSDQpC7QotC+0YfQutCwKDMzNywgMjYpOw0K0J/QvtC70LXQktGL0LHQvtGA0LA5LtCi0LXQutGB0YIgPSAi0L7QsdGP0LfQsNGC0LXQu9GM0L3Ri9C5IjsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwOS7QqNC40YDQuNC90LDQktGL0L/QsNC00LDRjtGJ0LXQs9C+0KHQv9C40YHQutCwID0gMjk2Ow0K0J/QvtC70LXQktGL0LHQvtGA0LA5LtCo0YDQuNGE0YIgPSDQpC7QqNGA0LjRhNGCKCJNaWNyb3NvZnQgU2FucyBTZXJpZiIsIDkuNzUsICk7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDku0K3Qu9C10LzQtdC90YLRiy7QlNC+0LHQsNCy0LjRgtGMKNCkLtCt0LvQtdC80LXQvdGC0KHQv9C40YHQutCwKCLQvtCx0Y/Qt9Cw0YLQtdC70YzQvdGL0LkiLCAi0L7QsdGP0LfQsNGC0LXQu9GM0L3Ri9C5IikpOw0K0J/QvtC70LXQktGL0LHQvtGA0LA5LtCt0LvQtdC80LXQvdGC0Ysu0JTQvtCx0LDQstC40YLRjCjQpC7QrdC70LXQvNC10L3RgtCh0L/QuNGB0LrQsCgi0L3QtdC+0LHRj9C30LDRgtC10LvRjNC90YvQuSIsICLQvdC10L7QsdGP0LfQsNGC0LXQu9GM0L3Ri9C5IikpOw0KW9Cf0L7Qu9C10JLRi9Cx0L7RgNCwOT5dDQpbPNCd0LDQtNC/0LjRgdGMMjVdDQrQndCw0LTQv9C40YHRjDI1LtCg0L7QtNC40YLQtdC70YwgPSDQktC60LvQsNC00LrQsDQ7DQrQndCw0LTQv9C40YHRjDI1LtCg0LDQt9C80LXRgCA9INCkLtCg0LDQt9C80LXRgCgxMDAsIDE0KTsNCtCd0LDQtNC/0LjRgdGMMjUu0J/QvtGA0Y/QtNC+0LrQntCx0YXQvtC00LAgPSAzNzsNCtCd0LDQtNC/0LjRgdGMMjUu0J/QvtC70L7QttC10L3QuNC1ID0g0KQu0KLQvtGH0LrQsCgzMzcsIDkpOw0K0J3QsNC00L/QuNGB0YwyNS7QotC10LrRgdGCID0gItCe0LHRj9C30LDRgtC10LvRjNC90YvQuSI7DQrQndCw0LTQv9C40YHRjDI1LtCo0YDQuNGE0YIgPSDQpC7QqNGA0LjRhNGCKCJNaWNyb3NvZnQgU2FucyBTZXJpZiIsIDkuNzUsICk7DQpb0J3QsNC00L/QuNGB0YwyNT5dDQpbPNCd0LDQtNC/0LjRgdGMMjZdDQrQndCw0LTQv9C40YHRjDI2LtCg0L7QtNC40YLQtdC70YwgPSDQktC60LvQsNC00LrQsDQ7DQrQndCw0LTQv9C40YHRjDI2LtCg0LDQt9C80LXRgCA9INCkLtCg0LDQt9C80LXRgCgxMDAsIDE2KTsNCtCd0LDQtNC/0LjRgdGMMjYu0J/QvtGA0Y/QtNC+0LrQntCx0YXQvtC00LAgPSAzODsNCtCd0LDQtNC/0LjRgdGMMjYu0J/QvtC70L7QttC10L3QuNC1ID0g0KQu0KLQvtGH0LrQsCgxOCwgNDkpOw0K0J3QsNC00L/QuNGB0YwyNi7QotC10LrRgdGCID0gItCi0LjQvyI7DQrQndCw0LTQv9C40YHRjDI2LtCo0YDQuNGE0YIgPSDQpC7QqNGA0LjRhNGCKCJNaWNyb3NvZnQgU2FucyBTZXJpZiIsIDkuNzUsICk7DQpb0J3QsNC00L/QuNGB0YwyNj5dDQpbPNCS0LrQu9Cw0LTQutCwNV0NCtCS0LrQu9Cw0LTQutCwNS7QoNC+0LTQuNGC0LXQu9GMID0g0J/QsNC90LXQu9GM0JLQutC70LDQtNC+0LoxOw0K0JLQutC70LDQtNC60LA1LtCi0LXQutGB0YIgPSAiNCI7DQpb0JLQutC70LDQtNC60LA1Pl0NCls80J/QvtC70LXQktCy0L7QtNCwMTddDQrQn9C+0LvQtdCS0LLQvtC00LAxNy7QoNC+0LTQuNGC0LXQu9GMID0g0JLQutC70LDQtNC60LA1Ow0K0J/QvtC70LXQktCy0L7QtNCwMTcu0JzQvdC+0LPQvtGB0YLRgNC+0YfQvdGL0LnQoNC10LbQuNC8ID0g0JjRgdGC0LjQvdCwOw0K0J/QvtC70LXQktCy0L7QtNCwMTcu0KDQsNC30LzQtdGAID0g0KQu0KDQsNC30LzQtdGAKDYxNSwgNzMpOw0K0J/QvtC70LXQktCy0L7QtNCwMTcu0J/QvtGA0Y/QtNC+0LrQntCx0YXQvtC00LAgPSA0MjsNCtCf0L7Qu9C10JLQstC+0LTQsDE3LtCf0L7Qu9C+0LbQtdC90LjQtSA9INCkLtCi0L7Rh9C60LAoMTcsIDExMCk7DQrQn9C+0LvQtdCS0LLQvtC00LAxNy7QqNGA0LjRhNGCID0g0KQu0KjRgNC40YTRgigiTWljcm9zb2Z0IFNhbnMgU2VyaWYiLCA5Ljc1LCApOw0KW9Cf0L7Qu9C10JLQstC+0LTQsDE3Pl0NCls80J3QsNC00L/QuNGB0YwyN10NCtCd0LDQtNC/0LjRgdGMMjcu0KDQvtC00LjRgtC10LvRjCA9INCS0LrQu9Cw0LTQutCwNTsNCtCd0LDQtNC/0LjRgdGMMjcu0KDQsNC30LzQtdGAID0g0KQu0KDQsNC30LzQtdGAKDEwMCwgMTUpOw0K0J3QsNC00L/QuNGB0YwyNy7Qn9C+0YDRj9C00L7QutCe0LHRhdC+0LTQsCA9IDQxOw0K0J3QsNC00L/QuNGB0YwyNy7Qn9C+0LvQvtC20LXQvdC40LUgPSDQpC7QotC+0YfQutCwKDE3LCA5Mik7DQrQndCw0LTQv9C40YHRjDI3LtCi0LXQutGB0YIgPSAi0J7Qv9C40YHQsNC90LjQtSI7DQrQndCw0LTQv9C40YHRjDI3LtCo0YDQuNGE0YIgPSDQpC7QqNGA0LjRhNGCKCJNaWNyb3NvZnQgU2FucyBTZXJpZiIsIDkuNzUsICk7DQpb0J3QsNC00L/QuNGB0YwyNz5dDQpbPNCd0LDQtNC/0LjRgdGMMjhdDQrQndCw0LTQv9C40YHRjDI4LtCg0L7QtNC40YLQtdC70YwgPSDQktC60LvQsNC00LrQsDU7DQrQndCw0LTQv9C40YHRjDI4LtCg0LDQt9C80LXRgCA9INCkLtCg0LDQt9C80LXRgCgxMDAsIDE0KTsNCtCd0LDQtNC/0LjRgdGMMjgu0J/QvtGA0Y/QtNC+0LrQntCx0YXQvtC00LAgPSAzNTsNCtCd0LDQtNC/0LjRgdGMMjgu0J/QvtC70L7QttC10L3QuNC1ID0g0KQu0KLQvtGH0LrQsCgxNywgOSk7DQrQndCw0LTQv9C40YHRjDI4LtCi0LXQutGB0YIgPSAi0JjQvNGPIjsNCtCd0LDQtNC/0LjRgdGMMjgu0KjRgNC40YTRgiA9INCkLtCo0YDQuNGE0YIoIk1pY3Jvc29mdCBTYW5zIFNlcmlmIiwgOS43NSwgKTsNClvQndCw0LTQv9C40YHRjDI4Pl0NCls80J/QvtC70LXQktGL0LHQvtGA0LAxMF0NCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMTAu0KDQvtC00LjRgtC10LvRjCA9INCS0LrQu9Cw0LTQutCwNTsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMTAu0KDQsNC30LzQtdGAID0g0KQu0KDQsNC30LzQtdGAKDYxNSwgMjQpOw0K0J/QvtC70LXQktGL0LHQvtGA0LAxMC7Qn9C+0YDRj9C00L7QutCe0LHRhdC+0LTQsCA9IDQwOw0K0J/QvtC70LXQktGL0LHQvtGA0LAxMC7QktGL0YHQvtGC0LDQrdC70LXQvNC10L3RgtCwID0gMTY7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDEwLtCf0L7Qu9C+0LbQtdC90LjQtSA9INCkLtCi0L7Rh9C60LAoMTcsIDY4KTsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMTAu0KLQtdC60YHRgiA9ICLQudC50LnQudC50LnQudC50LnQuSAgINC50LnQudC50LnQudC50LnQudC5IjsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMTAu0KjQuNGA0LjQvdCw0JLRi9C/0LDQtNCw0Y7RidC10LPQvtCh0L/QuNGB0LrQsCA9IDYxNTsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMTAu0KjRgNC40YTRgiA9INCkLtCo0YDQuNGE0YIoIk1pY3Jvc29mdCBTYW5zIFNlcmlmIiwgOS43NSwgKTsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMTAu0K3Qu9C10LzQtdC90YLRiy7QlNC+0LHQsNCy0LjRgtGMKNCkLtCt0LvQtdC80LXQvdGC0KHQv9C40YHQutCwKCLQotC40L86INCR0YPQu9C10LLQvi4iLCAi0KLQuNC/OiDQkdGD0LvQtdCy0L4uIikpOw0K0J/QvtC70LXQktGL0LHQvtGA0LAxMC7QrdC70LXQvNC10L3RgtGLLtCU0L7QsdCw0LLQuNGC0Ywo0KQu0K3Qu9C10LzQtdC90YLQodC/0LjRgdC60LAoItCi0LjQvzog0KHRgtGA0L7QutCwLiIsICLQotC40L86INCh0YLRgNC+0LrQsC4iKSk7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDEwLtCt0LvQtdC80LXQvdGC0Ysu0JTQvtCx0LDQstC40YLRjCjQpC7QrdC70LXQvNC10L3RgtCh0L/QuNGB0LrQsCgi0KLQuNC/OiDQp9C40YHQu9C+LiIsICLQotC40L86INCn0LjRgdC70L4uIikpOw0K0J/QvtC70LXQktGL0LHQvtGA0LAxMC7QrdC70LXQvNC10L3RgtGLLtCU0L7QsdCw0LLQuNGC0Ywo0KQu0K3Qu9C10LzQtdC90YLQodC/0LjRgdC60LAoItCi0LjQvzog0J/RgNC+0LjQt9Cy0L7Qu9GM0L3Ri9C5LiIsICLQotC40L86INCf0YDQvtC40LfQstC+0LvRjNC90YvQuS4iKSk7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDEwLtCt0LvQtdC80LXQvdGC0Ysu0JTQvtCx0LDQstC40YLRjCjQpC7QrdC70LXQvNC10L3RgtCh0L/QuNGB0LrQsCgi0LnQudC50LnQudC50LnQudC50LkgICDQudC50LnQudC50LnQudC50LnQuSIsICLQudC50LnQudC50LnQudC50LnQuSAgINC50LnQudC50LnQudC50LnQudC5IikpOw0KW9Cf0L7Qu9C10JLRi9Cx0L7RgNCwMTA+XQ0KWzzQn9C+0LvQtdCS0LLQvtC00LAxOF0NCtCf0L7Qu9C10JLQstC+0LTQsDE4LtCg0L7QtNC40YLQtdC70YwgPSDQktC60LvQsNC00LrQsDU7DQrQn9C+0LvQtdCS0LLQvtC00LAxOC7QoNCw0LfQvNC10YAgPSDQpC7QoNCw0LfQvNC10YAoMjk2LCAyMik7DQrQn9C+0LvQtdCS0LLQvtC00LAxOC7Qn9C+0YDRj9C00L7QutCe0LHRhdC+0LTQsCA9IDM2Ow0K0J/QvtC70LXQktCy0L7QtNCwMTgu0J/QvtC70L7QttC10L3QuNC1ID0g0KQu0KLQvtGH0LrQsCgxNywgMjYpOw0K0J/QvtC70LXQktCy0L7QtNCwMTgu0KjRgNC40YTRgiA9INCkLtCo0YDQuNGE0YIoIk1pY3Jvc29mdCBTYW5zIFNlcmlmIiwgOS43NSwgKTsNClvQn9C+0LvQtdCS0LLQvtC00LAxOD5dDQpbPNCf0L7Qu9C10JLRi9Cx0L7RgNCwMTFdDQrQn9C+0LvQtdCS0YvQsdC+0YDQsDExLtCg0L7QtNC40YLQtdC70YwgPSDQktC60LvQsNC00LrQsDU7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDExLtCg0LDQt9C80LXRgCA9INCkLtCg0LDQt9C80LXRgCgyOTYsIDI0KTsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMTEu0J/QvtGA0Y/QtNC+0LrQntCx0YXQvtC00LAgPSAzOTsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMTEu0JLRi9GB0L7RgtCw0K3Qu9C10LzQtdC90YLQsCA9IDE2Ow0K0J/QvtC70LXQktGL0LHQvtGA0LAxMS7Qn9C+0LvQvtC20LXQvdC40LUgPSDQpC7QotC+0YfQutCwKDMzNiwgMjYpOw0K0J/QvtC70LXQktGL0LHQvtGA0LAxMS7QotC10LrRgdGCID0gItC+0LHRj9C30LDRgtC10LvRjNC90YvQuSI7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDExLtCo0LjRgNC40L3QsNCS0YvQv9Cw0LTQsNGO0YnQtdCz0L7QodC/0LjRgdC60LAgPSAyOTY7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDExLtCo0YDQuNGE0YIgPSDQpC7QqNGA0LjRhNGCKCJNaWNyb3NvZnQgU2FucyBTZXJpZiIsIDkuNzUsICk7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDExLtCt0LvQtdC80LXQvdGC0Ysu0JTQvtCx0LDQstC40YLRjCjQpC7QrdC70LXQvNC10L3RgtCh0L/QuNGB0LrQsCgi0L7QsdGP0LfQsNGC0LXQu9GM0L3Ri9C5IiwgItC+0LHRj9C30LDRgtC10LvRjNC90YvQuSIpKTsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMTEu0K3Qu9C10LzQtdC90YLRiy7QlNC+0LHQsNCy0LjRgtGMKNCkLtCt0LvQtdC80LXQvdGC0KHQv9C40YHQutCwKCLQvdC10L7QsdGP0LfQsNGC0LXQu9GM0L3Ri9C5IiwgItC90LXQvtCx0Y/Qt9Cw0YLQtdC70YzQvdGL0LkiKSk7DQpb0J/QvtC70LXQktGL0LHQvtGA0LAxMT5dDQpbPNCd0LDQtNC/0LjRgdGMMjldDQrQndCw0LTQv9C40YHRjDI5LtCg0L7QtNC40YLQtdC70YwgPSDQktC60LvQsNC00LrQsDU7DQrQndCw0LTQv9C40YHRjDI5LtCg0LDQt9C80LXRgCA9INCkLtCg0LDQt9C80LXRgCgxMDAsIDE0KTsNCtCd0LDQtNC/0LjRgdGMMjku0J/QvtGA0Y/QtNC+0LrQntCx0YXQvtC00LAgPSAzNzsNCtCd0LDQtNC/0LjRgdGMMjku0J/QvtC70L7QttC10L3QuNC1ID0g0KQu0KLQvtGH0LrQsCgzMzYsIDkpOw0K0J3QsNC00L/QuNGB0YwyOS7QotC10LrRgdGCID0gItCe0LHRj9C30LDRgtC10LvRjNC90YvQuSI7DQrQndCw0LTQv9C40YHRjDI5LtCo0YDQuNGE0YIgPSDQpC7QqNGA0LjRhNGCKCJNaWNyb3NvZnQgU2FucyBTZXJpZiIsIDkuNzUsICk7DQpb0J3QsNC00L/QuNGB0YwyOT5dDQpbPNCd0LDQtNC/0LjRgdGMMzBdDQrQndCw0LTQv9C40YHRjDMwLtCg0L7QtNC40YLQtdC70YwgPSDQktC60LvQsNC00LrQsDU7DQrQndCw0LTQv9C40YHRjDMwLtCg0LDQt9C80LXRgCA9INCkLtCg0LDQt9C80LXRgCgxMDAsIDE2KTsNCtCd0LDQtNC/0LjRgdGMMzAu0J/QvtGA0Y/QtNC+0LrQntCx0YXQvtC00LAgPSAzODsNCtCd0LDQtNC/0LjRgdGMMzAu0J/QvtC70L7QttC10L3QuNC1ID0g0KQu0KLQvtGH0LrQsCgxNywgNDkpOw0K0J3QsNC00L/QuNGB0YwzMC7QotC10LrRgdGCID0gItCi0LjQvyI7DQrQndCw0LTQv9C40YHRjDMwLtCo0YDQuNGE0YIgPSDQpC7QqNGA0LjRhNGCKCJNaWNyb3NvZnQgU2FucyBTZXJpZiIsIDkuNzUsICk7DQpb0J3QsNC00L/QuNGB0YwzMD5dDQpbPNCS0LrQu9Cw0LTQutCwNl0NCtCS0LrQu9Cw0LTQutCwNi7QoNC+0LTQuNGC0LXQu9GMID0g0J/QsNC90LXQu9GM0JLQutC70LDQtNC+0LoxOw0K0JLQutC70LDQtNC60LA2LtCi0LXQutGB0YIgPSAiNSI7DQpb0JLQutC70LDQtNC60LA2Pl0NCls80J/QvtC70LXQktCy0L7QtNCwMTldDQrQn9C+0LvQtdCS0LLQvtC00LAxOS7QoNC+0LTQuNGC0LXQu9GMID0g0JLQutC70LDQtNC60LA2Ow0K0J/QvtC70LXQktCy0L7QtNCwMTku0JzQvdC+0LPQvtGB0YLRgNC+0YfQvdGL0LnQoNC10LbQuNC8ID0g0JjRgdGC0LjQvdCwOw0K0J/QvtC70LXQktCy0L7QtNCwMTku0KDQsNC30LzQtdGAID0g0KQu0KDQsNC30LzQtdGAKDYxNSwgNzMpOw0K0J/QvtC70LXQktCy0L7QtNCwMTku0J/QvtGA0Y/QtNC+0LrQntCx0YXQvtC00LAgPSA0MjsNCtCf0L7Qu9C10JLQstC+0LTQsDE5LtCf0L7Qu9C+0LbQtdC90LjQtSA9INCkLtCi0L7Rh9C60LAoMTksIDExMCk7DQrQn9C+0LvQtdCS0LLQvtC00LAxOS7QqNGA0LjRhNGCID0g0KQu0KjRgNC40YTRgigiTWljcm9zb2Z0IFNhbnMgU2VyaWYiLCA5Ljc1LCApOw0KW9Cf0L7Qu9C10JLQstC+0LTQsDE5Pl0NCls80J3QsNC00L/QuNGB0YwzMV0NCtCd0LDQtNC/0LjRgdGMMzEu0KDQvtC00LjRgtC10LvRjCA9INCS0LrQu9Cw0LTQutCwNjsNCtCd0LDQtNC/0LjRgdGMMzEu0KDQsNC30LzQtdGAID0g0KQu0KDQsNC30LzQtdGAKDEwMCwgMTUpOw0K0J3QsNC00L/QuNGB0YwzMS7Qn9C+0YDRj9C00L7QutCe0LHRhdC+0LTQsCA9IDQxOw0K0J3QsNC00L/QuNGB0YwzMS7Qn9C+0LvQvtC20LXQvdC40LUgPSDQpC7QotC+0YfQutCwKDE5LCA5Mik7DQrQndCw0LTQv9C40YHRjDMxLtCi0LXQutGB0YIgPSAi0J7Qv9C40YHQsNC90LjQtSI7DQrQndCw0LTQv9C40YHRjDMxLtCo0YDQuNGE0YIgPSDQpC7QqNGA0LjRhNGCKCJNaWNyb3NvZnQgU2FucyBTZXJpZiIsIDkuNzUsICk7DQpb0J3QsNC00L/QuNGB0YwzMT5dDQpbPNCd0LDQtNC/0LjRgdGMMzJdDQrQndCw0LTQv9C40YHRjDMyLtCg0L7QtNC40YLQtdC70YwgPSDQktC60LvQsNC00LrQsDY7DQrQndCw0LTQv9C40YHRjDMyLtCg0LDQt9C80LXRgCA9INCkLtCg0LDQt9C80LXRgCgxMDAsIDE0KTsNCtCd0LDQtNC/0LjRgdGMMzIu0J/QvtGA0Y/QtNC+0LrQntCx0YXQvtC00LAgPSAzNTsNCtCd0LDQtNC/0LjRgdGMMzIu0J/QvtC70L7QttC10L3QuNC1ID0g0KQu0KLQvtGH0LrQsCgxOSwgOSk7DQrQndCw0LTQv9C40YHRjDMyLtCi0LXQutGB0YIgPSAi0JjQvNGPIjsNCtCd0LDQtNC/0LjRgdGMMzIu0KjRgNC40YTRgiA9INCkLtCo0YDQuNGE0YIoIk1pY3Jvc29mdCBTYW5zIFNlcmlmIiwgOS43NSwgKTsNClvQndCw0LTQv9C40YHRjDMyPl0NCls80J/QvtC70LXQktGL0LHQvtGA0LAxMl0NCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMTIu0KDQvtC00LjRgtC10LvRjCA9INCS0LrQu9Cw0LTQutCwNjsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMTIu0KDQsNC30LzQtdGAID0g0KQu0KDQsNC30LzQtdGAKDYxNSwgMjQpOw0K0J/QvtC70LXQktGL0LHQvtGA0LAxMi7Qn9C+0YDRj9C00L7QutCe0LHRhdC+0LTQsCA9IDQwOw0K0J/QvtC70LXQktGL0LHQvtGA0LAxMi7QktGL0YHQvtGC0LDQrdC70LXQvNC10L3RgtCwID0gMTY7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDEyLtCf0L7Qu9C+0LbQtdC90LjQtSA9INCkLtCi0L7Rh9C60LAoMTksIDY4KTsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMTIu0KLQtdC60YHRgiA9ICLQudC50LnQudC50LnQudC50LnQuSAgINC50LnQudC50LnQudC50LnQudC5IjsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMTIu0KjQuNGA0LjQvdCw0JLRi9C/0LDQtNCw0Y7RidC10LPQvtCh0L/QuNGB0LrQsCA9IDYxNTsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMTIu0KjRgNC40YTRgiA9INCkLtCo0YDQuNGE0YIoIk1pY3Jvc29mdCBTYW5zIFNlcmlmIiwgOS43NSwgKTsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMTIu0K3Qu9C10LzQtdC90YLRiy7QlNC+0LHQsNCy0LjRgtGMKNCkLtCt0LvQtdC80LXQvdGC0KHQv9C40YHQutCwKCLQotC40L86INCR0YPQu9C10LLQvi4iLCAi0KLQuNC/OiDQkdGD0LvQtdCy0L4uIikpOw0K0J/QvtC70LXQktGL0LHQvtGA0LAxMi7QrdC70LXQvNC10L3RgtGLLtCU0L7QsdCw0LLQuNGC0Ywo0KQu0K3Qu9C10LzQtdC90YLQodC/0LjRgdC60LAoItCi0LjQvzog0KHRgtGA0L7QutCwLiIsICLQotC40L86INCh0YLRgNC+0LrQsC4iKSk7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDEyLtCt0LvQtdC80LXQvdGC0Ysu0JTQvtCx0LDQstC40YLRjCjQpC7QrdC70LXQvNC10L3RgtCh0L/QuNGB0LrQsCgi0KLQuNC/OiDQp9C40YHQu9C+LiIsICLQotC40L86INCn0LjRgdC70L4uIikpOw0K0J/QvtC70LXQktGL0LHQvtGA0LAxMi7QrdC70LXQvNC10L3RgtGLLtCU0L7QsdCw0LLQuNGC0Ywo0KQu0K3Qu9C10LzQtdC90YLQodC/0LjRgdC60LAoItCi0LjQvzog0J/RgNC+0LjQt9Cy0L7Qu9GM0L3Ri9C5LiIsICLQotC40L86INCf0YDQvtC40LfQstC+0LvRjNC90YvQuS4iKSk7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDEyLtCt0LvQtdC80LXQvdGC0Ysu0JTQvtCx0LDQstC40YLRjCjQpC7QrdC70LXQvNC10L3RgtCh0L/QuNGB0LrQsCgi0LnQudC50LnQudC50LnQudC50LkgICDQudC50LnQudC50LnQudC50LnQuSIsICLQudC50LnQudC50LnQudC50LnQuSAgINC50LnQudC50LnQudC50LnQudC5IikpOw0KW9Cf0L7Qu9C10JLRi9Cx0L7RgNCwMTI+XQ0KWzzQn9C+0LvQtdCS0LLQvtC00LAyMF0NCtCf0L7Qu9C10JLQstC+0LTQsDIwLtCg0L7QtNC40YLQtdC70YwgPSDQktC60LvQsNC00LrQsDY7DQrQn9C+0LvQtdCS0LLQvtC00LAyMC7QoNCw0LfQvNC10YAgPSDQpC7QoNCw0LfQvNC10YAoMjk2LCAyMik7DQrQn9C+0LvQtdCS0LLQvtC00LAyMC7Qn9C+0YDRj9C00L7QutCe0LHRhdC+0LTQsCA9IDM2Ow0K0J/QvtC70LXQktCy0L7QtNCwMjAu0J/QvtC70L7QttC10L3QuNC1ID0g0KQu0KLQvtGH0LrQsCgxOSwgMjYpOw0K0J/QvtC70LXQktCy0L7QtNCwMjAu0KjRgNC40YTRgiA9INCkLtCo0YDQuNGE0YIoIk1pY3Jvc29mdCBTYW5zIFNlcmlmIiwgOS43NSwgKTsNClvQn9C+0LvQtdCS0LLQvtC00LAyMD5dDQpbPNCf0L7Qu9C10JLRi9Cx0L7RgNCwMTNdDQrQn9C+0LvQtdCS0YvQsdC+0YDQsDEzLtCg0L7QtNC40YLQtdC70YwgPSDQktC60LvQsNC00LrQsDY7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDEzLtCg0LDQt9C80LXRgCA9INCkLtCg0LDQt9C80LXRgCgyOTYsIDI0KTsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMTMu0J/QvtGA0Y/QtNC+0LrQntCx0YXQvtC00LAgPSAzOTsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMTMu0JLRi9GB0L7RgtCw0K3Qu9C10LzQtdC90YLQsCA9IDE2Ow0K0J/QvtC70LXQktGL0LHQvtGA0LAxMy7Qn9C+0LvQvtC20LXQvdC40LUgPSDQpC7QotC+0YfQutCwKDMzOCwgMjYpOw0K0J/QvtC70LXQktGL0LHQvtGA0LAxMy7QotC10LrRgdGCID0gItC+0LHRj9C30LDRgtC10LvRjNC90YvQuSI7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDEzLtCo0LjRgNC40L3QsNCS0YvQv9Cw0LTQsNGO0YnQtdCz0L7QodC/0LjRgdC60LAgPSAyOTY7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDEzLtCo0YDQuNGE0YIgPSDQpC7QqNGA0LjRhNGCKCJNaWNyb3NvZnQgU2FucyBTZXJpZiIsIDkuNzUsICk7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDEzLtCt0LvQtdC80LXQvdGC0Ysu0JTQvtCx0LDQstC40YLRjCjQpC7QrdC70LXQvNC10L3RgtCh0L/QuNGB0LrQsCgi0L7QsdGP0LfQsNGC0LXQu9GM0L3Ri9C5IiwgItC+0LHRj9C30LDRgtC10LvRjNC90YvQuSIpKTsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMTMu0K3Qu9C10LzQtdC90YLRiy7QlNC+0LHQsNCy0LjRgtGMKNCkLtCt0LvQtdC80LXQvdGC0KHQv9C40YHQutCwKCLQvdC10L7QsdGP0LfQsNGC0LXQu9GM0L3Ri9C5IiwgItC90LXQvtCx0Y/Qt9Cw0YLQtdC70YzQvdGL0LkiKSk7DQpb0J/QvtC70LXQktGL0LHQvtGA0LAxMz5dDQpbPNCd0LDQtNC/0LjRgdGMMzNdDQrQndCw0LTQv9C40YHRjDMzLtCg0L7QtNC40YLQtdC70YwgPSDQktC60LvQsNC00LrQsDY7DQrQndCw0LTQv9C40YHRjDMzLtCg0LDQt9C80LXRgCA9INCkLtCg0LDQt9C80LXRgCgxMDAsIDE0KTsNCtCd0LDQtNC/0LjRgdGMMzMu0J/QvtGA0Y/QtNC+0LrQntCx0YXQvtC00LAgPSAzNzsNCtCd0LDQtNC/0LjRgdGMMzMu0J/QvtC70L7QttC10L3QuNC1ID0g0KQu0KLQvtGH0LrQsCgzMzgsIDkpOw0K0J3QsNC00L/QuNGB0YwzMy7QotC10LrRgdGCID0gItCe0LHRj9C30LDRgtC10LvRjNC90YvQuSI7DQrQndCw0LTQv9C40YHRjDMzLtCo0YDQuNGE0YIgPSDQpC7QqNGA0LjRhNGCKCJNaWNyb3NvZnQgU2FucyBTZXJpZiIsIDkuNzUsICk7DQpb0J3QsNC00L/QuNGB0YwzMz5dDQpbPNCd0LDQtNC/0LjRgdGMMzRdDQrQndCw0LTQv9C40YHRjDM0LtCg0L7QtNC40YLQtdC70YwgPSDQktC60LvQsNC00LrQsDY7DQrQndCw0LTQv9C40YHRjDM0LtCg0LDQt9C80LXRgCA9INCkLtCg0LDQt9C80LXRgCgxMDAsIDE2KTsNCtCd0LDQtNC/0LjRgdGMMzQu0J/QvtGA0Y/QtNC+0LrQntCx0YXQvtC00LAgPSAzODsNCtCd0LDQtNC/0LjRgdGMMzQu0J/QvtC70L7QttC10L3QuNC1ID0g0KQu0KLQvtGH0LrQsCgxOSwgNDkpOw0K0J3QsNC00L/QuNGB0YwzNC7QotC10LrRgdGCID0gItCi0LjQvyI7DQrQndCw0LTQv9C40YHRjDM0LtCo0YDQuNGE0YIgPSDQpC7QqNGA0LjRhNGCKCJNaWNyb3NvZnQgU2FucyBTZXJpZiIsIDkuNzUsICk7DQpb0J3QsNC00L/QuNGB0YwzND5dDQpbPNCS0LrQu9Cw0LTQutCwN10NCtCS0LrQu9Cw0LTQutCwNy7QoNC+0LTQuNGC0LXQu9GMID0g0J/QsNC90LXQu9GM0JLQutC70LDQtNC+0LoxOw0K0JLQutC70LDQtNC60LA3LtCi0LXQutGB0YIgPSAiNiI7DQpb0JLQutC70LDQtNC60LA3Pl0NCls80J/QvtC70LXQktCy0L7QtNCwMjFdDQrQn9C+0LvQtdCS0LLQvtC00LAyMS7QoNC+0LTQuNGC0LXQu9GMID0g0JLQutC70LDQtNC60LA3Ow0K0J/QvtC70LXQktCy0L7QtNCwMjEu0JzQvdC+0LPQvtGB0YLRgNC+0YfQvdGL0LnQoNC10LbQuNC8ID0g0JjRgdGC0LjQvdCwOw0K0J/QvtC70LXQktCy0L7QtNCwMjEu0KDQsNC30LzQtdGAID0g0KQu0KDQsNC30LzQtdGAKDYxNSwgNzMpOw0K0J/QvtC70LXQktCy0L7QtNCwMjEu0J/QvtGA0Y/QtNC+0LrQntCx0YXQvtC00LAgPSA0MjsNCtCf0L7Qu9C10JLQstC+0LTQsDIxLtCf0L7Qu9C+0LbQtdC90LjQtSA9INCkLtCi0L7Rh9C60LAoMTYsIDExMCk7DQrQn9C+0LvQtdCS0LLQvtC00LAyMS7QqNGA0LjRhNGCID0g0KQu0KjRgNC40YTRgigiTWljcm9zb2Z0IFNhbnMgU2VyaWYiLCA5Ljc1LCApOw0KW9Cf0L7Qu9C10JLQstC+0LTQsDIxPl0NCls80J3QsNC00L/QuNGB0YwzNV0NCtCd0LDQtNC/0LjRgdGMMzUu0KDQvtC00LjRgtC10LvRjCA9INCS0LrQu9Cw0LTQutCwNzsNCtCd0LDQtNC/0LjRgdGMMzUu0KDQsNC30LzQtdGAID0g0KQu0KDQsNC30LzQtdGAKDEwMCwgMTUpOw0K0J3QsNC00L/QuNGB0YwzNS7Qn9C+0YDRj9C00L7QutCe0LHRhdC+0LTQsCA9IDQxOw0K0J3QsNC00L/QuNGB0YwzNS7Qn9C+0LvQvtC20LXQvdC40LUgPSDQpC7QotC+0YfQutCwKDE2LCA5Mik7DQrQndCw0LTQv9C40YHRjDM1LtCi0LXQutGB0YIgPSAi0J7Qv9C40YHQsNC90LjQtSI7DQrQndCw0LTQv9C40YHRjDM1LtCo0YDQuNGE0YIgPSDQpC7QqNGA0LjRhNGCKCJNaWNyb3NvZnQgU2FucyBTZXJpZiIsIDkuNzUsICk7DQpb0J3QsNC00L/QuNGB0YwzNT5dDQpbPNCd0LDQtNC/0LjRgdGMMzZdDQrQndCw0LTQv9C40YHRjDM2LtCg0L7QtNC40YLQtdC70YwgPSDQktC60LvQsNC00LrQsDc7DQrQndCw0LTQv9C40YHRjDM2LtCg0LDQt9C80LXRgCA9INCkLtCg0LDQt9C80LXRgCgxMDAsIDE0KTsNCtCd0LDQtNC/0LjRgdGMMzYu0J/QvtGA0Y/QtNC+0LrQntCx0YXQvtC00LAgPSAzNTsNCtCd0LDQtNC/0LjRgdGMMzYu0J/QvtC70L7QttC10L3QuNC1ID0g0KQu0KLQvtGH0LrQsCgxNiwgOSk7DQrQndCw0LTQv9C40YHRjDM2LtCi0LXQutGB0YIgPSAi0JjQvNGPIjsNCtCd0LDQtNC/0LjRgdGMMzYu0KjRgNC40YTRgiA9INCkLtCo0YDQuNGE0YIoIk1pY3Jvc29mdCBTYW5zIFNlcmlmIiwgOS43NSwgKTsNClvQndCw0LTQv9C40YHRjDM2Pl0NCls80J/QvtC70LXQktGL0LHQvtGA0LAxNF0NCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMTQu0KDQvtC00LjRgtC10LvRjCA9INCS0LrQu9Cw0LTQutCwNzsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMTQu0KDQsNC30LzQtdGAID0g0KQu0KDQsNC30LzQtdGAKDYxNSwgMjQpOw0K0J/QvtC70LXQktGL0LHQvtGA0LAxNC7Qn9C+0YDRj9C00L7QutCe0LHRhdC+0LTQsCA9IDQwOw0K0J/QvtC70LXQktGL0LHQvtGA0LAxNC7QktGL0YHQvtGC0LDQrdC70LXQvNC10L3RgtCwID0gMTY7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDE0LtCf0L7Qu9C+0LbQtdC90LjQtSA9INCkLtCi0L7Rh9C60LAoMTYsIDY4KTsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMTQu0KLQtdC60YHRgiA9ICLQudC50LnQudC50LnQudC50LnQuSAgINC50LnQudC50LnQudC50LnQudC5IjsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMTQu0KjQuNGA0LjQvdCw0JLRi9C/0LDQtNCw0Y7RidC10LPQvtCh0L/QuNGB0LrQsCA9IDYxNTsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMTQu0KjRgNC40YTRgiA9INCkLtCo0YDQuNGE0YIoIk1pY3Jvc29mdCBTYW5zIFNlcmlmIiwgOS43NSwgKTsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMTQu0K3Qu9C10LzQtdC90YLRiy7QlNC+0LHQsNCy0LjRgtGMKNCkLtCt0LvQtdC80LXQvdGC0KHQv9C40YHQutCwKCLQotC40L86INCR0YPQu9C10LLQvi4iLCAi0KLQuNC/OiDQkdGD0LvQtdCy0L4uIikpOw0K0J/QvtC70LXQktGL0LHQvtGA0LAxNC7QrdC70LXQvNC10L3RgtGLLtCU0L7QsdCw0LLQuNGC0Ywo0KQu0K3Qu9C10LzQtdC90YLQodC/0LjRgdC60LAoItCi0LjQvzog0KHRgtGA0L7QutCwLiIsICLQotC40L86INCh0YLRgNC+0LrQsC4iKSk7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDE0LtCt0LvQtdC80LXQvdGC0Ysu0JTQvtCx0LDQstC40YLRjCjQpC7QrdC70LXQvNC10L3RgtCh0L/QuNGB0LrQsCgi0KLQuNC/OiDQp9C40YHQu9C+LiIsICLQotC40L86INCn0LjRgdC70L4uIikpOw0K0J/QvtC70LXQktGL0LHQvtGA0LAxNC7QrdC70LXQvNC10L3RgtGLLtCU0L7QsdCw0LLQuNGC0Ywo0KQu0K3Qu9C10LzQtdC90YLQodC/0LjRgdC60LAoItCi0LjQvzog0J/RgNC+0LjQt9Cy0L7Qu9GM0L3Ri9C5LiIsICLQotC40L86INCf0YDQvtC40LfQstC+0LvRjNC90YvQuS4iKSk7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDE0LtCt0LvQtdC80LXQvdGC0Ysu0JTQvtCx0LDQstC40YLRjCjQpC7QrdC70LXQvNC10L3RgtCh0L/QuNGB0LrQsCgi0LnQudC50LnQudC50LnQudC50LkgICDQudC50LnQudC50LnQudC50LnQuSIsICLQudC50LnQudC50LnQudC50LnQuSAgINC50LnQudC50LnQudC50LnQudC5IikpOw0KW9Cf0L7Qu9C10JLRi9Cx0L7RgNCwMTQ+XQ0KWzzQn9C+0LvQtdCS0LLQvtC00LAyMl0NCtCf0L7Qu9C10JLQstC+0LTQsDIyLtCg0L7QtNC40YLQtdC70YwgPSDQktC60LvQsNC00LrQsDc7DQrQn9C+0LvQtdCS0LLQvtC00LAyMi7QoNCw0LfQvNC10YAgPSDQpC7QoNCw0LfQvNC10YAoMjk2LCAyMik7DQrQn9C+0LvQtdCS0LLQvtC00LAyMi7Qn9C+0YDRj9C00L7QutCe0LHRhdC+0LTQsCA9IDM2Ow0K0J/QvtC70LXQktCy0L7QtNCwMjIu0J/QvtC70L7QttC10L3QuNC1ID0g0KQu0KLQvtGH0LrQsCgxNiwgMjYpOw0K0J/QvtC70LXQktCy0L7QtNCwMjIu0KjRgNC40YTRgiA9INCkLtCo0YDQuNGE0YIoIk1pY3Jvc29mdCBTYW5zIFNlcmlmIiwgOS43NSwgKTsNClvQn9C+0LvQtdCS0LLQvtC00LAyMj5dDQpbPNCf0L7Qu9C10JLRi9Cx0L7RgNCwMTVdDQrQn9C+0LvQtdCS0YvQsdC+0YDQsDE1LtCg0L7QtNC40YLQtdC70YwgPSDQktC60LvQsNC00LrQsDc7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDE1LtCg0LDQt9C80LXRgCA9INCkLtCg0LDQt9C80LXRgCgyOTYsIDI0KTsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMTUu0J/QvtGA0Y/QtNC+0LrQntCx0YXQvtC00LAgPSAzOTsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMTUu0JLRi9GB0L7RgtCw0K3Qu9C10LzQtdC90YLQsCA9IDE2Ow0K0J/QvtC70LXQktGL0LHQvtGA0LAxNS7Qn9C+0LvQvtC20LXQvdC40LUgPSDQpC7QotC+0YfQutCwKDMzNSwgMjYpOw0K0J/QvtC70LXQktGL0LHQvtGA0LAxNS7QotC10LrRgdGCID0gItC+0LHRj9C30LDRgtC10LvRjNC90YvQuSI7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDE1LtCo0LjRgNC40L3QsNCS0YvQv9Cw0LTQsNGO0YnQtdCz0L7QodC/0LjRgdC60LAgPSAyOTY7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDE1LtCo0YDQuNGE0YIgPSDQpC7QqNGA0LjRhNGCKCJNaWNyb3NvZnQgU2FucyBTZXJpZiIsIDkuNzUsICk7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDE1LtCt0LvQtdC80LXQvdGC0Ysu0JTQvtCx0LDQstC40YLRjCjQpC7QrdC70LXQvNC10L3RgtCh0L/QuNGB0LrQsCgi0L7QsdGP0LfQsNGC0LXQu9GM0L3Ri9C5IiwgItC+0LHRj9C30LDRgtC10LvRjNC90YvQuSIpKTsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMTUu0K3Qu9C10LzQtdC90YLRiy7QlNC+0LHQsNCy0LjRgtGMKNCkLtCt0LvQtdC80LXQvdGC0KHQv9C40YHQutCwKCLQvdC10L7QsdGP0LfQsNGC0LXQu9GM0L3Ri9C5IiwgItC90LXQvtCx0Y/Qt9Cw0YLQtdC70YzQvdGL0LkiKSk7DQpb0J/QvtC70LXQktGL0LHQvtGA0LAxNT5dDQpbPNCd0LDQtNC/0LjRgdGMMzddDQrQndCw0LTQv9C40YHRjDM3LtCg0L7QtNC40YLQtdC70YwgPSDQktC60LvQsNC00LrQsDc7DQrQndCw0LTQv9C40YHRjDM3LtCg0LDQt9C80LXRgCA9INCkLtCg0LDQt9C80LXRgCgxMDAsIDE0KTsNCtCd0LDQtNC/0LjRgdGMMzcu0J/QvtGA0Y/QtNC+0LrQntCx0YXQvtC00LAgPSAzNzsNCtCd0LDQtNC/0LjRgdGMMzcu0J/QvtC70L7QttC10L3QuNC1ID0g0KQu0KLQvtGH0LrQsCgzMzUsIDkpOw0K0J3QsNC00L/QuNGB0YwzNy7QotC10LrRgdGCID0gItCe0LHRj9C30LDRgtC10LvRjNC90YvQuSI7DQrQndCw0LTQv9C40YHRjDM3LtCo0YDQuNGE0YIgPSDQpC7QqNGA0LjRhNGCKCJNaWNyb3NvZnQgU2FucyBTZXJpZiIsIDkuNzUsICk7DQpb0J3QsNC00L/QuNGB0YwzNz5dDQpbPNCd0LDQtNC/0LjRgdGMMzhdDQrQndCw0LTQv9C40YHRjDM4LtCg0L7QtNC40YLQtdC70YwgPSDQktC60LvQsNC00LrQsDc7DQrQndCw0LTQv9C40YHRjDM4LtCg0LDQt9C80LXRgCA9INCkLtCg0LDQt9C80LXRgCgxMDAsIDE2KTsNCtCd0LDQtNC/0LjRgdGMMzgu0J/QvtGA0Y/QtNC+0LrQntCx0YXQvtC00LAgPSAzODsNCtCd0LDQtNC/0LjRgdGMMzgu0J/QvtC70L7QttC10L3QuNC1ID0g0KQu0KLQvtGH0LrQsCgxNiwgNDkpOw0K0J3QsNC00L/QuNGB0YwzOC7QotC10LrRgdGCID0gItCi0LjQvyI7DQrQndCw0LTQv9C40YHRjDM4LtCo0YDQuNGE0YIgPSDQpC7QqNGA0LjRhNGCKCJNaWNyb3NvZnQgU2FucyBTZXJpZiIsIDkuNzUsICk7DQpb0J3QsNC00L/QuNGB0YwzOD5dDQpbPNCS0LrQu9Cw0LTQutCwOF0NCtCS0LrQu9Cw0LTQutCwOC7QoNC+0LTQuNGC0LXQu9GMID0g0J/QsNC90LXQu9GM0JLQutC70LDQtNC+0LoxOw0K0JLQutC70LDQtNC60LA4LtCi0LXQutGB0YIgPSAiNyI7DQpb0JLQutC70LDQtNC60LA4Pl0NCls80J/QvtC70LXQktCy0L7QtNCwMjNdDQrQn9C+0LvQtdCS0LLQvtC00LAyMy7QoNC+0LTQuNGC0LXQu9GMID0g0JLQutC70LDQtNC60LA4Ow0K0J/QvtC70LXQktCy0L7QtNCwMjMu0JzQvdC+0LPQvtGB0YLRgNC+0YfQvdGL0LnQoNC10LbQuNC8ID0g0JjRgdGC0LjQvdCwOw0K0J/QvtC70LXQktCy0L7QtNCwMjMu0KDQsNC30LzQtdGAID0g0KQu0KDQsNC30LzQtdGAKDYxNSwgNzMpOw0K0J/QvtC70LXQktCy0L7QtNCwMjMu0J/QvtGA0Y/QtNC+0LrQntCx0YXQvtC00LAgPSA0MjsNCtCf0L7Qu9C10JLQstC+0LTQsDIzLtCf0L7Qu9C+0LbQtdC90LjQtSA9INCkLtCi0L7Rh9C60LAoMTgsIDExMCk7DQrQn9C+0LvQtdCS0LLQvtC00LAyMy7QqNGA0LjRhNGCID0g0KQu0KjRgNC40YTRgigiTWljcm9zb2Z0IFNhbnMgU2VyaWYiLCA5Ljc1LCApOw0KW9Cf0L7Qu9C10JLQstC+0LTQsDIzPl0NCls80J3QsNC00L/QuNGB0YwzOV0NCtCd0LDQtNC/0LjRgdGMMzku0KDQvtC00LjRgtC10LvRjCA9INCS0LrQu9Cw0LTQutCwODsNCtCd0LDQtNC/0LjRgdGMMzku0KDQsNC30LzQtdGAID0g0KQu0KDQsNC30LzQtdGAKDEwMCwgMTUpOw0K0J3QsNC00L/QuNGB0YwzOS7Qn9C+0YDRj9C00L7QutCe0LHRhdC+0LTQsCA9IDQxOw0K0J3QsNC00L/QuNGB0YwzOS7Qn9C+0LvQvtC20LXQvdC40LUgPSDQpC7QotC+0YfQutCwKDE4LCA5Mik7DQrQndCw0LTQv9C40YHRjDM5LtCi0LXQutGB0YIgPSAi0J7Qv9C40YHQsNC90LjQtSI7DQrQndCw0LTQv9C40YHRjDM5LtCo0YDQuNGE0YIgPSDQpC7QqNGA0LjRhNGCKCJNaWNyb3NvZnQgU2FucyBTZXJpZiIsIDkuNzUsICk7DQpb0J3QsNC00L/QuNGB0YwzOT5dDQpbPNCd0LDQtNC/0LjRgdGMNDBdDQrQndCw0LTQv9C40YHRjDQwLtCg0L7QtNC40YLQtdC70YwgPSDQktC60LvQsNC00LrQsDg7DQrQndCw0LTQv9C40YHRjDQwLtCg0LDQt9C80LXRgCA9INCkLtCg0LDQt9C80LXRgCgxMDAsIDE0KTsNCtCd0LDQtNC/0LjRgdGMNDAu0J/QvtGA0Y/QtNC+0LrQntCx0YXQvtC00LAgPSAzNTsNCtCd0LDQtNC/0LjRgdGMNDAu0J/QvtC70L7QttC10L3QuNC1ID0g0KQu0KLQvtGH0LrQsCgxOCwgOSk7DQrQndCw0LTQv9C40YHRjDQwLtCi0LXQutGB0YIgPSAi0JjQvNGPIjsNCtCd0LDQtNC/0LjRgdGMNDAu0KjRgNC40YTRgiA9INCkLtCo0YDQuNGE0YIoIk1pY3Jvc29mdCBTYW5zIFNlcmlmIiwgOS43NSwgKTsNClvQndCw0LTQv9C40YHRjDQwPl0NCls80J/QvtC70LXQktGL0LHQvtGA0LAxNl0NCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMTYu0KDQvtC00LjRgtC10LvRjCA9INCS0LrQu9Cw0LTQutCwODsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMTYu0KDQsNC30LzQtdGAID0g0KQu0KDQsNC30LzQtdGAKDYxNSwgMjQpOw0K0J/QvtC70LXQktGL0LHQvtGA0LAxNi7Qn9C+0YDRj9C00L7QutCe0LHRhdC+0LTQsCA9IDQwOw0K0J/QvtC70LXQktGL0LHQvtGA0LAxNi7QktGL0YHQvtGC0LDQrdC70LXQvNC10L3RgtCwID0gMTY7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDE2LtCf0L7Qu9C+0LbQtdC90LjQtSA9INCkLtCi0L7Rh9C60LAoMTgsIDY4KTsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMTYu0KLQtdC60YHRgiA9ICLQudC50LnQudC50LnQudC50LnQuSAgINC50LnQudC50LnQudC50LnQudC5IjsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMTYu0KjQuNGA0LjQvdCw0JLRi9C/0LDQtNCw0Y7RidC10LPQvtCh0L/QuNGB0LrQsCA9IDYxNTsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMTYu0KjRgNC40YTRgiA9INCkLtCo0YDQuNGE0YIoIk1pY3Jvc29mdCBTYW5zIFNlcmlmIiwgOS43NSwgKTsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMTYu0K3Qu9C10LzQtdC90YLRiy7QlNC+0LHQsNCy0LjRgtGMKNCkLtCt0LvQtdC80LXQvdGC0KHQv9C40YHQutCwKCLQotC40L86INCR0YPQu9C10LLQvi4iLCAi0KLQuNC/OiDQkdGD0LvQtdCy0L4uIikpOw0K0J/QvtC70LXQktGL0LHQvtGA0LAxNi7QrdC70LXQvNC10L3RgtGLLtCU0L7QsdCw0LLQuNGC0Ywo0KQu0K3Qu9C10LzQtdC90YLQodC/0LjRgdC60LAoItCi0LjQvzog0KHRgtGA0L7QutCwLiIsICLQotC40L86INCh0YLRgNC+0LrQsC4iKSk7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDE2LtCt0LvQtdC80LXQvdGC0Ysu0JTQvtCx0LDQstC40YLRjCjQpC7QrdC70LXQvNC10L3RgtCh0L/QuNGB0LrQsCgi0KLQuNC/OiDQp9C40YHQu9C+LiIsICLQotC40L86INCn0LjRgdC70L4uIikpOw0K0J/QvtC70LXQktGL0LHQvtGA0LAxNi7QrdC70LXQvNC10L3RgtGLLtCU0L7QsdCw0LLQuNGC0Ywo0KQu0K3Qu9C10LzQtdC90YLQodC/0LjRgdC60LAoItCi0LjQvzog0J/RgNC+0LjQt9Cy0L7Qu9GM0L3Ri9C5LiIsICLQotC40L86INCf0YDQvtC40LfQstC+0LvRjNC90YvQuS4iKSk7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDE2LtCt0LvQtdC80LXQvdGC0Ysu0JTQvtCx0LDQstC40YLRjCjQpC7QrdC70LXQvNC10L3RgtCh0L/QuNGB0LrQsCgi0LnQudC50LnQudC50LnQudC50LkgICDQudC50LnQudC50LnQudC50LnQuSIsICLQudC50LnQudC50LnQudC50LnQuSAgINC50LnQudC50LnQudC50LnQudC5IikpOw0KW9Cf0L7Qu9C10JLRi9Cx0L7RgNCwMTY+XQ0KWzzQn9C+0LvQtdCS0LLQvtC00LAyNF0NCtCf0L7Qu9C10JLQstC+0LTQsDI0LtCg0L7QtNC40YLQtdC70YwgPSDQktC60LvQsNC00LrQsDg7DQrQn9C+0LvQtdCS0LLQvtC00LAyNC7QoNCw0LfQvNC10YAgPSDQpC7QoNCw0LfQvNC10YAoMjk2LCAyMik7DQrQn9C+0LvQtdCS0LLQvtC00LAyNC7Qn9C+0YDRj9C00L7QutCe0LHRhdC+0LTQsCA9IDM2Ow0K0J/QvtC70LXQktCy0L7QtNCwMjQu0J/QvtC70L7QttC10L3QuNC1ID0g0KQu0KLQvtGH0LrQsCgxOCwgMjYpOw0K0J/QvtC70LXQktCy0L7QtNCwMjQu0KjRgNC40YTRgiA9INCkLtCo0YDQuNGE0YIoIk1pY3Jvc29mdCBTYW5zIFNlcmlmIiwgOS43NSwgKTsNClvQn9C+0LvQtdCS0LLQvtC00LAyND5dDQpbPNCf0L7Qu9C10JLRi9Cx0L7RgNCwMTddDQrQn9C+0LvQtdCS0YvQsdC+0YDQsDE3LtCg0L7QtNC40YLQtdC70YwgPSDQktC60LvQsNC00LrQsDg7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDE3LtCg0LDQt9C80LXRgCA9INCkLtCg0LDQt9C80LXRgCgyOTYsIDI0KTsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMTcu0J/QvtGA0Y/QtNC+0LrQntCx0YXQvtC00LAgPSAzOTsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMTcu0JLRi9GB0L7RgtCw0K3Qu9C10LzQtdC90YLQsCA9IDE2Ow0K0J/QvtC70LXQktGL0LHQvtGA0LAxNy7Qn9C+0LvQvtC20LXQvdC40LUgPSDQpC7QotC+0YfQutCwKDMzNywgMjYpOw0K0J/QvtC70LXQktGL0LHQvtGA0LAxNy7QotC10LrRgdGCID0gItC+0LHRj9C30LDRgtC10LvRjNC90YvQuSI7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDE3LtCo0LjRgNC40L3QsNCS0YvQv9Cw0LTQsNGO0YnQtdCz0L7QodC/0LjRgdC60LAgPSAyOTY7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDE3LtCo0YDQuNGE0YIgPSDQpC7QqNGA0LjRhNGCKCJNaWNyb3NvZnQgU2FucyBTZXJpZiIsIDkuNzUsICk7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDE3LtCt0LvQtdC80LXQvdGC0Ysu0JTQvtCx0LDQstC40YLRjCjQpC7QrdC70LXQvNC10L3RgtCh0L/QuNGB0LrQsCgi0L7QsdGP0LfQsNGC0LXQu9GM0L3Ri9C5IiwgItC+0LHRj9C30LDRgtC10LvRjNC90YvQuSIpKTsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMTcu0K3Qu9C10LzQtdC90YLRiy7QlNC+0LHQsNCy0LjRgtGMKNCkLtCt0LvQtdC80LXQvdGC0KHQv9C40YHQutCwKCLQvdC10L7QsdGP0LfQsNGC0LXQu9GM0L3Ri9C5IiwgItC90LXQvtCx0Y/Qt9Cw0YLQtdC70YzQvdGL0LkiKSk7DQpb0J/QvtC70LXQktGL0LHQvtGA0LAxNz5dDQpbPNCd0LDQtNC/0LjRgdGMNDFdDQrQndCw0LTQv9C40YHRjDQxLtCg0L7QtNC40YLQtdC70YwgPSDQktC60LvQsNC00LrQsDg7DQrQndCw0LTQv9C40YHRjDQxLtCg0LDQt9C80LXRgCA9INCkLtCg0LDQt9C80LXRgCgxMDAsIDE0KTsNCtCd0LDQtNC/0LjRgdGMNDEu0J/QvtGA0Y/QtNC+0LrQntCx0YXQvtC00LAgPSAzNzsNCtCd0LDQtNC/0LjRgdGMNDEu0J/QvtC70L7QttC10L3QuNC1ID0g0KQu0KLQvtGH0LrQsCgzMzcsIDkpOw0K0J3QsNC00L/QuNGB0Yw0MS7QotC10LrRgdGCID0gItCe0LHRj9C30LDRgtC10LvRjNC90YvQuSI7DQrQndCw0LTQv9C40YHRjDQxLtCo0YDQuNGE0YIgPSDQpC7QqNGA0LjRhNGCKCJNaWNyb3NvZnQgU2FucyBTZXJpZiIsIDkuNzUsICk7DQpb0J3QsNC00L/QuNGB0Yw0MT5dDQpbPNCd0LDQtNC/0LjRgdGMNDJdDQrQndCw0LTQv9C40YHRjDQyLtCg0L7QtNC40YLQtdC70YwgPSDQktC60LvQsNC00LrQsDg7DQrQndCw0LTQv9C40YHRjDQyLtCg0LDQt9C80LXRgCA9INCkLtCg0LDQt9C80LXRgCgxMDAsIDE2KTsNCtCd0LDQtNC/0LjRgdGMNDIu0J/QvtGA0Y/QtNC+0LrQntCx0YXQvtC00LAgPSAzODsNCtCd0LDQtNC/0LjRgdGMNDIu0J/QvtC70L7QttC10L3QuNC1ID0g0KQu0KLQvtGH0LrQsCgxOCwgNDkpOw0K0J3QsNC00L/QuNGB0Yw0Mi7QotC10LrRgdGCID0gItCi0LjQvyI7DQrQndCw0LTQv9C40YHRjDQyLtCo0YDQuNGE0YIgPSDQpC7QqNGA0LjRhNGCKCJNaWNyb3NvZnQgU2FucyBTZXJpZiIsIDkuNzUsICk7DQpb0J3QsNC00L/QuNGB0Yw0Mj5dDQpbPNCS0LrQu9Cw0LTQutCwOV0NCtCS0LrQu9Cw0LTQutCwOS7QoNC+0LTQuNGC0LXQu9GMID0g0J/QsNC90LXQu9GM0JLQutC70LDQtNC+0LoxOw0K0JLQutC70LDQtNC60LA5LtCi0LXQutGB0YIgPSAiOCI7DQpb0JLQutC70LDQtNC60LA5Pl0NCls80J/QvtC70LXQktCy0L7QtNCwMjVdDQrQn9C+0LvQtdCS0LLQvtC00LAyNS7QoNC+0LTQuNGC0LXQu9GMID0g0JLQutC70LDQtNC60LA5Ow0K0J/QvtC70LXQktCy0L7QtNCwMjUu0JzQvdC+0LPQvtGB0YLRgNC+0YfQvdGL0LnQoNC10LbQuNC8ID0g0JjRgdGC0LjQvdCwOw0K0J/QvtC70LXQktCy0L7QtNCwMjUu0KDQsNC30LzQtdGAID0g0KQu0KDQsNC30LzQtdGAKDYxNSwgNzMpOw0K0J/QvtC70LXQktCy0L7QtNCwMjUu0J/QvtGA0Y/QtNC+0LrQntCx0YXQvtC00LAgPSA0MjsNCtCf0L7Qu9C10JLQstC+0LTQsDI1LtCf0L7Qu9C+0LbQtdC90LjQtSA9INCkLtCi0L7Rh9C60LAoMTgsIDExMCk7DQrQn9C+0LvQtdCS0LLQvtC00LAyNS7QqNGA0LjRhNGCID0g0KQu0KjRgNC40YTRgigiTWljcm9zb2Z0IFNhbnMgU2VyaWYiLCA5Ljc1LCApOw0KW9Cf0L7Qu9C10JLQstC+0LTQsDI1Pl0NCls80J3QsNC00L/QuNGB0Yw0M10NCtCd0LDQtNC/0LjRgdGMNDMu0KDQvtC00LjRgtC10LvRjCA9INCS0LrQu9Cw0LTQutCwOTsNCtCd0LDQtNC/0LjRgdGMNDMu0KDQsNC30LzQtdGAID0g0KQu0KDQsNC30LzQtdGAKDEwMCwgMTUpOw0K0J3QsNC00L/QuNGB0Yw0My7Qn9C+0YDRj9C00L7QutCe0LHRhdC+0LTQsCA9IDQxOw0K0J3QsNC00L/QuNGB0Yw0My7Qn9C+0LvQvtC20LXQvdC40LUgPSDQpC7QotC+0YfQutCwKDE4LCA5Mik7DQrQndCw0LTQv9C40YHRjDQzLtCi0LXQutGB0YIgPSAi0J7Qv9C40YHQsNC90LjQtSI7DQrQndCw0LTQv9C40YHRjDQzLtCo0YDQuNGE0YIgPSDQpC7QqNGA0LjRhNGCKCJNaWNyb3NvZnQgU2FucyBTZXJpZiIsIDkuNzUsICk7DQpb0J3QsNC00L/QuNGB0Yw0Mz5dDQpbPNCd0LDQtNC/0LjRgdGMNDRdDQrQndCw0LTQv9C40YHRjDQ0LtCg0L7QtNC40YLQtdC70YwgPSDQktC60LvQsNC00LrQsDk7DQrQndCw0LTQv9C40YHRjDQ0LtCg0LDQt9C80LXRgCA9INCkLtCg0LDQt9C80LXRgCgxMDAsIDE0KTsNCtCd0LDQtNC/0LjRgdGMNDQu0J/QvtGA0Y/QtNC+0LrQntCx0YXQvtC00LAgPSAzNTsNCtCd0LDQtNC/0LjRgdGMNDQu0J/QvtC70L7QttC10L3QuNC1ID0g0KQu0KLQvtGH0LrQsCgxOCwgOSk7DQrQndCw0LTQv9C40YHRjDQ0LtCi0LXQutGB0YIgPSAi0JjQvNGPIjsNCtCd0LDQtNC/0LjRgdGMNDQu0KjRgNC40YTRgiA9INCkLtCo0YDQuNGE0YIoIk1pY3Jvc29mdCBTYW5zIFNlcmlmIiwgOS43NSwgKTsNClvQndCw0LTQv9C40YHRjDQ0Pl0NCls80J/QvtC70LXQktGL0LHQvtGA0LAxOF0NCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMTgu0KDQvtC00LjRgtC10LvRjCA9INCS0LrQu9Cw0LTQutCwOTsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMTgu0KDQsNC30LzQtdGAID0g0KQu0KDQsNC30LzQtdGAKDYxNSwgMjQpOw0K0J/QvtC70LXQktGL0LHQvtGA0LAxOC7Qn9C+0YDRj9C00L7QutCe0LHRhdC+0LTQsCA9IDQwOw0K0J/QvtC70LXQktGL0LHQvtGA0LAxOC7QktGL0YHQvtGC0LDQrdC70LXQvNC10L3RgtCwID0gMTY7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDE4LtCf0L7Qu9C+0LbQtdC90LjQtSA9INCkLtCi0L7Rh9C60LAoMTgsIDY4KTsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMTgu0KLQtdC60YHRgiA9ICLQudC50LnQudC50LnQudC50LnQuSAgINC50LnQudC50LnQudC50LnQudC5IjsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMTgu0KjQuNGA0LjQvdCw0JLRi9C/0LDQtNCw0Y7RidC10LPQvtCh0L/QuNGB0LrQsCA9IDYxNTsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMTgu0KjRgNC40YTRgiA9INCkLtCo0YDQuNGE0YIoIk1pY3Jvc29mdCBTYW5zIFNlcmlmIiwgOS43NSwgKTsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMTgu0K3Qu9C10LzQtdC90YLRiy7QlNC+0LHQsNCy0LjRgtGMKNCkLtCt0LvQtdC80LXQvdGC0KHQv9C40YHQutCwKCLQotC40L86INCR0YPQu9C10LLQvi4iLCAi0KLQuNC/OiDQkdGD0LvQtdCy0L4uIikpOw0K0J/QvtC70LXQktGL0LHQvtGA0LAxOC7QrdC70LXQvNC10L3RgtGLLtCU0L7QsdCw0LLQuNGC0Ywo0KQu0K3Qu9C10LzQtdC90YLQodC/0LjRgdC60LAoItCi0LjQvzog0KHRgtGA0L7QutCwLiIsICLQotC40L86INCh0YLRgNC+0LrQsC4iKSk7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDE4LtCt0LvQtdC80LXQvdGC0Ysu0JTQvtCx0LDQstC40YLRjCjQpC7QrdC70LXQvNC10L3RgtCh0L/QuNGB0LrQsCgi0KLQuNC/OiDQp9C40YHQu9C+LiIsICLQotC40L86INCn0LjRgdC70L4uIikpOw0K0J/QvtC70LXQktGL0LHQvtGA0LAxOC7QrdC70LXQvNC10L3RgtGLLtCU0L7QsdCw0LLQuNGC0Ywo0KQu0K3Qu9C10LzQtdC90YLQodC/0LjRgdC60LAoItCi0LjQvzog0J/RgNC+0LjQt9Cy0L7Qu9GM0L3Ri9C5LiIsICLQotC40L86INCf0YDQvtC40LfQstC+0LvRjNC90YvQuS4iKSk7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDE4LtCt0LvQtdC80LXQvdGC0Ysu0JTQvtCx0LDQstC40YLRjCjQpC7QrdC70LXQvNC10L3RgtCh0L/QuNGB0LrQsCgi0LnQudC50LnQudC50LnQudC50LkgICDQudC50LnQudC50LnQudC50LnQuSIsICLQudC50LnQudC50LnQudC50LnQuSAgINC50LnQudC50LnQudC50LnQudC5IikpOw0KW9Cf0L7Qu9C10JLRi9Cx0L7RgNCwMTg+XQ0KWzzQn9C+0LvQtdCS0LLQvtC00LAyNl0NCtCf0L7Qu9C10JLQstC+0LTQsDI2LtCg0L7QtNC40YLQtdC70YwgPSDQktC60LvQsNC00LrQsDk7DQrQn9C+0LvQtdCS0LLQvtC00LAyNi7QoNCw0LfQvNC10YAgPSDQpC7QoNCw0LfQvNC10YAoMjk2LCAyMik7DQrQn9C+0LvQtdCS0LLQvtC00LAyNi7Qn9C+0YDRj9C00L7QutCe0LHRhdC+0LTQsCA9IDM2Ow0K0J/QvtC70LXQktCy0L7QtNCwMjYu0J/QvtC70L7QttC10L3QuNC1ID0g0KQu0KLQvtGH0LrQsCgxOCwgMjYpOw0K0J/QvtC70LXQktCy0L7QtNCwMjYu0KjRgNC40YTRgiA9INCkLtCo0YDQuNGE0YIoIk1pY3Jvc29mdCBTYW5zIFNlcmlmIiwgOS43NSwgKTsNClvQn9C+0LvQtdCS0LLQvtC00LAyNj5dDQpbPNCf0L7Qu9C10JLRi9Cx0L7RgNCwMTldDQrQn9C+0LvQtdCS0YvQsdC+0YDQsDE5LtCg0L7QtNC40YLQtdC70YwgPSDQktC60LvQsNC00LrQsDk7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDE5LtCg0LDQt9C80LXRgCA9INCkLtCg0LDQt9C80LXRgCgyOTYsIDI0KTsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMTku0J/QvtGA0Y/QtNC+0LrQntCx0YXQvtC00LAgPSAzOTsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMTku0JLRi9GB0L7RgtCw0K3Qu9C10LzQtdC90YLQsCA9IDE2Ow0K0J/QvtC70LXQktGL0LHQvtGA0LAxOS7Qn9C+0LvQvtC20LXQvdC40LUgPSDQpC7QotC+0YfQutCwKDMzNywgMjYpOw0K0J/QvtC70LXQktGL0LHQvtGA0LAxOS7QotC10LrRgdGCID0gItC+0LHRj9C30LDRgtC10LvRjNC90YvQuSI7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDE5LtCo0LjRgNC40L3QsNCS0YvQv9Cw0LTQsNGO0YnQtdCz0L7QodC/0LjRgdC60LAgPSAyOTY7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDE5LtCo0YDQuNGE0YIgPSDQpC7QqNGA0LjRhNGCKCJNaWNyb3NvZnQgU2FucyBTZXJpZiIsIDkuNzUsICk7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDE5LtCt0LvQtdC80LXQvdGC0Ysu0JTQvtCx0LDQstC40YLRjCjQpC7QrdC70LXQvNC10L3RgtCh0L/QuNGB0LrQsCgi0L7QsdGP0LfQsNGC0LXQu9GM0L3Ri9C5IiwgItC+0LHRj9C30LDRgtC10LvRjNC90YvQuSIpKTsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMTku0K3Qu9C10LzQtdC90YLRiy7QlNC+0LHQsNCy0LjRgtGMKNCkLtCt0LvQtdC80LXQvdGC0KHQv9C40YHQutCwKCLQvdC10L7QsdGP0LfQsNGC0LXQu9GM0L3Ri9C5IiwgItC90LXQvtCx0Y/Qt9Cw0YLQtdC70YzQvdGL0LkiKSk7DQpb0J/QvtC70LXQktGL0LHQvtGA0LAxOT5dDQpbPNCd0LDQtNC/0LjRgdGMNDVdDQrQndCw0LTQv9C40YHRjDQ1LtCg0L7QtNC40YLQtdC70YwgPSDQktC60LvQsNC00LrQsDk7DQrQndCw0LTQv9C40YHRjDQ1LtCg0LDQt9C80LXRgCA9INCkLtCg0LDQt9C80LXRgCgxMDAsIDE0KTsNCtCd0LDQtNC/0LjRgdGMNDUu0J/QvtGA0Y/QtNC+0LrQntCx0YXQvtC00LAgPSAzNzsNCtCd0LDQtNC/0LjRgdGMNDUu0J/QvtC70L7QttC10L3QuNC1ID0g0KQu0KLQvtGH0LrQsCgzMzcsIDkpOw0K0J3QsNC00L/QuNGB0Yw0NS7QotC10LrRgdGCID0gItCe0LHRj9C30LDRgtC10LvRjNC90YvQuSI7DQrQndCw0LTQv9C40YHRjDQ1LtCo0YDQuNGE0YIgPSDQpC7QqNGA0LjRhNGCKCJNaWNyb3NvZnQgU2FucyBTZXJpZiIsIDkuNzUsICk7DQpb0J3QsNC00L/QuNGB0Yw0NT5dDQpbPNCd0LDQtNC/0LjRgdGMNDZdDQrQndCw0LTQv9C40YHRjDQ2LtCg0L7QtNC40YLQtdC70YwgPSDQktC60LvQsNC00LrQsDk7DQrQndCw0LTQv9C40YHRjDQ2LtCg0LDQt9C80LXRgCA9INCkLtCg0LDQt9C80LXRgCgxMDAsIDE2KTsNCtCd0LDQtNC/0LjRgdGMNDYu0J/QvtGA0Y/QtNC+0LrQntCx0YXQvtC00LAgPSAzODsNCtCd0LDQtNC/0LjRgdGMNDYu0J/QvtC70L7QttC10L3QuNC1ID0g0KQu0KLQvtGH0LrQsCgxOCwgNDkpOw0K0J3QsNC00L/QuNGB0Yw0Ni7QotC10LrRgdGCID0gItCi0LjQvyI7DQrQndCw0LTQv9C40YHRjDQ2LtCo0YDQuNGE0YIgPSDQpC7QqNGA0LjRhNGCKCJNaWNyb3NvZnQgU2FucyBTZXJpZiIsIDkuNzUsICk7DQpb0J3QsNC00L/QuNGB0Yw0Nj5dDQpbPNCS0LrQu9Cw0LTQutCwMTBdDQrQktC60LvQsNC00LrQsDEwLtCg0L7QtNC40YLQtdC70YwgPSDQn9Cw0L3QtdC70YzQktC60LvQsNC00L7QujE7DQrQktC60LvQsNC00LrQsDEwLtCi0LXQutGB0YIgPSAiOSI7DQpb0JLQutC70LDQtNC60LAxMD5dDQpbPNCf0L7Qu9C10JLQstC+0LTQsDI3XQ0K0J/QvtC70LXQktCy0L7QtNCwMjcu0KDQvtC00LjRgtC10LvRjCA9INCS0LrQu9Cw0LTQutCwMTA7DQrQn9C+0LvQtdCS0LLQvtC00LAyNy7QnNC90L7Qs9C+0YHRgtGA0L7Rh9C90YvQudCg0LXQttC40LwgPSDQmNGB0YLQuNC90LA7DQrQn9C+0LvQtdCS0LLQvtC00LAyNy7QoNCw0LfQvNC10YAgPSDQpC7QoNCw0LfQvNC10YAoNjE1LCA3Myk7DQrQn9C+0LvQtdCS0LLQvtC00LAyNy7Qn9C+0YDRj9C00L7QutCe0LHRhdC+0LTQsCA9IDQyOw0K0J/QvtC70LXQktCy0L7QtNCwMjcu0J/QvtC70L7QttC10L3QuNC1ID0g0KQu0KLQvtGH0LrQsCgxOSwgMTEwKTsNCtCf0L7Qu9C10JLQstC+0LTQsDI3LtCo0YDQuNGE0YIgPSDQpC7QqNGA0LjRhNGCKCJNaWNyb3NvZnQgU2FucyBTZXJpZiIsIDkuNzUsICk7DQpb0J/QvtC70LXQktCy0L7QtNCwMjc+XQ0KWzzQndCw0LTQv9C40YHRjDQ3XQ0K0J3QsNC00L/QuNGB0Yw0Ny7QoNC+0LTQuNGC0LXQu9GMID0g0JLQutC70LDQtNC60LAxMDsNCtCd0LDQtNC/0LjRgdGMNDcu0KDQsNC30LzQtdGAID0g0KQu0KDQsNC30LzQtdGAKDEwMCwgMTUpOw0K0J3QsNC00L/QuNGB0Yw0Ny7Qn9C+0YDRj9C00L7QutCe0LHRhdC+0LTQsCA9IDQxOw0K0J3QsNC00L/QuNGB0Yw0Ny7Qn9C+0LvQvtC20LXQvdC40LUgPSDQpC7QotC+0YfQutCwKDE5LCA5Mik7DQrQndCw0LTQv9C40YHRjDQ3LtCi0LXQutGB0YIgPSAi0J7Qv9C40YHQsNC90LjQtSI7DQrQndCw0LTQv9C40YHRjDQ3LtCo0YDQuNGE0YIgPSDQpC7QqNGA0LjRhNGCKCJNaWNyb3NvZnQgU2FucyBTZXJpZiIsIDkuNzUsICk7DQpb0J3QsNC00L/QuNGB0Yw0Nz5dDQpbPNCd0LDQtNC/0LjRgdGMNDhdDQrQndCw0LTQv9C40YHRjDQ4LtCg0L7QtNC40YLQtdC70YwgPSDQktC60LvQsNC00LrQsDEwOw0K0J3QsNC00L/QuNGB0Yw0OC7QoNCw0LfQvNC10YAgPSDQpC7QoNCw0LfQvNC10YAoMTAwLCAxNCk7DQrQndCw0LTQv9C40YHRjDQ4LtCf0L7RgNGP0LTQvtC60J7QsdGF0L7QtNCwID0gMzU7DQrQndCw0LTQv9C40YHRjDQ4LtCf0L7Qu9C+0LbQtdC90LjQtSA9INCkLtCi0L7Rh9C60LAoMTksIDkpOw0K0J3QsNC00L/QuNGB0Yw0OC7QotC10LrRgdGCID0gItCY0LzRjyI7DQrQndCw0LTQv9C40YHRjDQ4LtCo0YDQuNGE0YIgPSDQpC7QqNGA0LjRhNGCKCJNaWNyb3NvZnQgU2FucyBTZXJpZiIsIDkuNzUsICk7DQpb0J3QsNC00L/QuNGB0Yw0OD5dDQpbPNCf0L7Qu9C10JLRi9Cx0L7RgNCwMjBdDQrQn9C+0LvQtdCS0YvQsdC+0YDQsDIwLtCg0L7QtNC40YLQtdC70YwgPSDQktC60LvQsNC00LrQsDEwOw0K0J/QvtC70LXQktGL0LHQvtGA0LAyMC7QoNCw0LfQvNC10YAgPSDQpC7QoNCw0LfQvNC10YAoNjE1LCAyNCk7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDIwLtCf0L7RgNGP0LTQvtC60J7QsdGF0L7QtNCwID0gNDA7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDIwLtCS0YvRgdC+0YLQsNCt0LvQtdC80LXQvdGC0LAgPSAxNjsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMjAu0J/QvtC70L7QttC10L3QuNC1ID0g0KQu0KLQvtGH0LrQsCgxOSwgNjgpOw0K0J/QvtC70LXQktGL0LHQvtGA0LAyMC7QotC10LrRgdGCID0gItC50LnQudC50LnQudC50LnQudC5ICAg0LnQudC50LnQudC50LnQudC50LkiOw0K0J/QvtC70LXQktGL0LHQvtGA0LAyMC7QqNC40YDQuNC90LDQktGL0L/QsNC00LDRjtGJ0LXQs9C+0KHQv9C40YHQutCwID0gNjE1Ow0K0J/QvtC70LXQktGL0LHQvtGA0LAyMC7QqNGA0LjRhNGCID0g0KQu0KjRgNC40YTRgigiTWljcm9zb2Z0IFNhbnMgU2VyaWYiLCA5Ljc1LCApOw0K0J/QvtC70LXQktGL0LHQvtGA0LAyMC7QrdC70LXQvNC10L3RgtGLLtCU0L7QsdCw0LLQuNGC0Ywo0KQu0K3Qu9C10LzQtdC90YLQodC/0LjRgdC60LAoItCi0LjQvzog0JHRg9C70LXQstC+LiIsICLQotC40L86INCR0YPQu9C10LLQvi4iKSk7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDIwLtCt0LvQtdC80LXQvdGC0Ysu0JTQvtCx0LDQstC40YLRjCjQpC7QrdC70LXQvNC10L3RgtCh0L/QuNGB0LrQsCgi0KLQuNC/OiDQodGC0YDQvtC60LAuIiwgItCi0LjQvzog0KHRgtGA0L7QutCwLiIpKTsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMjAu0K3Qu9C10LzQtdC90YLRiy7QlNC+0LHQsNCy0LjRgtGMKNCkLtCt0LvQtdC80LXQvdGC0KHQv9C40YHQutCwKCLQotC40L86INCn0LjRgdC70L4uIiwgItCi0LjQvzog0KfQuNGB0LvQvi4iKSk7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDIwLtCt0LvQtdC80LXQvdGC0Ysu0JTQvtCx0LDQstC40YLRjCjQpC7QrdC70LXQvNC10L3RgtCh0L/QuNGB0LrQsCgi0KLQuNC/OiDQn9GA0L7QuNC30LLQvtC70YzQvdGL0LkuIiwgItCi0LjQvzog0J/RgNC+0LjQt9Cy0L7Qu9GM0L3Ri9C5LiIpKTsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMjAu0K3Qu9C10LzQtdC90YLRiy7QlNC+0LHQsNCy0LjRgtGMKNCkLtCt0LvQtdC80LXQvdGC0KHQv9C40YHQutCwKCLQudC50LnQudC50LnQudC50LnQuSAgINC50LnQudC50LnQudC50LnQudC5IiwgItC50LnQudC50LnQudC50LnQudC5ICAg0LnQudC50LnQudC50LnQudC50LkiKSk7DQpb0J/QvtC70LXQktGL0LHQvtGA0LAyMD5dDQpbPNCf0L7Qu9C10JLQstC+0LTQsDI4XQ0K0J/QvtC70LXQktCy0L7QtNCwMjgu0KDQvtC00LjRgtC10LvRjCA9INCS0LrQu9Cw0LTQutCwMTA7DQrQn9C+0LvQtdCS0LLQvtC00LAyOC7QoNCw0LfQvNC10YAgPSDQpC7QoNCw0LfQvNC10YAoMjk2LCAyMik7DQrQn9C+0LvQtdCS0LLQvtC00LAyOC7Qn9C+0YDRj9C00L7QutCe0LHRhdC+0LTQsCA9IDM2Ow0K0J/QvtC70LXQktCy0L7QtNCwMjgu0J/QvtC70L7QttC10L3QuNC1ID0g0KQu0KLQvtGH0LrQsCgxOSwgMjYpOw0K0J/QvtC70LXQktCy0L7QtNCwMjgu0KjRgNC40YTRgiA9INCkLtCo0YDQuNGE0YIoIk1pY3Jvc29mdCBTYW5zIFNlcmlmIiwgOS43NSwgKTsNClvQn9C+0LvQtdCS0LLQvtC00LAyOD5dDQpbPNCf0L7Qu9C10JLRi9Cx0L7RgNCwMjFdDQrQn9C+0LvQtdCS0YvQsdC+0YDQsDIxLtCg0L7QtNC40YLQtdC70YwgPSDQktC60LvQsNC00LrQsDEwOw0K0J/QvtC70LXQktGL0LHQvtGA0LAyMS7QoNCw0LfQvNC10YAgPSDQpC7QoNCw0LfQvNC10YAoMjk2LCAyNCk7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDIxLtCf0L7RgNGP0LTQvtC60J7QsdGF0L7QtNCwID0gMzk7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDIxLtCS0YvRgdC+0YLQsNCt0LvQtdC80LXQvdGC0LAgPSAxNjsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMjEu0J/QvtC70L7QttC10L3QuNC1ID0g0KQu0KLQvtGH0LrQsCgzMzgsIDI2KTsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMjEu0KLQtdC60YHRgiA9ICLQvtCx0Y/Qt9Cw0YLQtdC70YzQvdGL0LkiOw0K0J/QvtC70LXQktGL0LHQvtGA0LAyMS7QqNC40YDQuNC90LDQktGL0L/QsNC00LDRjtGJ0LXQs9C+0KHQv9C40YHQutCwID0gMjk2Ow0K0J/QvtC70LXQktGL0LHQvtGA0LAyMS7QqNGA0LjRhNGCID0g0KQu0KjRgNC40YTRgigiTWljcm9zb2Z0IFNhbnMgU2VyaWYiLCA5Ljc1LCApOw0K0J/QvtC70LXQktGL0LHQvtGA0LAyMS7QrdC70LXQvNC10L3RgtGLLtCU0L7QsdCw0LLQuNGC0Ywo0KQu0K3Qu9C10LzQtdC90YLQodC/0LjRgdC60LAoItC+0LHRj9C30LDRgtC10LvRjNC90YvQuSIsICLQvtCx0Y/Qt9Cw0YLQtdC70YzQvdGL0LkiKSk7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDIxLtCt0LvQtdC80LXQvdGC0Ysu0JTQvtCx0LDQstC40YLRjCjQpC7QrdC70LXQvNC10L3RgtCh0L/QuNGB0LrQsCgi0L3QtdC+0LHRj9C30LDRgtC10LvRjNC90YvQuSIsICLQvdC10L7QsdGP0LfQsNGC0LXQu9GM0L3Ri9C5IikpOw0KW9Cf0L7Qu9C10JLRi9Cx0L7RgNCwMjE+XQ0KWzzQndCw0LTQv9C40YHRjDQ5XQ0K0J3QsNC00L/QuNGB0Yw0OS7QoNC+0LTQuNGC0LXQu9GMID0g0JLQutC70LDQtNC60LAxMDsNCtCd0LDQtNC/0LjRgdGMNDku0KDQsNC30LzQtdGAID0g0KQu0KDQsNC30LzQtdGAKDEwMCwgMTQpOw0K0J3QsNC00L/QuNGB0Yw0OS7Qn9C+0YDRj9C00L7QutCe0LHRhdC+0LTQsCA9IDM3Ow0K0J3QsNC00L/QuNGB0Yw0OS7Qn9C+0LvQvtC20LXQvdC40LUgPSDQpC7QotC+0YfQutCwKDMzOCwgOSk7DQrQndCw0LTQv9C40YHRjDQ5LtCi0LXQutGB0YIgPSAi0J7QsdGP0LfQsNGC0LXQu9GM0L3Ri9C5IjsNCtCd0LDQtNC/0LjRgdGMNDku0KjRgNC40YTRgiA9INCkLtCo0YDQuNGE0YIoIk1pY3Jvc29mdCBTYW5zIFNlcmlmIiwgOS43NSwgKTsNClvQndCw0LTQv9C40YHRjDQ5Pl0NCls80J3QsNC00L/QuNGB0Yw1MF0NCtCd0LDQtNC/0LjRgdGMNTAu0KDQvtC00LjRgtC10LvRjCA9INCS0LrQu9Cw0LTQutCwMTA7DQrQndCw0LTQv9C40YHRjDUwLtCg0LDQt9C80LXRgCA9INCkLtCg0LDQt9C80LXRgCgxMDAsIDE2KTsNCtCd0LDQtNC/0LjRgdGMNTAu0J/QvtGA0Y/QtNC+0LrQntCx0YXQvtC00LAgPSAzODsNCtCd0LDQtNC/0LjRgdGMNTAu0J/QvtC70L7QttC10L3QuNC1ID0g0KQu0KLQvtGH0LrQsCgxOSwgNDkpOw0K0J3QsNC00L/QuNGB0Yw1MC7QotC10LrRgdGCID0gItCi0LjQvyI7DQrQndCw0LTQv9C40YHRjDUwLtCo0YDQuNGE0YIgPSDQpC7QqNGA0LjRhNGCKCJNaWNyb3NvZnQgU2FucyBTZXJpZiIsIDkuNzUsICk7DQpb0J3QsNC00L/QuNGB0Yw1MD5dDQpbPNCd0LDQtNC/0LjRgdGMMTBdDQrQndCw0LTQv9C40YHRjDEwLtCg0L7QtNC40YLQtdC70YwgPSDQpNC+0YDQvNCwXzA7DQrQndCw0LTQv9C40YHRjDEwLtCg0LDQt9C80LXRgCA9INCkLtCg0LDQt9C80LXRgCgxMDAsIDE3KTsNCtCd0LDQtNC/0LjRgdGMMTAu0J/QvtGA0Y/QtNC+0LrQntCx0YXQvtC00LAgPSAxNzsNCtCd0LDQtNC/0LjRgdGMMTAu0J/QvtC70L7QttC10L3QuNC1ID0g0KQu0KLQvtGH0LrQsCgyNiwgMzAwKTsNCtCd0LDQtNC/0LjRgdGMMTAu0KLQtdC60YHRgiA9ICLQn9Cw0YDQsNC80LXRgtGA0YsiOw0K0J3QsNC00L/QuNGB0YwxMC7QqNGA0LjRhNGCID0g0KQu0KjRgNC40YTRgigiTWljcm9zb2Z0IFNhbnMgU2VyaWYiLCA5Ljc1LCApOw0KW9Cd0LDQtNC/0LjRgdGMMTA+XQ0KWzzQn9C+0LvQtdCS0YvQsdC+0YDQsDJdDQrQn9C+0LvQtdCS0YvQsdC+0YDQsDIu0KDQvtC00LjRgtC10LvRjCA9INCk0L7RgNC80LBfMDsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMi7QoNCw0LfQvNC10YAgPSDQpC7QoNCw0LfQvNC10YAoNjU2LCAyNCk7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDIu0J/QvtGA0Y/QtNC+0LrQntCx0YXQvtC00LAgPSAxODsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMi7QktGL0YHQvtGC0LDQrdC70LXQvNC10L3RgtCwID0gMTY7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDIu0J/QvtC70L7QttC10L3QuNC1ID0g0KQu0KLQvtGH0LrQsCgyNiwgMTk0KTsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMi7QotC10LrRgdGCID0gItCi0LjQvzog0JHRg9C70LXQstC+LiI7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDIu0KjQuNGA0LjQvdCw0JLRi9C/0LDQtNCw0Y7RidC10LPQvtCh0L/QuNGB0LrQsCA9IDY1NjsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMi7QqNGA0LjRhNGCID0g0KQu0KjRgNC40YTRgigiTWljcm9zb2Z0IFNhbnMgU2VyaWYiLCA5Ljc1LCApOw0K0J/QvtC70LXQktGL0LHQvtGA0LAyLtCt0LvQtdC80LXQvdGC0Ysu0JTQvtCx0LDQstC40YLRjCjQpC7QrdC70LXQvNC10L3RgtCh0L/QuNGB0LrQsCgi0KLQuNC/OiDQkdGD0LvQtdCy0L4uIiwgItCi0LjQvzog0JHRg9C70LXQstC+LiIpKTsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMi7QrdC70LXQvNC10L3RgtGLLtCU0L7QsdCw0LLQuNGC0Ywo0KQu0K3Qu9C10LzQtdC90YLQodC/0LjRgdC60LAoItCi0LjQvzog0KHRgtGA0L7QutCwLiIsICLQotC40L86INCh0YLRgNC+0LrQsC4iKSk7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDIu0K3Qu9C10LzQtdC90YLRiy7QlNC+0LHQsNCy0LjRgtGMKNCkLtCt0LvQtdC80LXQvdGC0KHQv9C40YHQutCwKCLQotC40L86INCn0LjRgdC70L4uIiwgItCi0LjQvzog0KfQuNGB0LvQvi4iKSk7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDIu0K3Qu9C10LzQtdC90YLRiy7QlNC+0LHQsNCy0LjRgtGMKNCkLtCt0LvQtdC80LXQvdGC0KHQv9C40YHQutCwKCLQotC40L86INCf0YDQvtC40LfQstC+0LvRjNC90YvQuS4iLCAi0KLQuNC/OiDQn9GA0L7QuNC30LLQvtC70YzQvdGL0LkuIikpOw0K0J/QvtC70LXQktGL0LHQvtGA0LAyLtCt0LvQtdC80LXQvdGC0Ysu0JTQvtCx0LDQstC40YLRjCjQpC7QrdC70LXQvNC10L3RgtCh0L/QuNGB0LrQsCgi0LnQudC50LnQudC50LnQudC50LkgICDQudC50LnQudC50LnQudC50LnQuSIsICLQudC50LnQudC50LnQudC50LnQuSAgINC50LnQudC50LnQudC50LnQudC5IikpOw0KW9Cf0L7Qu9C10JLRi9Cx0L7RgNCwMj5dDQpbPNCf0L7Qu9C10JLRi9Cx0L7RgNCwMjJdDQrQn9C+0LvQtdCS0YvQsdC+0YDQsDIyLtCg0L7QtNC40YLQtdC70YwgPSDQpNC+0YDQvNCwXzA7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDIyLtCg0LDQt9C80LXRgCA9INCkLtCg0LDQt9C80LXRgCgzMjMsIDI0KTsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMjIu0J/QvtGA0Y/QtNC+0LrQntCx0YXQvtC00LAgPSAxOTsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMjIu0JLRi9GB0L7RgtCw0K3Qu9C10LzQtdC90YLQsCA9IDE2Ow0K0J/QvtC70LXQktGL0LHQvtGA0LAyMi7Qn9C+0LvQvtC20LXQvdC40LUgPSDQpC7QotC+0YfQutCwKDIyLCAyNik7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDIyLtCo0LjRgNC40L3QsNCS0YvQv9Cw0LTQsNGO0YnQtdCz0L7QodC/0LjRgdC60LAgPSAzMjM7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDIyLtCo0YDQuNGE0YIgPSDQpC7QqNGA0LjRhNGCKCJNaWNyb3NvZnQgU2FucyBTZXJpZiIsIDkuNzUsICk7DQpb0J/QvtC70LXQktGL0LHQvtGA0LAyMj5dDQpbPNCd0LDQtNC/0LjRgdGMNTJdDQrQndCw0LTQv9C40YHRjDUyLtCg0L7QtNC40YLQtdC70YwgPSDQpNC+0YDQvNCwXzA7DQrQndCw0LTQv9C40YHRjDUyLtCg0LDQt9C80LXRgCA9INCkLtCg0LDQt9C80LXRgCgxMzIsIDIzKTsNCtCd0LDQtNC/0LjRgdGMNTIu0J/QvtGA0Y/QtNC+0LrQntCx0YXQvtC00LAgPSAyMjsNCtCd0LDQtNC/0LjRgdGMNTIu0J/QvtC70L7QttC10L3QuNC1ID0g0KQu0KLQvtGH0LrQsCgyNiwgNTQ1KTsNCtCd0LDQtNC/0LjRgdGMNTIu0KLQtdC60YHRgiA9ICLQmtC+0L/QuNGA0YPQtdC80YvQuSDQvNC10YLQvtC0IjsNCtCd0LDQtNC/0LjRgdGMNTIu0KjRgNC40YTRgiA9INCkLtCo0YDQuNGE0YIoIk1pY3Jvc29mdCBTYW5zIFNlcmlmIiwgOS43NSwgKTsNClvQndCw0LTQv9C40YHRjDUyPl0NCls80J/QvtC70LXQktGL0LHQvtGA0LAyNF0NCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMjQu0KDQvtC00LjRgtC10LvRjCA9INCk0L7RgNC80LBfMDsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMjQu0KDQsNC30LzQtdGAID0g0KQu0KDQsNC30LzQtdGAKDM5NSwgMjQpOw0K0J/QvtC70LXQktGL0LHQvtGA0LAyNC7Qn9C+0YDRj9C00L7QutCe0LHRhdC+0LTQsCA9IDIzOw0K0J/QvtC70LXQktGL0LHQvtGA0LAyNC7QktGL0YHQvtGC0LDQrdC70LXQvNC10L3RgtCwID0gMTY7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDI0LtCU0L7RgdGC0YPQv9C90L7RgdGC0YwgPSDQm9C+0LbRjDsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMjQu0JjQvdC00LXQutGB0JLRi9Cx0YDQsNC90L3QvtCz0L7QmNC30LzQtdC90LXQvSA9ICLQmtC+0L/QuNGA0L7QstCw0YLRjNCc0LXRgtC+0LQiOw0K0J/QvtC70LXQktGL0LHQvtGA0LAyNC7Qn9C+0LvQvtC20LXQvdC40LUgPSDQpC7QotC+0YfQutCwKDE2NSwgNTQyKTsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMjQu0KjQuNGA0LjQvdCw0JLRi9C/0LDQtNCw0Y7RidC10LPQvtCh0L/QuNGB0LrQsCA9IDUxNzsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMjQu0KjRgNC40YTRgiA9INCkLtCo0YDQuNGE0YIoIk1pY3Jvc29mdCBTYW5zIFNlcmlmIiwgOS43NSwgKTsNClvQn9C+0LvQtdCS0YvQsdC+0YDQsDI0Pl0NCls80JrQvdC+0L/QutCwMl0NCtCa0L3QvtC/0LrQsDIu0KDQvtC00LjRgtC10LvRjCA9INCk0L7RgNC80LBfMDsNCtCa0L3QvtC/0LrQsDIu0KDQsNC30LzQtdGAID0g0KQu0KDQsNC30LzQtdGAKDE1MCwgMjMpOw0K0JrQvdC+0L/QutCwMi7Qn9C+0YDRj9C00L7QutCe0LHRhdC+0LTQsCA9IDI0Ow0K0JrQvdC+0L/QutCwMi7QndCw0LbQsNGC0LjQtSA9ICLQntGH0LjRgdGC0LjRgtGM0J/QsNGA0LDQvNC10YLRgNGLIjsNCtCa0L3QvtC/0LrQsDIu0J/QvtC70L7QttC10L3QuNC1ID0g0KQu0KLQvtGH0LrQsCg1MjUsIDI5NCk7DQrQmtC90L7Qv9C60LAyLtCi0LXQutGB0YIgPSAi0J7Rh9C40YHRgtC40YLRjCDQv9Cw0YDQsNC80LXRgtGA0YsiOw0K0JrQvdC+0L/QutCwMi7QqNGA0LjRhNGCID0g0KQu0KjRgNC40YTRgigiTWljcm9zb2Z0IFNhbnMgU2VyaWYiLCA5Ljc1LCApOw0KW9Ca0L3QvtC/0LrQsDI+XQ0KWzzQoNCw0LzQutCw0JPRgNGD0L/Qv9GLMV0NCtCg0LDQvNC60LDQk9GA0YPQv9C/0YsxLtCg0L7QtNC40YLQtdC70YwgPSDQpNC+0YDQvNCwXzA7DQrQoNCw0LzQutCw0JPRgNGD0L/Qv9GLMS7QoNCw0LfQvNC10YAgPSDQpC7QoNCw0LfQvNC10YAoNTczLCA4OSk7DQrQoNCw0LzQutCw0JPRgNGD0L/Qv9GLMS7Qn9C+0YDRj9C00L7QutCe0LHRhdC+0LTQsCA9IDI1Ow0K0KDQsNC80LrQsNCT0YDRg9C/0L/RizEu0J/QvtC70L7QttC10L3QuNC1ID0g0KQu0KLQvtGH0LrQsCgzMCwgNTcyKTsNCtCg0LDQvNC60LDQk9GA0YPQv9C/0YsxLtCi0LXQutGB0YIgPSAi0J3QsNGB0LvQtdC00L7QstCw0L3QuNC1IjsNCtCg0LDQvNC60LDQk9GA0YPQv9C/0YsxLtCo0YDQuNGE0YIgPSDQpC7QqNGA0LjRhNGCKCJNaWNyb3NvZnQgU2FucyBTZXJpZiIsIDkuNzUsICk7DQpb0KDQsNC80LrQsNCT0YDRg9C/0L/RizE+XQ0KWzzQndCw0LTQv9C40YHRjDUxXQ0K0J3QsNC00L/QuNGB0Yw1MS7QoNC+0LTQuNGC0LXQu9GMID0g0KDQsNC80LrQsNCT0YDRg9C/0L/RizE7DQrQndCw0LTQv9C40YHRjDUxLtCg0LDQt9C80LXRgCA9INCkLtCg0LDQt9C80LXRgCgxMTMsIDIzKTsNCtCd0LDQtNC/0LjRgdGMNTEu0J/QvtGA0Y/QtNC+0LrQntCx0YXQvtC00LAgPSAyMDsNCtCd0LDQtNC/0LjRgdGMNTEu0J/QvtC70L7QttC10L3QuNC1ID0g0KQu0KLQvtGH0LrQsCg2LCAxOCk7DQrQndCw0LTQv9C40YHRjDUxLtCi0LXQutGB0YIgPSAi0KPQvdCw0YHQu9C10LTQvtCy0LDQvdC+INC+0YIiOw0K0J3QsNC00L/QuNGB0Yw1MS7QqNGA0LjRhNGCID0g0KQu0KjRgNC40YTRgigiTWljcm9zb2Z0IFNhbnMgU2VyaWYiLCA5Ljc1LCApOw0KW9Cd0LDQtNC/0LjRgdGMNTE+XQ0KWzzQn9C+0LvQtdCS0YvQsdC+0YDQsDIzXQ0K0J/QvtC70LXQktGL0LHQvtGA0LAyMy7QoNC+0LTQuNGC0LXQu9GMID0g0KDQsNC80LrQsNCT0YDRg9C/0L/RizE7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDIzLtCg0LDQt9C80LXRgCA9INCkLtCg0LDQt9C80LXRgCgzNTAsIDI0KTsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMjMu0J/QvtGA0Y/QtNC+0LrQntCx0YXQvtC00LAgPSAyMTsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMjMu0JLRi9GB0L7RgtCw0K3Qu9C10LzQtdC90YLQsCA9IDE2Ow0K0J/QvtC70LXQktGL0LHQvtGA0LAyMy7QlNC+0YHRgtGD0L/QvdC+0YHRgtGMID0g0JvQvtC20Yw7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDIzLtCY0L3QtNC10LrRgdCS0YvQsdGA0LDQvdC90L7Qs9C+0JjQt9C80LXQvdC10L0gPSAi0JfQsNC/0L7Qu9C90LjRgtGM0J3QsNGB0LvQtdC00YPQtdC80YvQtdCc0LXRgtC+0LTRiyI7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDIzLtCf0L7Qu9C+0LbQtdC90LjQtSA9INCkLtCi0L7Rh9C60LAoMTI1LCAxOCk7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDIzLtCo0LjRgNC40L3QsNCS0YvQv9Cw0LTQsNGO0YnQtdCz0L7QodC/0LjRgdC60LAgPSA1MTc7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDIzLtCo0YDQuNGE0YIgPSDQpC7QqNGA0LjRhNGCKCJNaWNyb3NvZnQgU2FucyBTZXJpZiIsIDkuNzUsICk7DQpb0J/QvtC70LXQktGL0LHQvtGA0LAyMz5dDQpbPNCd0LDQtNC/0LjRgdGMNTNdDQrQndCw0LTQv9C40YHRjDUzLtCg0L7QtNC40YLQtdC70YwgPSDQoNCw0LzQutCw0JPRgNGD0L/Qv9GLMTsNCtCd0LDQtNC/0LjRgdGMNTMu0KDQsNC30LzQtdGAID0g0KQu0KDQsNC30LzQtdGAKDExMCwgMzYpOw0K0J3QsNC00L/QuNGB0Yw1My7Qn9C+0YDRj9C00L7QutCe0LHRhdC+0LTQsCA9IDIyOw0K0J3QsNC00L/QuNGB0Yw1My7Qn9C+0LvQvtC20LXQvdC40LUgPSDQpC7QotC+0YfQutCwKDksIDUwKTsNCtCd0LDQtNC/0LjRgdGMNTMu0KLQtdC60YHRgiA9ICLQndCw0YHQu9C10LTRg9C10LzRi9C5INC80LXRgtC+0LQiOw0K0J3QsNC00L/QuNGB0Yw1My7QqNGA0LjRhNGCID0g0KQu0KjRgNC40YTRgigiTWljcm9zb2Z0IFNhbnMgU2VyaWYiLCA5Ljc1LCApOw0KW9Cd0LDQtNC/0LjRgdGMNTM+XQ0KWzzQn9C+0LvQtdCS0YvQsdC+0YDQsDI1XQ0K0J/QvtC70LXQktGL0LHQvtGA0LAyNS7QoNC+0LTQuNGC0LXQu9GMID0g0KDQsNC80LrQsNCT0YDRg9C/0L/RizE7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDI1LtCg0LDQt9C80LXRgCA9INCkLtCg0LDQt9C80LXRgCg0MzMsIDI0KTsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMjUu0J/QvtGA0Y/QtNC+0LrQntCx0YXQvtC00LAgPSAyMzsNCtCf0L7Qu9C10JLRi9Cx0L7RgNCwMjUu0JLRi9GB0L7RgtCw0K3Qu9C10LzQtdC90YLQsCA9IDE2Ow0K0J/QvtC70LXQktGL0LHQvtGA0LAyNS7QlNC+0YHRgtGD0L/QvdC+0YHRgtGMID0g0JvQvtC20Yw7DQrQn9C+0LvQtdCS0YvQsdC+0YDQsDI1LtCY0L3QtNC10LrRgdCS0YvQsdGA0LDQvdC90L7Qs9C+0JjQt9C80LXQvdC10L0gPSAi0J3QsNGB0LvQtdC00L7QstCw0YLRjNCc0LXRgtC+0LQiOw0K0J/QvtC70LXQktGL0LHQvtGA0LAyNS7Qn9C+0LvQvtC20LXQvdC40LUgPSDQpC7QotC+0YfQutCwKDEyNSwgNTApOw0K0J/QvtC70LXQktGL0LHQvtGA0LAyNS7QqNC40YDQuNC90LDQktGL0L/QsNC00LDRjtGJ0LXQs9C+0KHQv9C40YHQutCwID0gNDA1Ow0K0J/QvtC70LXQktGL0LHQvtGA0LAyNS7QqNGA0LjRhNGCID0g0KQu0KjRgNC40YTRgigiTWljcm9zb2Z0IFNhbnMgU2VyaWYiLCA5Ljc1LCApOw0KW9Cf0L7Qu9C10JLRi9Cx0L7RgNCwMjU+XQ0KWzzQpNC70LDQttC+0LoxXQ0K0KTQu9Cw0LbQvtC6MS7QoNC+0LTQuNGC0LXQu9GMID0g0KDQsNC80LrQsNCT0YDRg9C/0L/RizE7DQrQpNC70LDQttC+0LoxLtCg0LDQt9C80LXRgCA9INCkLtCg0LDQt9C80LXRgCg3NywgMjQpOw0K0KTQu9Cw0LbQvtC6MS7Qn9C+0YDRj9C00L7QutCe0LHRhdC+0LTQsCA9IDI0Ow0K0KTQu9Cw0LbQvtC6MS7QlNC+0YHRgtGD0L/QvdC+0YHRgtGMID0g0JvQvtC20Yw7DQrQpNC70LDQttC+0LoxLtCf0L7Qu9C+0LbQtdC90LjQtSA9INCkLtCi0L7Rh9C60LAoNDgxLCAyMSk7DQrQpNC70LDQttC+0LoxLtCi0LXQutGB0YIgPSAi0JDQstGC0L7QvNCw0YIiOw0K0KTQu9Cw0LbQvtC6MS7QqNGA0LjRhNGCID0g0KQu0KjRgNC40YTRgigiTWljcm9zb2Z0IFNhbnMgU2VyaWYiLCA5Ljc1LCApOw0KW9Ck0LvQsNC20L7QujE+XQ0KW9Ch0LLQvtC50YHRgtCy0LA+XQ0K";
    ПодключитьВнешнююКомпоненту("C:\444\OneScriptForms\111\OneScriptForms\OneScriptForms\bin\Debug\OneScriptForms.dll");
    Ф = Новый ФормыДляОдноСкрипта();

    Форма_0 = Ф.Форма();
    Форма_0.Отображать = Истина;
    Форма_0.Показать();
    Форма_0.Активизировать();

    Надпись1 = Ф.Надпись();
    Надпись1.Имя = "Надпись1";
    Надпись3 = Ф.Надпись();
    Надпись3.Имя = "Надпись3";
    ПолеВвода3 = Ф.ПолеВвода();
    ПолеВвода3.Имя = "ПолеВвода3";
    Кнопка1 = Ф.Кнопка();
    Кнопка1.Имя = "Кнопка1";
    Надпись4 = Ф.Надпись();
    Надпись4.Имя = "Надпись4";
    Надпись6 = Ф.Надпись();
    Надпись6.Имя = "Надпись6";
    ПолеВвода4 = Ф.ПолеВвода();
    ПолеВвода4.Имя = "ПолеВвода4";
    Надпись7 = Ф.Надпись();
    Надпись7.Имя = "Надпись7";
    ПолеВвода5 = Ф.ПолеВвода();
    ПолеВвода5.Имя = "ПолеВвода5";
    Надпись8 = Ф.Надпись();
    Надпись8.Имя = "Надпись8";
    Надпись9 = Ф.Надпись();
    Надпись9.Имя = "Надпись9";
    ПолеВвода8 = Ф.ПолеВвода();
    ПолеВвода8.Имя = "ПолеВвода8";
    ПанельВкладок1 = Ф.ПанельВкладок();
    ПанельВкладок1.Имя = "ПанельВкладок1";
    Вкладка1 = Ф.Вкладка();
    Вкладка1.Имя = "Вкладка1";
    Вкладка2 = Ф.Вкладка();
    Вкладка2.Имя = "Вкладка2";
    Надпись10 = Ф.Надпись();
    Надпись10.Имя = "Надпись10";
    Вкладка3 = Ф.Вкладка();
    Вкладка3.Имя = "Вкладка3";
    Вкладка4 = Ф.Вкладка();
    Вкладка4.Имя = "Вкладка4";
    Вкладка5 = Ф.Вкладка();
    Вкладка5.Имя = "Вкладка5";
    Вкладка6 = Ф.Вкладка();
    Вкладка6.Имя = "Вкладка6";
    Вкладка7 = Ф.Вкладка();
    Вкладка7.Имя = "Вкладка7";
    Вкладка8 = Ф.Вкладка();
    Вкладка8.Имя = "Вкладка8";
    Вкладка9 = Ф.Вкладка();
    Вкладка9.Имя = "Вкладка9";
    Вкладка10 = Ф.Вкладка();
    Вкладка10.Имя = "Вкладка10";
    Надпись11 = Ф.Надпись();
    Надпись11.Имя = "Надпись11";
    ПолеВвода9 = Ф.ПолеВвода();
    ПолеВвода9.Имя = "ПолеВвода9";
    Надпись12 = Ф.Надпись();
    Надпись12.Имя = "Надпись12";
    Надпись13 = Ф.Надпись();
    Надпись13.Имя = "Надпись13";
    ПолеВыбора1 = Ф.ПолеВыбора();
    ПолеВыбора1.Имя = "ПолеВыбора1";
    ПолеВыбора2 = Ф.ПолеВыбора();
    ПолеВыбора2.Имя = "ПолеВыбора2";
    ПолеВыбора3 = Ф.ПолеВыбора();
    ПолеВыбора3.Имя = "ПолеВыбора3";
    Надпись14 = Ф.Надпись();
    Надпись14.Имя = "Надпись14";
    ПолеВвода10 = Ф.ПолеВвода();
    ПолеВвода10.Имя = "ПолеВвода10";
    ПолеВвода11 = Ф.ПолеВвода();
    ПолеВвода11.Имя = "ПолеВвода11";
    Надпись15 = Ф.Надпись();
    Надпись15.Имя = "Надпись15";
    ПолеВыбора4 = Ф.ПолеВыбора();
    ПолеВыбора4.Имя = "ПолеВыбора4";
    ПолеВыбора5 = Ф.ПолеВыбора();
    ПолеВыбора5.Имя = "ПолеВыбора5";
    Надпись16 = Ф.Надпись();
    Надпись16.Имя = "Надпись16";
    Надпись17 = Ф.Надпись();
    Надпись17.Имя = "Надпись17";
    ПолеВвода12 = Ф.ПолеВвода();
    ПолеВвода12.Имя = "ПолеВвода12";
    Надпись18 = Ф.Надпись();
    Надпись18.Имя = "Надпись18";
    ПолеВвода13 = Ф.ПолеВвода();
    ПолеВвода13.Имя = "ПолеВвода13";
    Надпись19 = Ф.Надпись();
    Надпись19.Имя = "Надпись19";
    ПолеВыбора6 = Ф.ПолеВыбора();
    ПолеВыбора6.Имя = "ПолеВыбора6";
    ПолеВыбора7 = Ф.ПолеВыбора();
    ПолеВыбора7.Имя = "ПолеВыбора7";
    Надпись20 = Ф.Надпись();
    Надпись20.Имя = "Надпись20";
    Надпись21 = Ф.Надпись();
    Надпись21.Имя = "Надпись21";
    ПолеВвода14 = Ф.ПолеВвода();
    ПолеВвода14.Имя = "ПолеВвода14";
    Надпись22 = Ф.Надпись();
    Надпись22.Имя = "Надпись22";
    ПолеВвода15 = Ф.ПолеВвода();
    ПолеВвода15.Имя = "ПолеВвода15";
    Надпись23 = Ф.Надпись();
    Надпись23.Имя = "Надпись23";
    Надпись24 = Ф.Надпись();
    Надпись24.Имя = "Надпись24";
    ПолеВыбора8 = Ф.ПолеВыбора();
    ПолеВыбора8.Имя = "ПолеВыбора8";
    ПолеВвода16 = Ф.ПолеВвода();
    ПолеВвода16.Имя = "ПолеВвода16";
    ПолеВыбора9 = Ф.ПолеВыбора();
    ПолеВыбора9.Имя = "ПолеВыбора9";
    Надпись25 = Ф.Надпись();
    Надпись25.Имя = "Надпись25";
    Надпись26 = Ф.Надпись();
    Надпись26.Имя = "Надпись26";
    ПолеВвода17 = Ф.ПолеВвода();
    ПолеВвода17.Имя = "ПолеВвода17";
    Надпись27 = Ф.Надпись();
    Надпись27.Имя = "Надпись27";
    Надпись28 = Ф.Надпись();
    Надпись28.Имя = "Надпись28";
    ПолеВыбора10 = Ф.ПолеВыбора();
    ПолеВыбора10.Имя = "ПолеВыбора10";
    ПолеВвода18 = Ф.ПолеВвода();
    ПолеВвода18.Имя = "ПолеВвода18";
    ПолеВыбора11 = Ф.ПолеВыбора();
    ПолеВыбора11.Имя = "ПолеВыбора11";
    Надпись29 = Ф.Надпись();
    Надпись29.Имя = "Надпись29";
    Надпись30 = Ф.Надпись();
    Надпись30.Имя = "Надпись30";
    ПолеВвода19 = Ф.ПолеВвода();
    ПолеВвода19.Имя = "ПолеВвода19";
    Надпись31 = Ф.Надпись();
    Надпись31.Имя = "Надпись31";
    Надпись32 = Ф.Надпись();
    Надпись32.Имя = "Надпись32";
    ПолеВыбора12 = Ф.ПолеВыбора();
    ПолеВыбора12.Имя = "ПолеВыбора12";
    ПолеВвода20 = Ф.ПолеВвода();
    ПолеВвода20.Имя = "ПолеВвода20";
    ПолеВыбора13 = Ф.ПолеВыбора();
    ПолеВыбора13.Имя = "ПолеВыбора13";
    Надпись33 = Ф.Надпись();
    Надпись33.Имя = "Надпись33";
    Надпись34 = Ф.Надпись();
    Надпись34.Имя = "Надпись34";
    ПолеВвода21 = Ф.ПолеВвода();
    ПолеВвода21.Имя = "ПолеВвода21";
    Надпись35 = Ф.Надпись();
    Надпись35.Имя = "Надпись35";
    Надпись36 = Ф.Надпись();
    Надпись36.Имя = "Надпись36";
    ПолеВыбора14 = Ф.ПолеВыбора();
    ПолеВыбора14.Имя = "ПолеВыбора14";
    ПолеВвода22 = Ф.ПолеВвода();
    ПолеВвода22.Имя = "ПолеВвода22";
    ПолеВыбора15 = Ф.ПолеВыбора();
    ПолеВыбора15.Имя = "ПолеВыбора15";
    Надпись37 = Ф.Надпись();
    Надпись37.Имя = "Надпись37";
    Надпись38 = Ф.Надпись();
    Надпись38.Имя = "Надпись38";
    ПолеВвода23 = Ф.ПолеВвода();
    ПолеВвода23.Имя = "ПолеВвода23";
    Надпись39 = Ф.Надпись();
    Надпись39.Имя = "Надпись39";
    Надпись40 = Ф.Надпись();
    Надпись40.Имя = "Надпись40";
    ПолеВыбора16 = Ф.ПолеВыбора();
    ПолеВыбора16.Имя = "ПолеВыбора16";
    ПолеВвода24 = Ф.ПолеВвода();
    ПолеВвода24.Имя = "ПолеВвода24";
    ПолеВыбора17 = Ф.ПолеВыбора();
    ПолеВыбора17.Имя = "ПолеВыбора17";
    Надпись41 = Ф.Надпись();
    Надпись41.Имя = "Надпись41";
    Надпись42 = Ф.Надпись();
    Надпись42.Имя = "Надпись42";
    ПолеВвода25 = Ф.ПолеВвода();
    ПолеВвода25.Имя = "ПолеВвода25";
    Надпись43 = Ф.Надпись();
    Надпись43.Имя = "Надпись43";
    Надпись44 = Ф.Надпись();
    Надпись44.Имя = "Надпись44";
    ПолеВыбора18 = Ф.ПолеВыбора();
    ПолеВыбора18.Имя = "ПолеВыбора18";
    ПолеВвода26 = Ф.ПолеВвода();
    ПолеВвода26.Имя = "ПолеВвода26";
    ПолеВыбора19 = Ф.ПолеВыбора();
    ПолеВыбора19.Имя = "ПолеВыбора19";
    Надпись45 = Ф.Надпись();
    Надпись45.Имя = "Надпись45";
    Надпись46 = Ф.Надпись();
    Надпись46.Имя = "Надпись46";
    ПолеВвода27 = Ф.ПолеВвода();
    ПолеВвода27.Имя = "ПолеВвода27";
    Надпись47 = Ф.Надпись();
    Надпись47.Имя = "Надпись47";
    Надпись48 = Ф.Надпись();
    Надпись48.Имя = "Надпись48";
    ПолеВыбора20 = Ф.ПолеВыбора();
    ПолеВыбора20.Имя = "ПолеВыбора20";
    ПолеВвода28 = Ф.ПолеВвода();
    ПолеВвода28.Имя = "ПолеВвода28";
    ПолеВыбора21 = Ф.ПолеВыбора();
    ПолеВыбора21.Имя = "ПолеВыбора21";
    Надпись49 = Ф.Надпись();
    Надпись49.Имя = "Надпись49";
    Надпись50 = Ф.Надпись();
    Надпись50.Имя = "Надпись50";
    ПолеВыбора22 = Ф.ПолеВыбора();
    ПолеВыбора22.Имя = "ПолеВыбора22";
    Надпись51 = Ф.Надпись();
    Надпись51.Имя = "Надпись51";
    ПолеВыбора23 = Ф.ПолеВыбора();
    ПолеВыбора23.Имя = "ПолеВыбора23";
    Надпись52 = Ф.Надпись();
    Надпись52.Имя = "Надпись52";
    ПолеВыбора24 = Ф.ПолеВыбора();
    ПолеВыбора24.Имя = "ПолеВыбора24";
    Кнопка2 = Ф.Кнопка();
    Кнопка2.Имя = "Кнопка2";
    РамкаГруппы1 = Ф.РамкаГруппы();
    РамкаГруппы1.Имя = "РамкаГруппы1";
    Надпись53 = Ф.Надпись();
    Надпись53.Имя = "Надпись53";
    ПолеВыбора25 = Ф.ПолеВыбора();
    ПолеВыбора25.Имя = "ПолеВыбора25";
    Флажок1 = Ф.Флажок();
    Флажок1.Имя = "Флажок1";

    Форма_0.Размер = Ф.Размер(723, 708);
    Форма_0.Текст = "Создание метода Интегратор";
    Форма_0.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    Надпись1.Родитель = Форма_0;
    Надпись1.Размер = Ф.Размер(100, 18);
    Надпись1.ПорядокОбхода = 0;
    Надпись1.Положение = Ф.Точка(26, 9);
    Надпись1.Текст = "Класс";
    Надпись1.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    Надпись3.Родитель = Форма_0;
    Надпись3.Размер = Ф.Размер(123, 19);
    Надпись3.ПорядокОбхода = 3;
    Надпись3.Положение = Ф.Точка(26, 98);
    Надпись3.Текст = "МетодОписание";
    Надпись3.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    ПолеВвода3.Родитель = Форма_0;
    ПолеВвода3.Размер = Ф.Размер(656, 51);
    ПолеВвода3.ПорядокОбхода = 2;
    ПолеВвода3.МногострочныйРежим = Истина;
    ПолеВвода3.Положение = Ф.Точка(26, 120);
    ПолеВвода3.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    Кнопка1.Родитель = Форма_0;
    Кнопка1.Размер = Ф.Размер(73, 39);
    Кнопка1.ПорядокОбхода = 4;
    Кнопка1.Нажатие = Ф.Действие(ЭтотОбъект, "Кн1_Нажатие");
    Кнопка1.Положение = Ф.Точка(609, 618);
    Кнопка1.Текст = "Создать метод";
    Кнопка1.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    Надпись4.Родитель = Форма_0;
    Надпись4.Размер = Ф.Размер(344, 17);
    Надпись4.ПорядокОбхода = 5;
    Надпись4.Положение = Ф.Точка(351, 29);
    Надпись4.Текст = "Выходные данные будут в каталоге ...\НовыеHtml";
    Надпись4.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    Надпись6.Родитель = Форма_0;
    Надпись6.Размер = Ф.Размер(100, 19);
    Надпись6.ПорядокОбхода = 7;
    Надпись6.Положение = Ф.Точка(26, 53);
    Надпись6.Текст = "МетодИмяРус";
    Надпись6.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    ПолеВвода4.Родитель = Форма_0;
    ПолеВвода4.Размер = Ф.Размер(325, 22);
    ПолеВвода4.ПорядокОбхода = 8;
    ПолеВвода4.Положение = Ф.Точка(22, 75);
    ПолеВвода4.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    Надпись7.Родитель = Форма_0;
    Надпись7.Размер = Ф.Размер(100, 18);
    Надпись7.ПорядокОбхода = 9;
    Надпись7.Положение = Ф.Точка(357, 54);
    Надпись7.Текст = "МетодИмяEn";
    Надпись7.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    ПолеВвода5.Родитель = Форма_0;
    ПолеВвода5.Размер = Ф.Размер(325, 22);
    ПолеВвода5.ПорядокОбхода = 10;
    ПолеВвода5.Положение = Ф.Точка(353, 75);
    ПолеВвода5.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    Надпись8.Родитель = Форма_0;
    Надпись8.Размер = Ф.Размер(222, 18);
    Надпись8.ПорядокОбхода = 11;
    Надпись8.Положение = Ф.Точка(26, 174);
    Надпись8.Текст = "ВозвращаемоеЗначениеТип";
    Надпись8.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    Надпись9.Родитель = Форма_0;
    Надпись9.Размер = Ф.Размер(257, 17);
    Надпись9.ПорядокОбхода = 12;
    Надпись9.Положение = Ф.Точка(26, 218);
    Надпись9.Текст = "ВозвращаемоеЗначениеОписание";
    Надпись9.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    ПолеВвода8.Родитель = Форма_0;
    ПолеВвода8.Размер = Ф.Размер(656, 54);
    ПолеВвода8.ПорядокОбхода = 15;
    ПолеВвода8.МногострочныйРежим = Истина;
    ПолеВвода8.Положение = Ф.Точка(26, 238);
    ПолеВвода8.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    ПанельВкладок1.Родитель = Форма_0;
    ПанельВкладок1.Размер = Ф.Размер(656, 212);
    ПанельВкладок1.ПорядокОбхода = 16;
    ПанельВкладок1.Положение = Ф.Точка(26, 323);
    ПанельВкладок1.РазмерЭлемента = Ф.Размер(42, 18);
    ПанельВкладок1.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    Вкладка1.Родитель = ПанельВкладок1;
    Вкладка1.Текст = "0";

    Надпись11.Родитель = Вкладка1;
    Надпись11.Размер = Ф.Размер(100, 14);
    Надпись11.ПорядокОбхода = 0;
    Надпись11.Положение = Ф.Точка(6, 3);
    Надпись11.Текст = "Имя";
    Надпись11.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    ПолеВвода9.Родитель = Вкладка1;
    ПолеВвода9.Размер = Ф.Размер(296, 22);
    ПолеВвода9.ПорядокОбхода = 1;
    ПолеВвода9.Положение = Ф.Точка(6, 20);
    ПолеВвода9.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    Надпись12.Родитель = Вкладка1;
    Надпись12.Размер = Ф.Размер(100, 14);
    Надпись12.ПорядокОбхода = 2;
    Надпись12.Положение = Ф.Точка(325, 3);
    Надпись12.Текст = "Обязательный";
    Надпись12.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    Надпись13.Родитель = Вкладка1;
    Надпись13.Размер = Ф.Размер(100, 16);
    Надпись13.ПорядокОбхода = 3;
    Надпись13.Положение = Ф.Точка(6, 43);
    Надпись13.Текст = "Тип";
    Надпись13.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    ПолеВыбора1.Родитель = Вкладка1;
    ПолеВыбора1.Размер = Ф.Размер(296, 24);
    ПолеВыбора1.ПорядокОбхода = 5;
    ПолеВыбора1.Элементы.Добавить(Ф.ЭлементСписка("обязательный", "обязательный"));
    ПолеВыбора1.Элементы.Добавить(Ф.ЭлементСписка("необязательный", "необязательный"));
    ПолеВыбора1.ВысотаЭлемента = 16;
    ПолеВыбора1.Положение = Ф.Точка(325, 20);
    ПолеВыбора1.Текст = "обязательный";
    ПолеВыбора1.ШиринаВыпадающегоСписка = 296;
    ПолеВыбора1.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    ПолеВыбора3.Родитель = Вкладка1;
    ПолеВыбора3.Размер = Ф.Размер(615, 24);
    ПолеВыбора3.ПорядокОбхода = 6;
    ПолеВыбора3.Элементы.Добавить(Ф.ЭлементСписка("Тип: Булево.", "Тип: Булево."));
    ПолеВыбора3.Элементы.Добавить(Ф.ЭлементСписка("Тип: Строка.", "Тип: Строка."));
    ПолеВыбора3.Элементы.Добавить(Ф.ЭлементСписка("Тип: Число.", "Тип: Число."));
    ПолеВыбора3.Элементы.Добавить(Ф.ЭлементСписка("Тип: Произвольный.", "Тип: Произвольный."));
    ПолеВыбора3.Элементы.Добавить(Ф.ЭлементСписка("йййййййййй   йййййййййй", "йййййййййй   йййййййййй"));
    ПолеВыбора3.ВысотаЭлемента = 16;
    ПолеВыбора3.Положение = Ф.Точка(6, 62);
    ПолеВыбора3.Текст = "Тип: Булево.";
    ПолеВыбора3.ШиринаВыпадающегоСписка = 615;
    ПолеВыбора3.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    Надпись14.Родитель = Вкладка1;
    Надпись14.Размер = Ф.Размер(100, 15);
    Надпись14.ПорядокОбхода = 7;
    Надпись14.Положение = Ф.Точка(6, 86);
    Надпись14.Текст = "Описание";
    Надпись14.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    ПолеВвода10.Родитель = Вкладка1;
    ПолеВвода10.Размер = Ф.Размер(615, 73);
    ПолеВвода10.ПорядокОбхода = 8;
    ПолеВвода10.МногострочныйРежим = Истина;
    ПолеВвода10.Положение = Ф.Точка(6, 104);
    ПолеВвода10.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    Вкладка2.Родитель = ПанельВкладок1;
    Вкладка2.Текст = "1";

    ПолеВвода11.Родитель = Вкладка2;
    ПолеВвода11.Размер = Ф.Размер(615, 73);
    ПолеВвода11.ПорядокОбхода = 26;
    ПолеВвода11.МногострочныйРежим = Истина;
    ПолеВвода11.Положение = Ф.Точка(6, 107);
    ПолеВвода11.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    Надпись15.Родитель = Вкладка2;
    Надпись15.Размер = Ф.Размер(100, 15);
    Надпись15.ПорядокОбхода = 25;
    Надпись15.Положение = Ф.Точка(6, 89);
    Надпись15.Текст = "Описание";
    Надпись15.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    ПолеВыбора4.Родитель = Вкладка2;
    ПолеВыбора4.Размер = Ф.Размер(615, 24);
    ПолеВыбора4.ПорядокОбхода = 24;
    ПолеВыбора4.Элементы.Добавить(Ф.ЭлементСписка("Тип: Булево.", "Тип: Булево."));
    ПолеВыбора4.Элементы.Добавить(Ф.ЭлементСписка("Тип: Строка.", "Тип: Строка."));
    ПолеВыбора4.Элементы.Добавить(Ф.ЭлементСписка("Тип: Число.", "Тип: Число."));
    ПолеВыбора4.Элементы.Добавить(Ф.ЭлементСписка("Тип: Произвольный.", "Тип: Произвольный."));
    ПолеВыбора4.Элементы.Добавить(Ф.ЭлементСписка("йййййййййй   йййййййййй", "йййййййййй   йййййййййй"));
    ПолеВыбора4.ВысотаЭлемента = 16;
    ПолеВыбора4.Положение = Ф.Точка(6, 65);
    ПолеВыбора4.Текст = "йййййййййй   йййййййййй";
    ПолеВыбора4.ШиринаВыпадающегоСписка = 615;
    ПолеВыбора4.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    ПолеВыбора5.Родитель = Вкладка2;
    ПолеВыбора5.Размер = Ф.Размер(296, 24);
    ПолеВыбора5.ПорядокОбхода = 23;
    ПолеВыбора5.Элементы.Добавить(Ф.ЭлементСписка("обязательный", "обязательный"));
    ПолеВыбора5.Элементы.Добавить(Ф.ЭлементСписка("необязательный", "необязательный"));
    ПолеВыбора5.ВысотаЭлемента = 16;
    ПолеВыбора5.Положение = Ф.Точка(325, 23);
    ПолеВыбора5.Текст = "обязательный";
    ПолеВыбора5.ШиринаВыпадающегоСписка = 296;
    ПолеВыбора5.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    Надпись16.Родитель = Вкладка2;
    Надпись16.Размер = Ф.Размер(100, 16);
    Надпись16.ПорядокОбхода = 22;
    Надпись16.Положение = Ф.Точка(6, 46);
    Надпись16.Текст = "Тип";
    Надпись16.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    Надпись17.Родитель = Вкладка2;
    Надпись17.Размер = Ф.Размер(100, 14);
    Надпись17.ПорядокОбхода = 21;
    Надпись17.Положение = Ф.Точка(325, 6);
    Надпись17.Текст = "Обязательный";
    Надпись17.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    ПолеВвода12.Родитель = Вкладка2;
    ПолеВвода12.Размер = Ф.Размер(296, 22);
    ПолеВвода12.ПорядокОбхода = 20;
    ПолеВвода12.Положение = Ф.Точка(6, 23);
    ПолеВвода12.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    Надпись18.Родитель = Вкладка2;
    Надпись18.Размер = Ф.Размер(100, 14);
    Надпись18.ПорядокОбхода = 19;
    Надпись18.Положение = Ф.Точка(6, 6);
    Надпись18.Текст = "Имя";
    Надпись18.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    Вкладка3.Родитель = ПанельВкладок1;
    Вкладка3.Текст = "2";

    ПолеВвода13.Родитель = Вкладка3;
    ПолеВвода13.Размер = Ф.Размер(615, 73);
    ПолеВвода13.ПорядокОбхода = 34;
    ПолеВвода13.МногострочныйРежим = Истина;
    ПолеВвода13.Положение = Ф.Точка(15, 110);
    ПолеВвода13.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    Надпись19.Родитель = Вкладка3;
    Надпись19.Размер = Ф.Размер(100, 15);
    Надпись19.ПорядокОбхода = 33;
    Надпись19.Положение = Ф.Точка(15, 92);
    Надпись19.Текст = "Описание";
    Надпись19.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    ПолеВыбора6.Родитель = Вкладка3;
    ПолеВыбора6.Размер = Ф.Размер(615, 24);
    ПолеВыбора6.ПорядокОбхода = 32;
    ПолеВыбора6.Элементы.Добавить(Ф.ЭлементСписка("Тип: Булево.", "Тип: Булево."));
    ПолеВыбора6.Элементы.Добавить(Ф.ЭлементСписка("Тип: Строка.", "Тип: Строка."));
    ПолеВыбора6.Элементы.Добавить(Ф.ЭлементСписка("Тип: Число.", "Тип: Число."));
    ПолеВыбора6.Элементы.Добавить(Ф.ЭлементСписка("Тип: Произвольный.", "Тип: Произвольный."));
    ПолеВыбора6.Элементы.Добавить(Ф.ЭлементСписка("йййййййййй   йййййййййй", "йййййййййй   йййййййййй"));
    ПолеВыбора6.ВысотаЭлемента = 16;
    ПолеВыбора6.Положение = Ф.Точка(15, 68);
    ПолеВыбора6.Текст = "йййййййййй   йййййййййй";
    ПолеВыбора6.ШиринаВыпадающегоСписка = 615;
    ПолеВыбора6.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    ПолеВыбора7.Родитель = Вкладка3;
    ПолеВыбора7.Размер = Ф.Размер(296, 24);
    ПолеВыбора7.ПорядокОбхода = 31;
    ПолеВыбора7.Элементы.Добавить(Ф.ЭлементСписка("обязательный", "обязательный"));
    ПолеВыбора7.Элементы.Добавить(Ф.ЭлементСписка("необязательный", "необязательный"));
    ПолеВыбора7.ВысотаЭлемента = 16;
    ПолеВыбора7.Положение = Ф.Точка(334, 26);
    ПолеВыбора7.Текст = "обязательный";
    ПолеВыбора7.ШиринаВыпадающегоСписка = 296;
    ПолеВыбора7.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    Надпись20.Родитель = Вкладка3;
    Надпись20.Размер = Ф.Размер(100, 16);
    Надпись20.ПорядокОбхода = 30;
    Надпись20.Положение = Ф.Точка(15, 49);
    Надпись20.Текст = "Тип";
    Надпись20.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    Надпись21.Родитель = Вкладка3;
    Надпись21.Размер = Ф.Размер(100, 14);
    Надпись21.ПорядокОбхода = 29;
    Надпись21.Положение = Ф.Точка(334, 9);
    Надпись21.Текст = "Обязательный";
    Надпись21.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    ПолеВвода14.Родитель = Вкладка3;
    ПолеВвода14.Размер = Ф.Размер(296, 22);
    ПолеВвода14.ПорядокОбхода = 28;
    ПолеВвода14.Положение = Ф.Точка(15, 26);
    ПолеВвода14.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    Надпись22.Родитель = Вкладка3;
    Надпись22.Размер = Ф.Размер(100, 14);
    Надпись22.ПорядокОбхода = 27;
    Надпись22.Положение = Ф.Точка(15, 9);
    Надпись22.Текст = "Имя";
    Надпись22.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    Вкладка4.Родитель = ПанельВкладок1;
    Вкладка4.Текст = "3";

    ПолеВвода15.Родитель = Вкладка4;
    ПолеВвода15.Размер = Ф.Размер(615, 73);
    ПолеВвода15.ПорядокОбхода = 42;
    ПолеВвода15.МногострочныйРежим = Истина;
    ПолеВвода15.Положение = Ф.Точка(18, 110);
    ПолеВвода15.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    Надпись23.Родитель = Вкладка4;
    Надпись23.Размер = Ф.Размер(100, 15);
    Надпись23.ПорядокОбхода = 41;
    Надпись23.Положение = Ф.Точка(18, 92);
    Надпись23.Текст = "Описание";
    Надпись23.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    Надпись24.Родитель = Вкладка4;
    Надпись24.Размер = Ф.Размер(100, 14);
    Надпись24.ПорядокОбхода = 35;
    Надпись24.Положение = Ф.Точка(18, 9);
    Надпись24.Текст = "Имя";
    Надпись24.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    ПолеВыбора8.Родитель = Вкладка4;
    ПолеВыбора8.Размер = Ф.Размер(615, 24);
    ПолеВыбора8.ПорядокОбхода = 40;
    ПолеВыбора8.Элементы.Добавить(Ф.ЭлементСписка("Тип: Булево.", "Тип: Булево."));
    ПолеВыбора8.Элементы.Добавить(Ф.ЭлементСписка("Тип: Строка.", "Тип: Строка."));
    ПолеВыбора8.Элементы.Добавить(Ф.ЭлементСписка("Тип: Число.", "Тип: Число."));
    ПолеВыбора8.Элементы.Добавить(Ф.ЭлементСписка("Тип: Произвольный.", "Тип: Произвольный."));
    ПолеВыбора8.Элементы.Добавить(Ф.ЭлементСписка("йййййййййй   йййййййййй", "йййййййййй   йййййййййй"));
    ПолеВыбора8.ВысотаЭлемента = 16;
    ПолеВыбора8.Положение = Ф.Точка(18, 68);
    ПолеВыбора8.Текст = "йййййййййй   йййййййййй";
    ПолеВыбора8.ШиринаВыпадающегоСписка = 615;
    ПолеВыбора8.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    ПолеВвода16.Родитель = Вкладка4;
    ПолеВвода16.Размер = Ф.Размер(296, 22);
    ПолеВвода16.ПорядокОбхода = 36;
    ПолеВвода16.Положение = Ф.Точка(18, 26);
    ПолеВвода16.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    ПолеВыбора9.Родитель = Вкладка4;
    ПолеВыбора9.Размер = Ф.Размер(296, 24);
    ПолеВыбора9.ПорядокОбхода = 39;
    ПолеВыбора9.Элементы.Добавить(Ф.ЭлементСписка("обязательный", "обязательный"));
    ПолеВыбора9.Элементы.Добавить(Ф.ЭлементСписка("необязательный", "необязательный"));
    ПолеВыбора9.ВысотаЭлемента = 16;
    ПолеВыбора9.Положение = Ф.Точка(337, 26);
    ПолеВыбора9.Текст = "обязательный";
    ПолеВыбора9.ШиринаВыпадающегоСписка = 296;
    ПолеВыбора9.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    Надпись25.Родитель = Вкладка4;
    Надпись25.Размер = Ф.Размер(100, 14);
    Надпись25.ПорядокОбхода = 37;
    Надпись25.Положение = Ф.Точка(337, 9);
    Надпись25.Текст = "Обязательный";
    Надпись25.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    Надпись26.Родитель = Вкладка4;
    Надпись26.Размер = Ф.Размер(100, 16);
    Надпись26.ПорядокОбхода = 38;
    Надпись26.Положение = Ф.Точка(18, 49);
    Надпись26.Текст = "Тип";
    Надпись26.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    Вкладка5.Родитель = ПанельВкладок1;
    Вкладка5.Текст = "4";

    ПолеВвода17.Родитель = Вкладка5;
    ПолеВвода17.Размер = Ф.Размер(615, 73);
    ПолеВвода17.ПорядокОбхода = 42;
    ПолеВвода17.МногострочныйРежим = Истина;
    ПолеВвода17.Положение = Ф.Точка(17, 110);
    ПолеВвода17.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    Надпись27.Родитель = Вкладка5;
    Надпись27.Размер = Ф.Размер(100, 15);
    Надпись27.ПорядокОбхода = 41;
    Надпись27.Положение = Ф.Точка(17, 92);
    Надпись27.Текст = "Описание";
    Надпись27.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    Надпись28.Родитель = Вкладка5;
    Надпись28.Размер = Ф.Размер(100, 14);
    Надпись28.ПорядокОбхода = 35;
    Надпись28.Положение = Ф.Точка(17, 9);
    Надпись28.Текст = "Имя";
    Надпись28.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    ПолеВыбора10.Родитель = Вкладка5;
    ПолеВыбора10.Размер = Ф.Размер(615, 24);
    ПолеВыбора10.ПорядокОбхода = 40;
    ПолеВыбора10.Элементы.Добавить(Ф.ЭлементСписка("Тип: Булево.", "Тип: Булево."));
    ПолеВыбора10.Элементы.Добавить(Ф.ЭлементСписка("Тип: Строка.", "Тип: Строка."));
    ПолеВыбора10.Элементы.Добавить(Ф.ЭлементСписка("Тип: Число.", "Тип: Число."));
    ПолеВыбора10.Элементы.Добавить(Ф.ЭлементСписка("Тип: Произвольный.", "Тип: Произвольный."));
    ПолеВыбора10.Элементы.Добавить(Ф.ЭлементСписка("йййййййййй   йййййййййй", "йййййййййй   йййййййййй"));
    ПолеВыбора10.ВысотаЭлемента = 16;
    ПолеВыбора10.Положение = Ф.Точка(17, 68);
    ПолеВыбора10.Текст = "йййййййййй   йййййййййй";
    ПолеВыбора10.ШиринаВыпадающегоСписка = 615;
    ПолеВыбора10.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    ПолеВвода18.Родитель = Вкладка5;
    ПолеВвода18.Размер = Ф.Размер(296, 22);
    ПолеВвода18.ПорядокОбхода = 36;
    ПолеВвода18.Положение = Ф.Точка(17, 26);
    ПолеВвода18.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    ПолеВыбора11.Родитель = Вкладка5;
    ПолеВыбора11.Размер = Ф.Размер(296, 24);
    ПолеВыбора11.ПорядокОбхода = 39;
    ПолеВыбора11.Элементы.Добавить(Ф.ЭлементСписка("обязательный", "обязательный"));
    ПолеВыбора11.Элементы.Добавить(Ф.ЭлементСписка("необязательный", "необязательный"));
    ПолеВыбора11.ВысотаЭлемента = 16;
    ПолеВыбора11.Положение = Ф.Точка(336, 26);
    ПолеВыбора11.Текст = "обязательный";
    ПолеВыбора11.ШиринаВыпадающегоСписка = 296;
    ПолеВыбора11.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    Надпись29.Родитель = Вкладка5;
    Надпись29.Размер = Ф.Размер(100, 14);
    Надпись29.ПорядокОбхода = 37;
    Надпись29.Положение = Ф.Точка(336, 9);
    Надпись29.Текст = "Обязательный";
    Надпись29.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    Надпись30.Родитель = Вкладка5;
    Надпись30.Размер = Ф.Размер(100, 16);
    Надпись30.ПорядокОбхода = 38;
    Надпись30.Положение = Ф.Точка(17, 49);
    Надпись30.Текст = "Тип";
    Надпись30.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    Вкладка6.Родитель = ПанельВкладок1;
    Вкладка6.Текст = "5";

    ПолеВвода19.Родитель = Вкладка6;
    ПолеВвода19.Размер = Ф.Размер(615, 73);
    ПолеВвода19.ПорядокОбхода = 42;
    ПолеВвода19.МногострочныйРежим = Истина;
    ПолеВвода19.Положение = Ф.Точка(19, 110);
    ПолеВвода19.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    Надпись31.Родитель = Вкладка6;
    Надпись31.Размер = Ф.Размер(100, 15);
    Надпись31.ПорядокОбхода = 41;
    Надпись31.Положение = Ф.Точка(19, 92);
    Надпись31.Текст = "Описание";
    Надпись31.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    Надпись32.Родитель = Вкладка6;
    Надпись32.Размер = Ф.Размер(100, 14);
    Надпись32.ПорядокОбхода = 35;
    Надпись32.Положение = Ф.Точка(19, 9);
    Надпись32.Текст = "Имя";
    Надпись32.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    ПолеВыбора12.Родитель = Вкладка6;
    ПолеВыбора12.Размер = Ф.Размер(615, 24);
    ПолеВыбора12.ПорядокОбхода = 40;
    ПолеВыбора12.Элементы.Добавить(Ф.ЭлементСписка("Тип: Булево.", "Тип: Булево."));
    ПолеВыбора12.Элементы.Добавить(Ф.ЭлементСписка("Тип: Строка.", "Тип: Строка."));
    ПолеВыбора12.Элементы.Добавить(Ф.ЭлементСписка("Тип: Число.", "Тип: Число."));
    ПолеВыбора12.Элементы.Добавить(Ф.ЭлементСписка("Тип: Произвольный.", "Тип: Произвольный."));
    ПолеВыбора12.Элементы.Добавить(Ф.ЭлементСписка("йййййййййй   йййййййййй", "йййййййййй   йййййййййй"));
    ПолеВыбора12.ВысотаЭлемента = 16;
    ПолеВыбора12.Положение = Ф.Точка(19, 68);
    ПолеВыбора12.Текст = "йййййййййй   йййййййййй";
    ПолеВыбора12.ШиринаВыпадающегоСписка = 615;
    ПолеВыбора12.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    ПолеВвода20.Родитель = Вкладка6;
    ПолеВвода20.Размер = Ф.Размер(296, 22);
    ПолеВвода20.ПорядокОбхода = 36;
    ПолеВвода20.Положение = Ф.Точка(19, 26);
    ПолеВвода20.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    ПолеВыбора13.Родитель = Вкладка6;
    ПолеВыбора13.Размер = Ф.Размер(296, 24);
    ПолеВыбора13.ПорядокОбхода = 39;
    ПолеВыбора13.Элементы.Добавить(Ф.ЭлементСписка("обязательный", "обязательный"));
    ПолеВыбора13.Элементы.Добавить(Ф.ЭлементСписка("необязательный", "необязательный"));
    ПолеВыбора13.ВысотаЭлемента = 16;
    ПолеВыбора13.Положение = Ф.Точка(338, 26);
    ПолеВыбора13.Текст = "обязательный";
    ПолеВыбора13.ШиринаВыпадающегоСписка = 296;
    ПолеВыбора13.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    Надпись33.Родитель = Вкладка6;
    Надпись33.Размер = Ф.Размер(100, 14);
    Надпись33.ПорядокОбхода = 37;
    Надпись33.Положение = Ф.Точка(338, 9);
    Надпись33.Текст = "Обязательный";
    Надпись33.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    Надпись34.Родитель = Вкладка6;
    Надпись34.Размер = Ф.Размер(100, 16);
    Надпись34.ПорядокОбхода = 38;
    Надпись34.Положение = Ф.Точка(19, 49);
    Надпись34.Текст = "Тип";
    Надпись34.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    Вкладка7.Родитель = ПанельВкладок1;
    Вкладка7.Текст = "6";

    ПолеВвода21.Родитель = Вкладка7;
    ПолеВвода21.Размер = Ф.Размер(615, 73);
    ПолеВвода21.ПорядокОбхода = 42;
    ПолеВвода21.МногострочныйРежим = Истина;
    ПолеВвода21.Положение = Ф.Точка(16, 110);
    ПолеВвода21.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    Надпись35.Родитель = Вкладка7;
    Надпись35.Размер = Ф.Размер(100, 15);
    Надпись35.ПорядокОбхода = 41;
    Надпись35.Положение = Ф.Точка(16, 92);
    Надпись35.Текст = "Описание";
    Надпись35.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    Надпись36.Родитель = Вкладка7;
    Надпись36.Размер = Ф.Размер(100, 14);
    Надпись36.ПорядокОбхода = 35;
    Надпись36.Положение = Ф.Точка(16, 9);
    Надпись36.Текст = "Имя";
    Надпись36.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    ПолеВыбора14.Родитель = Вкладка7;
    ПолеВыбора14.Размер = Ф.Размер(615, 24);
    ПолеВыбора14.ПорядокОбхода = 40;
    ПолеВыбора14.Элементы.Добавить(Ф.ЭлементСписка("Тип: Булево.", "Тип: Булево."));
    ПолеВыбора14.Элементы.Добавить(Ф.ЭлементСписка("Тип: Строка.", "Тип: Строка."));
    ПолеВыбора14.Элементы.Добавить(Ф.ЭлементСписка("Тип: Число.", "Тип: Число."));
    ПолеВыбора14.Элементы.Добавить(Ф.ЭлементСписка("Тип: Произвольный.", "Тип: Произвольный."));
    ПолеВыбора14.Элементы.Добавить(Ф.ЭлементСписка("йййййййййй   йййййййййй", "йййййййййй   йййййййййй"));
    ПолеВыбора14.ВысотаЭлемента = 16;
    ПолеВыбора14.Положение = Ф.Точка(16, 68);
    ПолеВыбора14.Текст = "йййййййййй   йййййййййй";
    ПолеВыбора14.ШиринаВыпадающегоСписка = 615;
    ПолеВыбора14.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    ПолеВвода22.Родитель = Вкладка7;
    ПолеВвода22.Размер = Ф.Размер(296, 22);
    ПолеВвода22.ПорядокОбхода = 36;
    ПолеВвода22.Положение = Ф.Точка(16, 26);
    ПолеВвода22.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    ПолеВыбора15.Родитель = Вкладка7;
    ПолеВыбора15.Размер = Ф.Размер(296, 24);
    ПолеВыбора15.ПорядокОбхода = 39;
    ПолеВыбора15.Элементы.Добавить(Ф.ЭлементСписка("обязательный", "обязательный"));
    ПолеВыбора15.Элементы.Добавить(Ф.ЭлементСписка("необязательный", "необязательный"));
    ПолеВыбора15.ВысотаЭлемента = 16;
    ПолеВыбора15.Положение = Ф.Точка(335, 26);
    ПолеВыбора15.Текст = "обязательный";
    ПолеВыбора15.ШиринаВыпадающегоСписка = 296;
    ПолеВыбора15.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    Надпись37.Родитель = Вкладка7;
    Надпись37.Размер = Ф.Размер(100, 14);
    Надпись37.ПорядокОбхода = 37;
    Надпись37.Положение = Ф.Точка(335, 9);
    Надпись37.Текст = "Обязательный";
    Надпись37.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    Надпись38.Родитель = Вкладка7;
    Надпись38.Размер = Ф.Размер(100, 16);
    Надпись38.ПорядокОбхода = 38;
    Надпись38.Положение = Ф.Точка(16, 49);
    Надпись38.Текст = "Тип";
    Надпись38.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    Вкладка8.Родитель = ПанельВкладок1;
    Вкладка8.Текст = "7";

    ПолеВвода23.Родитель = Вкладка8;
    ПолеВвода23.Размер = Ф.Размер(615, 73);
    ПолеВвода23.ПорядокОбхода = 42;
    ПолеВвода23.МногострочныйРежим = Истина;
    ПолеВвода23.Положение = Ф.Точка(18, 110);
    ПолеВвода23.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    Надпись39.Родитель = Вкладка8;
    Надпись39.Размер = Ф.Размер(100, 15);
    Надпись39.ПорядокОбхода = 41;
    Надпись39.Положение = Ф.Точка(18, 92);
    Надпись39.Текст = "Описание";
    Надпись39.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    Надпись40.Родитель = Вкладка8;
    Надпись40.Размер = Ф.Размер(100, 14);
    Надпись40.ПорядокОбхода = 35;
    Надпись40.Положение = Ф.Точка(18, 9);
    Надпись40.Текст = "Имя";
    Надпись40.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    ПолеВыбора16.Родитель = Вкладка8;
    ПолеВыбора16.Размер = Ф.Размер(615, 24);
    ПолеВыбора16.ПорядокОбхода = 40;
    ПолеВыбора16.Элементы.Добавить(Ф.ЭлементСписка("Тип: Булево.", "Тип: Булево."));
    ПолеВыбора16.Элементы.Добавить(Ф.ЭлементСписка("Тип: Строка.", "Тип: Строка."));
    ПолеВыбора16.Элементы.Добавить(Ф.ЭлементСписка("Тип: Число.", "Тип: Число."));
    ПолеВыбора16.Элементы.Добавить(Ф.ЭлементСписка("Тип: Произвольный.", "Тип: Произвольный."));
    ПолеВыбора16.Элементы.Добавить(Ф.ЭлементСписка("йййййййййй   йййййййййй", "йййййййййй   йййййййййй"));
    ПолеВыбора16.ВысотаЭлемента = 16;
    ПолеВыбора16.Положение = Ф.Точка(18, 68);
    ПолеВыбора16.Текст = "йййййййййй   йййййййййй";
    ПолеВыбора16.ШиринаВыпадающегоСписка = 615;
    ПолеВыбора16.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    ПолеВвода24.Родитель = Вкладка8;
    ПолеВвода24.Размер = Ф.Размер(296, 22);
    ПолеВвода24.ПорядокОбхода = 36;
    ПолеВвода24.Положение = Ф.Точка(18, 26);
    ПолеВвода24.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    ПолеВыбора17.Родитель = Вкладка8;
    ПолеВыбора17.Размер = Ф.Размер(296, 24);
    ПолеВыбора17.ПорядокОбхода = 39;
    ПолеВыбора17.Элементы.Добавить(Ф.ЭлементСписка("обязательный", "обязательный"));
    ПолеВыбора17.Элементы.Добавить(Ф.ЭлементСписка("необязательный", "необязательный"));
    ПолеВыбора17.ВысотаЭлемента = 16;
    ПолеВыбора17.Положение = Ф.Точка(337, 26);
    ПолеВыбора17.Текст = "обязательный";
    ПолеВыбора17.ШиринаВыпадающегоСписка = 296;
    ПолеВыбора17.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    Надпись41.Родитель = Вкладка8;
    Надпись41.Размер = Ф.Размер(100, 14);
    Надпись41.ПорядокОбхода = 37;
    Надпись41.Положение = Ф.Точка(337, 9);
    Надпись41.Текст = "Обязательный";
    Надпись41.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    Надпись42.Родитель = Вкладка8;
    Надпись42.Размер = Ф.Размер(100, 16);
    Надпись42.ПорядокОбхода = 38;
    Надпись42.Положение = Ф.Точка(18, 49);
    Надпись42.Текст = "Тип";
    Надпись42.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    Вкладка9.Родитель = ПанельВкладок1;
    Вкладка9.Текст = "8";

    ПолеВвода25.Родитель = Вкладка9;
    ПолеВвода25.Размер = Ф.Размер(615, 73);
    ПолеВвода25.ПорядокОбхода = 42;
    ПолеВвода25.МногострочныйРежим = Истина;
    ПолеВвода25.Положение = Ф.Точка(18, 110);
    ПолеВвода25.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    Надпись43.Родитель = Вкладка9;
    Надпись43.Размер = Ф.Размер(100, 15);
    Надпись43.ПорядокОбхода = 41;
    Надпись43.Положение = Ф.Точка(18, 92);
    Надпись43.Текст = "Описание";
    Надпись43.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    Надпись44.Родитель = Вкладка9;
    Надпись44.Размер = Ф.Размер(100, 14);
    Надпись44.ПорядокОбхода = 35;
    Надпись44.Положение = Ф.Точка(18, 9);
    Надпись44.Текст = "Имя";
    Надпись44.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    ПолеВыбора18.Родитель = Вкладка9;
    ПолеВыбора18.Размер = Ф.Размер(615, 24);
    ПолеВыбора18.ПорядокОбхода = 40;
    ПолеВыбора18.Элементы.Добавить(Ф.ЭлементСписка("Тип: Булево.", "Тип: Булево."));
    ПолеВыбора18.Элементы.Добавить(Ф.ЭлементСписка("Тип: Строка.", "Тип: Строка."));
    ПолеВыбора18.Элементы.Добавить(Ф.ЭлементСписка("Тип: Число.", "Тип: Число."));
    ПолеВыбора18.Элементы.Добавить(Ф.ЭлементСписка("Тип: Произвольный.", "Тип: Произвольный."));
    ПолеВыбора18.Элементы.Добавить(Ф.ЭлементСписка("йййййййййй   йййййййййй", "йййййййййй   йййййййййй"));
    ПолеВыбора18.ВысотаЭлемента = 16;
    ПолеВыбора18.Положение = Ф.Точка(18, 68);
    ПолеВыбора18.Текст = "йййййййййй   йййййййййй";
    ПолеВыбора18.ШиринаВыпадающегоСписка = 615;
    ПолеВыбора18.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    ПолеВвода26.Родитель = Вкладка9;
    ПолеВвода26.Размер = Ф.Размер(296, 22);
    ПолеВвода26.ПорядокОбхода = 36;
    ПолеВвода26.Положение = Ф.Точка(18, 26);
    ПолеВвода26.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    ПолеВыбора19.Родитель = Вкладка9;
    ПолеВыбора19.Размер = Ф.Размер(296, 24);
    ПолеВыбора19.ПорядокОбхода = 39;
    ПолеВыбора19.Элементы.Добавить(Ф.ЭлементСписка("обязательный", "обязательный"));
    ПолеВыбора19.Элементы.Добавить(Ф.ЭлементСписка("необязательный", "необязательный"));
    ПолеВыбора19.ВысотаЭлемента = 16;
    ПолеВыбора19.Положение = Ф.Точка(337, 26);
    ПолеВыбора19.Текст = "обязательный";
    ПолеВыбора19.ШиринаВыпадающегоСписка = 296;
    ПолеВыбора19.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    Надпись45.Родитель = Вкладка9;
    Надпись45.Размер = Ф.Размер(100, 14);
    Надпись45.ПорядокОбхода = 37;
    Надпись45.Положение = Ф.Точка(337, 9);
    Надпись45.Текст = "Обязательный";
    Надпись45.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    Надпись46.Родитель = Вкладка9;
    Надпись46.Размер = Ф.Размер(100, 16);
    Надпись46.ПорядокОбхода = 38;
    Надпись46.Положение = Ф.Точка(18, 49);
    Надпись46.Текст = "Тип";
    Надпись46.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    Вкладка10.Родитель = ПанельВкладок1;
    Вкладка10.Текст = "9";

    ПолеВвода27.Родитель = Вкладка10;
    ПолеВвода27.Размер = Ф.Размер(615, 73);
    ПолеВвода27.ПорядокОбхода = 42;
    ПолеВвода27.МногострочныйРежим = Истина;
    ПолеВвода27.Положение = Ф.Точка(19, 110);
    ПолеВвода27.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    Надпись47.Родитель = Вкладка10;
    Надпись47.Размер = Ф.Размер(100, 15);
    Надпись47.ПорядокОбхода = 41;
    Надпись47.Положение = Ф.Точка(19, 92);
    Надпись47.Текст = "Описание";
    Надпись47.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    Надпись48.Родитель = Вкладка10;
    Надпись48.Размер = Ф.Размер(100, 14);
    Надпись48.ПорядокОбхода = 35;
    Надпись48.Положение = Ф.Точка(19, 9);
    Надпись48.Текст = "Имя";
    Надпись48.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    ПолеВыбора20.Родитель = Вкладка10;
    ПолеВыбора20.Размер = Ф.Размер(615, 24);
    ПолеВыбора20.ПорядокОбхода = 40;
    ПолеВыбора20.Элементы.Добавить(Ф.ЭлементСписка("Тип: Булево.", "Тип: Булево."));
    ПолеВыбора20.Элементы.Добавить(Ф.ЭлементСписка("Тип: Строка.", "Тип: Строка."));
    ПолеВыбора20.Элементы.Добавить(Ф.ЭлементСписка("Тип: Число.", "Тип: Число."));
    ПолеВыбора20.Элементы.Добавить(Ф.ЭлементСписка("Тип: Произвольный.", "Тип: Произвольный."));
    ПолеВыбора20.Элементы.Добавить(Ф.ЭлементСписка("йййййййййй   йййййййййй", "йййййййййй   йййййййййй"));
    ПолеВыбора20.ВысотаЭлемента = 16;
    ПолеВыбора20.Положение = Ф.Точка(19, 68);
    ПолеВыбора20.Текст = "йййййййййй   йййййййййй";
    ПолеВыбора20.ШиринаВыпадающегоСписка = 615;
    ПолеВыбора20.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    ПолеВвода28.Родитель = Вкладка10;
    ПолеВвода28.Размер = Ф.Размер(296, 22);
    ПолеВвода28.ПорядокОбхода = 36;
    ПолеВвода28.Положение = Ф.Точка(19, 26);
    ПолеВвода28.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    ПолеВыбора21.Родитель = Вкладка10;
    ПолеВыбора21.Размер = Ф.Размер(296, 24);
    ПолеВыбора21.ПорядокОбхода = 39;
    ПолеВыбора21.Элементы.Добавить(Ф.ЭлементСписка("обязательный", "обязательный"));
    ПолеВыбора21.Элементы.Добавить(Ф.ЭлементСписка("необязательный", "необязательный"));
    ПолеВыбора21.ВысотаЭлемента = 16;
    ПолеВыбора21.Положение = Ф.Точка(338, 26);
    ПолеВыбора21.Текст = "обязательный";
    ПолеВыбора21.ШиринаВыпадающегоСписка = 296;
    ПолеВыбора21.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    Надпись49.Родитель = Вкладка10;
    Надпись49.Размер = Ф.Размер(100, 14);
    Надпись49.ПорядокОбхода = 37;
    Надпись49.Положение = Ф.Точка(338, 9);
    Надпись49.Текст = "Обязательный";
    Надпись49.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    Надпись50.Родитель = Вкладка10;
    Надпись50.Размер = Ф.Размер(100, 16);
    Надпись50.ПорядокОбхода = 38;
    Надпись50.Положение = Ф.Точка(19, 49);
    Надпись50.Текст = "Тип";
    Надпись50.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    Надпись10.Родитель = Форма_0;
    Надпись10.Размер = Ф.Размер(100, 17);
    Надпись10.ПорядокОбхода = 17;
    Надпись10.Положение = Ф.Точка(26, 300);
    Надпись10.Текст = "Параметры";
    Надпись10.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    ПолеВыбора2.Родитель = Форма_0;
    ПолеВыбора2.Размер = Ф.Размер(656, 24);
    ПолеВыбора2.ПорядокОбхода = 18;
    ПолеВыбора2.Элементы.Добавить(Ф.ЭлементСписка("Тип: Булево.", "Тип: Булево."));
    ПолеВыбора2.Элементы.Добавить(Ф.ЭлементСписка("Тип: Строка.", "Тип: Строка."));
    ПолеВыбора2.Элементы.Добавить(Ф.ЭлементСписка("Тип: Число.", "Тип: Число."));
    ПолеВыбора2.Элементы.Добавить(Ф.ЭлементСписка("Тип: Произвольный.", "Тип: Произвольный."));
    ПолеВыбора2.Элементы.Добавить(Ф.ЭлементСписка("йййййййййй   йййййййййй", "йййййййййй   йййййййййй"));
    ПолеВыбора2.ВысотаЭлемента = 16;
    ПолеВыбора2.Положение = Ф.Точка(26, 194);
    ПолеВыбора2.Текст = "Тип: Булево.";
    ПолеВыбора2.ШиринаВыпадающегоСписка = 656;
    ПолеВыбора2.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    ПолеВыбора22.Родитель = Форма_0;
    ПолеВыбора22.Размер = Ф.Размер(323, 24);
    ПолеВыбора22.ПорядокОбхода = 19;
    ПолеВыбора22.ВысотаЭлемента = 16;
    ПолеВыбора22.Положение = Ф.Точка(22, 26);
    ПолеВыбора22.ШиринаВыпадающегоСписка = 323;
    ПолеВыбора22.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    Надпись52.Родитель = Форма_0;
    Надпись52.Размер = Ф.Размер(132, 23);
    Надпись52.ПорядокОбхода = 22;
    Надпись52.Положение = Ф.Точка(26, 545);
    Надпись52.Текст = "Копируемый метод";
    Надпись52.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    ПолеВыбора24.Родитель = Форма_0;
    ПолеВыбора24.Размер = Ф.Размер(395, 24);
    ПолеВыбора24.ПорядокОбхода = 23;
    ПолеВыбора24.ВысотаЭлемента = 16;
    ПолеВыбора24.Доступность = Ложь;
    ПолеВыбора24.ИндексВыбранногоИзменен = Ф.Действие(ЭтотОбъект, "КопироватьМетод");
    ПолеВыбора24.Положение = Ф.Точка(165, 542);
    ПолеВыбора24.ШиринаВыпадающегоСписка = 517;
    ПолеВыбора24.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    Кнопка2.Родитель = Форма_0;
    Кнопка2.Размер = Ф.Размер(150, 23);
    Кнопка2.ПорядокОбхода = 24;
    Кнопка2.Нажатие = Ф.Действие(ЭтотОбъект, "ОчиститьПараметры");
    Кнопка2.Положение = Ф.Точка(525, 294);
    Кнопка2.Текст = "Очистить параметры";
    Кнопка2.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    РамкаГруппы1.Родитель = Форма_0;
    РамкаГруппы1.Размер = Ф.Размер(573, 89);
    РамкаГруппы1.ПорядокОбхода = 25;
    РамкаГруппы1.Положение = Ф.Точка(30, 572);
    РамкаГруппы1.Текст = "Наследование";
    РамкаГруппы1.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    Надпись51.Родитель = РамкаГруппы1;
    Надпись51.Размер = Ф.Размер(113, 23);
    Надпись51.ПорядокОбхода = 20;
    Надпись51.Положение = Ф.Точка(6, 18);
    Надпись51.Текст = "Унаследовано от";
    Надпись51.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    ПолеВыбора23.Родитель = РамкаГруппы1;
    ПолеВыбора23.Размер = Ф.Размер(350, 24);
    ПолеВыбора23.ПорядокОбхода = 21;
    ПолеВыбора23.ВысотаЭлемента = 16;
    ПолеВыбора23.Доступность = Ложь;
    ПолеВыбора23.ИндексВыбранногоИзменен = Ф.Действие(ЭтотОбъект, "ЗаполнитьНаследуемыеМетоды");
    ПолеВыбора23.Положение = Ф.Точка(125, 18);
    ПолеВыбора23.ШиринаВыпадающегоСписка = 517;
    ПолеВыбора23.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    Надпись53.Родитель = РамкаГруппы1;
    Надпись53.Размер = Ф.Размер(110, 36);
    Надпись53.ПорядокОбхода = 22;
    Надпись53.Положение = Ф.Точка(9, 50);
    Надпись53.Текст = "Наследуемый метод";
    Надпись53.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    ПолеВыбора25.Родитель = РамкаГруппы1;
    ПолеВыбора25.Размер = Ф.Размер(433, 24);
    ПолеВыбора25.ПорядокОбхода = 23;
    ПолеВыбора25.ВысотаЭлемента = 16;
    ПолеВыбора25.Доступность = Ложь;
    ПолеВыбора25.ИндексВыбранногоИзменен = Ф.Действие(ЭтотОбъект, "НаследоватьМетод");
    ПолеВыбора25.Положение = Ф.Точка(125, 50);
    ПолеВыбора25.ШиринаВыпадающегоСписка = 405;
    ПолеВыбора25.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

    Флажок1.Родитель = РамкаГруппы1;
    Флажок1.Размер = Ф.Размер(77, 24);
    Флажок1.ПорядокОбхода = 24;
    Флажок1.Доступность = Ложь;
    Флажок1.Положение = Ф.Точка(481, 21);
    Флажок1.Текст = "Автомат";
    Флажок1.Шрифт = Ф.Шрифт("Microsoft Sans Serif", 9.75, );

КонецПроцедуры

Процедура НачальноеЗаполнениеФормы()
	ПолеВыбора22.Текст = ""; // Класс
	ПолеВвода3.Текст = ""; // МетодОписание
	ПолеВвода4.Текст = ""; // МетодИмяРус
	ПолеВвода5.Текст = ""; // МетодИмяEn
	ПолеВыбора2.Текст = ""; // ВозвращаемоеЗначениеТип
	ПолеВвода8.Текст = ""; // ВозвращаемоеЗначениеОписание
	
	Для А = 0 По ПанельВкладок1.Вкладки.Количество - 1 Цикл
		Вкладка = ПанельВкладок1.Вкладки(А);
		Для А1 = 0 По Вкладка.ЭлементыУправления.Количество - 1 Цикл
			Элемент = Вкладка.ЭлементУправления(А1);
			Если ТипЗнч(Элемент) = Тип("КлПолеВвода") или ТипЗнч(Элемент) = Тип("КлПолеВыбора") Тогда
				Элемент.Текст = "";
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ЗаполнитьПолеВыбора22();
	ЗаполнитьПолеВыбора24();
	ЗаполнитьПолеВыбораТип();
	Флажок1.Помечен = Ложь;
КонецПроцедуры

Процедура ЗаполнитьПолеВыбораТип()
	Список14 = Новый СписокЗначений();
	Список14 = ДобавитьПеречисления(Список14);

	ТекстДок = Новый ТекстовыйДокумент;
	ТекстДок.Прочитать(ПутьКОглавлению);
	Стр = ТекстДок.ПолучитьТекст();
	М = СтрНайтиМежду(Стр, 
			"menu2", 
			"</summary>", 
			, );
			// right">Действие (Action) Класс</a></summary>
	Если М.Количество() > 0 Тогда
		// Сообщить("М[0] = " + М[0]);
		Для А = 0 По М.ВГраница() Цикл
			М2 = СтрНайтиМежду(М[А], "right"">", "</a>", , );
			Если М2.Количество() > 0 Тогда
				// Сообщить("М2[0] = " + М2[0]);
				Для А2 = 0 По М2.ВГраница() Цикл
					Если Не (М2[0] = "Перечисления") Тогда
						СтрКласс = М2[0];
						СтрКласс = СтрЗаменить(СтрКласс, "(", "");
						СтрКласс = СтрЗаменить(СтрКласс, ")", "");
						СтрКласс = СтрЗаменить(СтрКласс, " Класс", "");
						// Сообщить("М2[0] = " + М2[0]);
						
						СтрКласс2En = СтрНайтиМежду(М2[0], "(", ")", , )[0];
						Фрагмент33 = "№" + М2[0];
						СтрКласс2Ru = СокрЛП(СтрНайтиМежду(Фрагмент33, "№", " (", , )[0]);
						СтрКласс2 = "Тип: <a href=""OSIntegrator." + СтрКласс2En + ".html"">" + СтрКласс2Ru + "&nbsp;(" + СтрКласс2En + ")</a>.";
						Если Список14.НайтиПоЗначению(СтрКласс2) = Неопределено Тогда
							Список14.Добавить(СтрКласс2, СтрКласс2Ru);
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
						
	Список14.СортироватьПоПредставлению();
	Для А45 = 0 По Список14.Количество() - 1 Цикл
		ПолеВыбора2.Элементы.Добавить(Список14.Получить(А45).Значение);
		ПолеВыбора3.Элементы.Добавить(Список14.Получить(А45).Значение);
		ПолеВыбора4.Элементы.Добавить(Список14.Получить(А45).Значение);
		ПолеВыбора6.Элементы.Добавить(Список14.Получить(А45).Значение);
		ПолеВыбора8.Элементы.Добавить(Список14.Получить(А45).Значение);
		ПолеВыбора10.Элементы.Добавить(Список14.Получить(А45).Значение);
		ПолеВыбора12.Элементы.Добавить(Список14.Получить(А45).Значение);
		ПолеВыбора14.Элементы.Добавить(Список14.Получить(А45).Значение);
		ПолеВыбора16.Элементы.Добавить(Список14.Получить(А45).Значение);
		ПолеВыбора18.Элементы.Добавить(Список14.Получить(А45).Значение);
		ПолеВыбора20.Элементы.Добавить(Список14.Получить(А45).Значение);
	КонецЦикла;
КонецПроцедуры

Функция ДобавитьПеречисления(СписокДляПеречислений)
	ТекстДок = Новый ТекстовыйДокумент;
	ТекстДок.Прочитать(ПутьКОглавлению);
	Стр56 = ТекстДок.ПолучитьТекст();
	М56 = СтрНайтиМежду(Стр56, 
			"Enumeration.html"" target=""right"">", 
			"</a>", 
			, );
	Если М56.Количество() > 0 Тогда
		// Сообщить("М56[0] = " + М56[0]);
		Для А57 = 0 По М56.ВГраница() Цикл
			СтрПеречисл = М56[А57];
			// Сообщить("СтрПеречисл = " + СтрПеречисл);
			
			СтрКласс2En = СтрНайтиМежду(СтрПеречисл, "(", ")", , )[0];
			Фрагмент33 = "№" + СтрПеречисл;
			СтрКласс2Ru = СокрЛП(СтрНайтиМежду(Фрагмент33, "№", " (", , )[0]);
			СтрКласс2 = "Тип: <a href=""OSIntegrator." + СтрКласс2En + "Enumeration.html"">" + СтрКласс2Ru + "&nbsp;(" + СтрКласс2En + ")</a>.";
			Если СписокДляПеречислений.НайтиПоЗначению(СтрКласс2) = Неопределено Тогда
				СписокДляПеречислений.Добавить(СтрКласс2, СтрКласс2Ru);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Возврат СписокДляПеречислений;
КонецФункции

Процедура ЗаполнитьПолеВыбора24()
	Список = Новый СписокЗначений();
	ВыбранныеФайлы = НайтиФайлы(ПутьКДокументации, "*.html", Истина);
	Для А = 0 По ВыбранныеФайлы.ВГраница() Цикл
		Если СтрНайти(ВыбранныеФайлы[А].Имя, "Methods.html") > 0 Тогда
			// Сообщить("" + ВыбранныеФайлы[А].ПолноеИмя);
			ТекстДок = Новый ТекстовыйДокумент;
			ТекстДок.Прочитать(ВыбранныеФайлы[А].ПолноеИмя);
			Стр = ТекстДок.ПолучитьТекст();
			
			КлассРусАнгл = СтрНайтиМежду(Стр, "<h1 class=dtH1>", "Методы</h1>", , )[0];
			КлассРусАнгл = СтрЗаменить(КлассРусАнгл, "&nbsp;", " ");
			КлассРусАнгл = СтрЗаменить(КлассРусАнгл, "(", "");
			КлассРусАнгл = СтрЗаменить(КлассРусАнгл, ")", "");
			КлассРусАнгл = СокрЛП(КлассРусАнгл);
			
			М2 = СтрНайтиМежду(Стр, "<tbody>", "</tbody>", , );
			Если М2.Количество() > 0 Тогда
				// Сообщить("" + М2[1]);
				М3 = СтрНайтиМежду(М2[1], "<tr vAlign=top>", "</tr>", Ложь, );
				Для А3 = 0 По М3.ВГраница() Цикл
					// Сообщить("" + М3[А3]);
					М4 = СтрНайтиМежду(М3[А3], "html"">", "</a>", , );
					Если М4.Количество() > 0 Тогда
						Для А4 = 0 По М4.ВГраница() Цикл
							// Сообщить("М4[0] = " + М4[0]);
							ИмяМетода = М4[0];
							ИмяМетода = СтрЗаменить(ИмяМетода, "&nbsp;", " ");
							ИмяМетода = СтрЗаменить(ИмяМетода, "(", "");
							ИмяМетода = СтрЗаменить(ИмяМетода, ")", "");
							
							Если Список.НайтиПоЗначению(ИмяМетода) = Неопределено Тогда
								Список.Добавить(ИмяМетода, КлассРусАнгл);
								// Сообщить("" + ИмяМетода + " " + КлассРусАнгл);
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Список.СортироватьПоЗначению();
	Для А = 0 По Список.Количество() - 1 Цикл
		ПолеВыбора24.Элементы.Добавить(Список.Получить(А).Значение + " " + Список.Получить(А).Представление);
	КонецЦикла;
КонецПроцедуры

Процедура ЗаполнитьПолеВыбора22()
	ТекстДок = Новый ТекстовыйДокумент;
	ТекстДок.Прочитать(ПутьКОглавлению);
	Стр = ТекстДок.ПолучитьТекст();
	М = СтрНайтиМежду(Стр, 
			"menu2", 
			"</summary>", 
			, );
	Если М.Количество() > 0 Тогда
		// Сообщить("М[0] = " + М[0]);
		Для А = 0 По М.ВГраница() Цикл
			М2 = СтрНайтиМежду(М[А], "right"">", "</a>", , );
			Если М2.Количество() > 0 Тогда
				// Сообщить("М2[0] = " + М2[0]);
				Для А2 = 0 По М2.ВГраница() Цикл
					СтрКласс = М2[0];
					СтрКласс = СтрЗаменить(СтрКласс, "(", "");
					СтрКласс = СтрЗаменить(СтрКласс, ")", "");
					СтрКласс = СтрЗаменить(СтрКласс, " Класс", "");
					ПолеВыбора22.Элементы.Добавить(СтрКласс);
					ПолеВыбора23.Элементы.Добавить(СтрКласс);
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Функция РазобратьСтроку(Строка, Разделитель)
	Стр = СтрЗаменить(Строка,Разделитель,символы.ПС);
	М = Новый Массив;
	Если ПустаяСтрока(Стр) Тогда
		Возврат М;
	КонецЕсли;
	Для Ч = 1 По СтрЧислоСтрок(Стр) Цикл
		М.Добавить(СтрПолучитьСтроку(Стр,Ч));
	КонецЦикла;
	Возврат М;
КонецФункции

Функция СтрНайтиМежду(СтрПараметр, Фрагмент1 = Неопределено, Фрагмент2 = Неопределено, ИсключитьФрагменты = Истина, БезНаложения = Истина)
	//Стр - исходная строка
	//Фрагмент1 - подстрока поиска от которой ведем поиск
	//Фрагмент2 - подстрока поиска до которой ведем поиск
	//ИсключитьФрагменты - не включать Фрагмент1 и Фрагмент2 в результат
	//БезНаложения - в результат не будут включены участки, содержащие другие найденные участки, удовлетворяющие переданным параметрам
	//функция возвращает массив строк
	Стр = СтрПараметр;
	М = Новый Массив;
	Если (Фрагмент1 <> Неопределено) и (Фрагмент2 = Неопределено) Тогда
		Позиция = Найти(Стр, Фрагмент1);
		Пока Позиция > 0 Цикл
			М.Добавить(?(ИсключитьФрагменты, Сред(Стр, Позиция + СтрДлина(Фрагмент1)), Сред(Стр, Позиция)));
			Стр = Сред(Стр, Позиция + 1);
			Позиция = Найти(Стр, Фрагмент1);
		КонецЦикла;
	ИначеЕсли (Фрагмент1 = Неопределено) и (Фрагмент2 <> Неопределено) Тогда
		Позиция = Найти(Стр, Фрагмент2);
		СуммаПозиций = Позиция;
		Пока Позиция > 0 Цикл
			М.Добавить(?(ИсключитьФрагменты, Сред(Стр, 1, СуммаПозиций - 1), Сред(Стр, 1, СуммаПозиций - 1 + СтрДлина(Фрагмент2))));
			Позиция = Найти(Сред(Стр, СуммаПозиций + 1), Фрагмент2);
			СуммаПозиций = СуммаПозиций + Позиция;
		КонецЦикла;
	ИначеЕсли (Фрагмент1 <> Неопределено) и (Фрагмент2 <> Неопределено) Тогда
		Позиция = Найти(Стр, Фрагмент1);
		Пока Позиция > 0 Цикл
			Стр2 = ?(ИсключитьФрагменты, Сред(Стр, Позиция + СтрДлина(Фрагмент1)), Сред(Стр, Позиция));
			Позиция2 = Найти(Стр2, Фрагмент2);
			СуммаПозиций2 = Позиция2;
			Пока Позиция2 > 0 Цикл
				Если БезНаложения Тогда
					Если Найти(Сред(Стр2, 1, СуммаПозиций2 - 1), Фрагмент2) = 0 Тогда
						М.Добавить("" + ?(ИсключитьФрагменты, Сред(Стр2, 1, СуммаПозиций2 - 1), Сред(Стр2, 1, СуммаПозиций2 - 1 + СтрДлина(Фрагмент2))));
					КонецЕсли;
				Иначе
					М.Добавить("" + ?(ИсключитьФрагменты, Сред(Стр2, 1, СуммаПозиций2 - 1), Сред(Стр2, 1, СуммаПозиций2 - 1 + СтрДлина(Фрагмент2))));
				КонецЕсли;
				Позиция2 = Найти(Сред(Стр2, СуммаПозиций2 + 1), Фрагмент2);
				СуммаПозиций2 = СуммаПозиций2 + Позиция2;
			КонецЦикла;
			Стр = Сред(Стр, Позиция + 1);
			Позиция = Найти(Стр, Фрагмент1);
		КонецЦикла;
	КонецЕсли;
	
	Возврат М;
КонецФункции//СтрНайтиМежду

ПодготовкаКомпонентов();

ПутьКСтранице = "C:\444\OneScriptIntegrator\docs\OSIntegrator\OSIntegrator.";
ПутьКДокументации = "C:\444\OneScriptIntegrator\docs\OSIntegrator\";
ПутьКОглавлению = "C:\444\OneScriptIntegrator\docs\doc.html";
ВыходнойКаталог = "C:\444\OneScriptIntegrator\НовыеHtml";// без слэша в конце

КлассИмяРус = "КлассИмяРус";//!!!!!!!!!!!!!!!!!!!!
КлассИмяEn = "КлассИмяEn";//!!!!!!!!!!!!!!!!!!!!

МетодИмяРус = "МетодИмяРус";//!!!!!!!!!!!!!!!!!!!!
МетодИмяEn = "МетодИмяEn";//!!!!!!!!!!!!!!!!!!!!
МетодОписание = "МетодОписание";//!!!!!!!!!!!!!!!!!!!!

ВозвращаемоеЗначениеТип = "ВозвращаемоеЗначениеТип";//!!!!!!!!!!!!!!!!!!!!
ВозвращаемоеЗначениеОписание = "ВозвращаемоеЗначениеОписание";//!!!!!!!!!!!!!!!!!!!!

М_Параметров = Новый Массив();
БезСообщения = Ложь;

НачальноеЗаполнениеФормы();

// ...

Ф.ЗапуститьОбработкуСобытий();
