// В файлах справки C:\444\OneScriptIntegrator\docs\OSIntegrator находит страницы методов и свойств без тестовых кодов.

Процедура СтраницыБезТестовыхКодов()
	Таймер = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	ПодключитьВнешнююКомпоненту("OneScriptForms.dll");
	Ф = Новый ФормыДляОдноСкрипта();
	
	ВыбранныеФайлы = НайтиФайлы("C:\444\OneScriptIntegrator\docs\OSIntegrator", "*.html", Истина);
	БезТестов = 0;
	
	БезПримеров = 0;
	БезПолных = 0;
	// // // БезТестовых = 0;

	ВсегоНайдено = 0;
	Для А = 0 По ВыбранныеФайлы.ВГраница() Цикл
		УчестьЭтотФайл = Ложь;
		// Сообщить("Файл " + А + " из " + ВыбранныеФайлы.ВГраница() + " - " + ВыбранныеФайлы[А].ПолноеИмя);
		ТекстДок = Новый ТекстовыйДокумент;
		ТекстДок.Прочитать(ВыбранныеФайлы[А].ПолноеИмя);
		Стр = ТекстДок.ПолучитьТекст();
		// 
		М = Ф.СтрНайтиМежду(Стр, "<h1 class=dtH1>", "</h1>", , );
		Если М.Количество > 0 Тогда
			Заголовок = Ф.СтрНайтиМежду(Стр, "<h1 class=dtH1>", "</h1>", , ).Элемент(0);
			Заголовок = СтрЗаменить(Заголовок, "&nbsp;", " ");
			ВсегоНайдено = ВсегоНайдено + 1;
			М0 = Ф.СтрНайтиМежду(Стр, "<h4 class=dtH4>Пример</h4>", "</pre>", , );
			Для А1 = 0 По М0.Количество - 1 Цикл
				СтрКода = М0.Элемент(А1);
				СтрКода = СтрЗаменить(СтрКода, "<pre class=code>", "");
				СтрКода = СтрЗаменить(СтрКода, "<p>", "");
				Если СтрДлина(СокрЛП(СтрКода)) > 0 Тогда
					
				Иначе
					УчестьЭтотФайл = Истина;
					Сообщить("Нет примера " + ВыбранныеФайлы[А].ПолноеИмя + " " + Заголовок);
					БезПримеров = БезПримеров + 1;
				КонецЕсли;
			КонецЦикла;
			
			М5 = Ф.СтрНайтиМежду(Стр, "<summary>Полный пример кода</summary>", "</pre>", , );
			Для А1 = 0 По М5.Количество - 1 Цикл
				СтрКода = М5.Элемент(А1);
				// Сообщить("СтрКода = " + СтрКода);
				М3 = Ф.СтрНайтиМежду(СтрКода, "<div id=""", "</div>", Ложь, );
				Для А3 = 0 По М3.Количество - 1 Цикл
					СтрКода1 = М3.Элемент(А3);
					// Сообщить("СтрКода1 = " + СтрКода1);
					М2 = Ф.СтрНайтиМежду(СтрКода1, ">", "</div>", , );
					Для А2 = 0 По М2.Количество - 1 Цикл
						СтрКода2 = М2.Элемент(А2);
						// Сообщить("СтрКода2 = " + СтрКода2);
						Если СтрДлина(СокрЛП(СтрКода2)) > 0 Тогда
							
						Иначе
							УчестьЭтотФайл = Истина;
							Сообщить("Нет полного примера " + ВыбранныеФайлы[А].ПолноеИмя + " " + Заголовок);
							БезПолных = БезПолных + 1;
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;
				
				
			КонецЦикла;
			
			
			
			// // // М2 = Ф.СтрНайтиМежду(Стр, "<div id=""cont2"">", "</div>", , );
			// // // Для А1 = 0 По М2.Количество - 1 Цикл
				// // // СтрКода= М2.Элемент(А1);
				// // // Если СтрДлина(СокрЛП(СтрКода)) > 0 Тогда
					
				// // // Иначе
					// // // УчестьЭтотФайл = Истина;
					// // // Сообщить("Нет теста " + ВыбранныеФайлы[А].ПолноеИмя + " " + Заголовок);
					// // // БезТестовых = БезТестовых + 1;
				// // // КонецЕсли;
			// // // КонецЦикла;
		Иначе
			Сообщить("" + ВыбранныеФайлы[А].ПолноеИмя);
		КонецЕсли;
		Если УчестьЭтотФайл Тогда
			БезТестов = БезТестов + 1;
		КонецЕсли;
	КонецЦикла;
	
	Сообщить("ВсегоНайдено = " + ВсегоНайдено);
	Сообщить("БезТестов = " + БезТестов);
	Сообщить("С тестами = " + (ВсегоНайдено - БезТестов));
	Сообщить("=================================================");
	Сообщить("БезПримеров = " + БезПримеров);
	Сообщить("БезПолных = " + БезПолных);
	// // // Сообщить("БезТестовых = " + БезТестовых);
	
	Сообщить("Выполнено за: " + ((ТекущаяУниверсальнаяДатаВМиллисекундах() - Таймер)/1000)/60 + " мин.");
КонецПроцедуры//СтраницыБезТестовыхКодов()

СтраницыБезТестовыхКодов();
