// Библиотека OneScriptIntegrator.dll должна лежать рядом с этим сценарием.
Перем ИОС, Таймер, Вин;
Перем КаталогСправки, КаталогТестов;
Перем Сбойных, Всего, НачальныйНомерФайла;
Перем Код;
Перем КоличествоЗаданий;
Перем БлокировкаРесурса1;

Процедура ЗапускКодов()
	ВыбранныеФайлы = НайтиФайлы(КаталогСправки, "*.html", Истина);
	Для А = НачальныйНомерФайла По ВыбранныеФайлы.ВГраница() Цикл //ВыбранныеФайлы.ВГраница()
		ТекстДок = Новый ТекстовыйДокумент;
		ТекстДок.Прочитать(ВыбранныеФайлы[А].ПолноеИмя);
		Стр = ТекстДок.ПолучитьТекст();

		Заголовок = "";
		М0 = ИОС.СтрНайтиМежду(Стр, "<h1 class=dtH1>", "</h1>", , );
		Если М0.Количество() > 0 Тогда
			Заголовок = СтрЗаменить(М0.Получить(0), "&nbsp;", " ");
		КонецЕсли;
		
		М = ИОС.СтрНайтиМежду(Стр, "<summary>Полный пример кода</summary>", "</pre>", Ложь, );
		Если М.Количество() > 0 Тогда
			СтрСообщения = "(" + ИОС.Математика().Окр(((ТекущаяУниверсальнаяДатаВМиллисекундах() - Таймер)/1000)/60, 2) + " мин." + " " + А + " из " + 
			ВыбранныеФайлы.ВГраница() + ") " + ВыбранныеФайлы[А].ПолноеИмя + " /" + Заголовок;
			
			Для А2 = 0 По М.ВГраница() Цикл
				ТестовыйКод = ИОС.СтрНайтиМежду(М.Получить(А2), "<div id=""", "</div>", Ложь, ).Получить(0);
				ТестовыйКод = ИОС.СтрНайтиМежду(ТестовыйКод, """>", "</div>", , ).Получить(0);
				
				Если Не (СокрЛП(ТестовыйКод) = "") Тогда
					ТестируемыйФайл = ОбъединитьПути(ИОС.КаталогСценария(ЭтотОбъект), "Temp" + ПолучитьРазделительПути() + "" + ИОС.СлучайноеИмя + ".os");
					ИОС.ЗаписатьВесьТекст(ТестируемыйФайл, ТестовыйКод);
					Пока Не Новый Файл(ТестируемыйФайл).Существует() Цикл
						Приостановить(100);
					КонецЦикла;
					
					Если Вин Тогда
						Пока КоличествоЗаданий.Количество() > 15 Цикл 
							Приостановить(500);
						КонецЦикла;
					Иначе
						Пока КоличествоЗаданий.Количество() > 5 Цикл 
							Приостановить(500);
						КонецЦикла;
					КонецЕсли;
					
					Всего = Всего + 1;

					Если Вин Тогда
						Попытка
							ИмяФайлаOscript = ОбъединитьПути(КаталогПрограммы(), "oscript.exe");
							РабочийКаталог = ИОС.КаталогСценария(ЭтотОбъект);
							МассивПараметров = Новый Массив(4);
							МассивПараметров[0] = ТестируемыйФайл; // Тестируемый файл.
							МассивПараметров[1] = ИмяФайлаOscript;
							МассивПараметров[2] = РабочийКаталог;
							МассивПараметров[3] = СтрСообщения;
							Задание = ФоновыеЗадания.Выполнить(ЭтотОбъект, "ЗапуститьКоманду", МассивПараметров);
							
							БлокировкаРесурса1.Заблокировать();
							КоличествоЗаданий.Добавить(СтрСообщения);
							БлокировкаРесурса1.Разблокировать();
						Исключение
							Сообщить("Ошибка ФоновыеЗадания.Выполнить: " + ТестируемыйФайл);
						КонецПопытки;
					Иначе
						Попытка
							МассивПараметров = Новый Массив(2);
							МассивПараметров[0] = ТестируемыйФайл;
							МассивПараметров[1] = СтрСообщения;
							Задание = ФоновыеЗадания.Выполнить(ЭтотОбъект, "ЗапуститьТестАвто", МассивПараметров);
							
							БлокировкаРесурса1.Заблокировать();
							КоличествоЗаданий.Добавить(СтрСообщения);
							БлокировкаРесурса1.Разблокировать();
						Исключение
							Сообщить("Ошибка ФоновыеЗадания.Выполнить: " + ТестируемыйФайл);
						КонецПопытки;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры//ЗапускКодов

Процедура ЗапуститьТестАвто(ТестируемыйФайл, СтрСообщения) Экспорт
    СтрокаКоманды = "oscript"+ " " + ТестируемыйФайл;

    ДождатьсяЗавершения = Истина;
    КодВозврата = Неопределено;
	Попытка
		ЗапуститьПриложение(СтрокаКоманды, , ДождатьсяЗавершения, КодВозврата);
		Сообщить("КодВозврата = " + КодВозврата + " - " + СтрСообщения);
		
		Если Не КодВозврата = 0 Тогда
			Сбойных = Сбойных + 1;
		КонецЕсли;

		БлокировкаРесурса1.Заблокировать();
		Номер = КоличествоЗаданий.Найти(СтрСообщения);
		Если Не Номер = Неопределено Тогда
			КоличествоЗаданий.Удалить(Номер);
		КонецЕсли;
		БлокировкаРесурса1.Разблокировать();
	Исключение
		Сообщить("Ошибка ЗапуститьТестАвто для: " + СтрСообщения);
	КонецПопытки;
КонецПроцедуры

Процедура ЗапуститьКоманду(ТестируемыйФайл, ИмяФайлаOscript, ТекущийКаталог, СтрСообщения) Экспорт
	// СтрокаКоманды = "cmd.exe /K " + """" + ИмяФайлаOscript + """" + " " + ТестируемыйФайл; // Здесь немного другое поведение.
	СтрокаКоманды = """" + ИмяФайлаOscript + """" + " " + ТестируемыйФайл;
	
	ДождатьсяЗавершения = Истина;
	КодВозврата = Неопределено;
	ТекущийПример = СтрСообщения;
	Попытка
		ЗапуститьПриложение(СтрокаКоманды, ТекущийКаталог, ДождатьсяЗавершения, КодВозврата);
		Сообщить("КодВозврата = " + КодВозврата + " - " + ТекущийПример);
		
		Если Не КодВозврата = 0 Тогда
			Сбойных = Сбойных + 1;
		КонецЕсли;
		
		БлокировкаРесурса1.Заблокировать();
		Номер = КоличествоЗаданий.Найти(СтрСообщения);
		Если Не Номер = Неопределено Тогда
			КоличествоЗаданий.Удалить(Номер);
		КонецЕсли;
		БлокировкаРесурса1.Разблокировать();
	Исключение
		Сообщить("Ошибка ЗапуститьПриложение: " + ТестируемыйФайл);
	КонецПопытки;
КонецПроцедуры

Таймер = ТекущаяУниверсальнаяДатаВМиллисекундах();

КоличествоЗаданий = Новый Массив();
БлокировкаРесурса1 = Новый БлокировкаРесурса(КоличествоЗаданий);

КаталогTemp = ОбъединитьПути(Новый Файл(ТекущийСценарий().Источник).Путь, "Temp");
Если Не Новый Файл(КаталогTemp).Существует() Тогда
	СоздатьКаталог(КаталогTemp);
КонецЕсли;
Пока Не Новый Файл(КаталогTemp).Существует() Цикл
	Приостановить(100);
КонецЦикла;

Источник = ОбъединитьПути(Новый Файл(ТекущийСценарий().Источник).Путь, "OneScriptIntegrator.dll");
Назначение = ОбъединитьПути(Новый Файл(ТекущийСценарий().Источник).Путь, "Temp" + ПолучитьРазделительПути() + "OneScriptIntegrator.dll");
Попытка
	КопироватьФайл(Источник, Назначение);
Исключение
	Сообщить("Не удалось скопировать библиотеку из " + Источник + " в " + Назначение);
	ЗавершитьРаботу(1);
КонецПопытки;

Сбойных = 0;
Всего = 0;
НачальныйНомерФайла = 0;
Вин = Ложь;

ПодключитьВнешнююКомпоненту(ОбъединитьПути(Новый Файл(ТекущийСценарий().Источник).Путь, "OneScriptIntegrator.dll"));
ИОС = Новый ИнтеграторОдноСкрипта();

Если СтрНайти((Новый СистемнаяИнформация()).ВерсияОС, "Windows") > 0 Тогда
	Вин = Истина;
КонецЕсли;

// Все пути, необходимые для тестирования будем вычислять из пути к файлам справки html.
// Он может различаться для разных разработок и не стандартизован.
// Остальные пути однотипны по названиям и могут быть вычислены для всех моих проектов.
Если Вин Тогда
	КаталогСправки = ОбъединитьПути("C:\444\OneScriptIntegrator\docs\OSIntegrator", "");
Иначе
	КаталогСправки = ОбъединитьПути("/home/vlad/Projects/444/OneScriptIntegrator/docs/OSIntegrator", "");
КонецЕсли;
КаталогРазработки = ИОС.РодительскийКаталог(ИОС.РодительскийКаталог(КаталогСправки));
КаталогТестов = ОбъединитьПути(КаталогРазработки, "Scripts" + ПолучитьРазделительПути() + "Temp");

УдалитьФайлы(КаталогТестов, "*.tmp");
УдалитьФайлы(КаталогТестов, "*.os");

ЗапускКодов();

// Ждём завершения всех заданий
Колич = КоличествоЗаданий.Количество();
Счетчик = 0;
СтараяСтрока = "";
Пока Колич > 0 и Счетчик < 60 Цикл
    Приостановить(2000);
	Колич = КоличествоЗаданий.Количество();
	НоваяСтрока = "Незавершено = " + Колич + Символы.ПС;
	
	БлокировкаРесурса1.Заблокировать();
	Для А = 0 По КоличествоЗаданий.ВГраница() Цикл
		Эл = КоличествоЗаданий.Получить(А);
		НоваяСтрока = НоваяСтрока + Эл + Символы.ПС;
	КонецЦикла;
	БлокировкаРесурса1.Разблокировать();
	
	Если Не СтараяСтрока = НоваяСтрока Тогда
		Сообщить("" + Символы.ПС + НоваяСтрока);
	КонецЕсли;
	СтараяСтрока = НоваяСтрока;
	Счетчик = Счетчик + 1;
КонецЦикла;

Сообщить("==========================================================");
Сообщить("Сбойных = " + Сбойных);
Сообщить("Всего = " + Всего);

Сообщить("Выполнено за: " + ((ТекущаяУниверсальнаяДатаВМиллисекундах() - Таймер)/1000)/60 + " мин.");
ЗавершитьРаботу(0);
